Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: You need to choose at least one channel.
uk: Вам потрібно вибрати хоча б один канал.

source: Pick log file to write to:
uk: Виберіть файл журналу для запису:

source: %s per div
uk: %s на ділю

source: %s samples at %s
uk: %s зразки на %s

source: ns
uk: нс

source: µs
uk: всьо

source: ms
uk: мс

source: s
uk: с

source: Offset %s
uk: Зсув %s

source: Gain
uk: Посилення

source: Pos
uk: Поз

source: Scale
uk: Масштаб

source: Offset ----
uk: Зсув ----

source: Set the vertical offset for channel %d.
uk: Встановити вертикальне зміщення для каналу %d.

source: Set Offset
uk: Встановити зсув

source: AC Coupled
uk: AC З'єднані

source: Select Channel %d Source
uk: Вибрати джерело каналу %d

source: Pins
uk: Піни

source: Signals
uk: Сигнали

source: Parameters
uk: Параметри

source: Falling
uk: Падіння

source: Rising
uk: Зростаючий

source: Source None
uk: Джерело Жодне

source: Source Chan %2d
uk: Джерело Чан %2d

source: Auto
uk: Авто

source: Force
uk: Сила

source: Level
uk: Рівень

source: Select a channel to use for triggering.
uk: Виберіть канал, який використовуватиметься для запуску.

source: Trigger Source
uk: Джерело тригера

source: Chan
uk: Чан

source: Source
uk: Джерело

source: fault %d during orient in progress
uk: помилка %d під час орієнтації триває

source: G38.4 move finished without breaking contact.
uk: Рух G38.4 завершено без розриву контакту.

source: G38.2 move finished without making contact.
uk: Рух G38.2 завершено без контакту.

source: Probe tripped during non-probe move.
uk: Зонд спрацював під час руху, що не пов'язаний з зондом.

source: Probe tripped during homing motion.
uk: Зонд спрацював під час руху до нуля.

source: Probe tripped during a joint jog.
uk: Зонд спрацював під час спільного поштовху.

source: Probe tripped during a coordinate jog.
uk: Зонд спрацював під час поштовхового переміщення по координатах.

source: motion stopped by enable input
uk: рух зупинено введенням дозволу

source: spindle %d amplifier fault
uk: Помилка підсилювача шпинделя %d

source: joint %d on limit switch error
uk: з'єднання %d на помилці кінцевого вимикача

source: joint %d amplifier fault
uk: несправність підсилювача %d спільного

source: joint %d following error
uk: помилка після суглоба %d

source: Motion Stopped by misc error %d
uk: Рух зупинено через різну помилку %d

source: kinematicsInverse gave non-finite joint location on joint %d
uk: kinematicsInverse видала некінцеве розташування суглоба на суглобі %d

source: kinematicsInverse failed
uk: kinematicsInverse не вдалося

source: Exceeded NEGATIVE soft limit (%.5f) on joint %d
uk: Перевищено ВІД'ЄМНУ програмну межу (%.5f) на з'єднанні %d

source: Joint must be unhomed, jogged into limits, rehomed
uk: Стик має бути розігнаний, зміщений у межі, перехований

source: Hint: switch to joint mode to jog off soft limit
uk: Підказка: перемкніться в режим спільного руху, щоб вимкнути м'яке обмеження

source: Exceeded POSITIVE soft limit (%.5f) on joint %d
uk: Перевищено ПОЗИТИВНУ м'яку межу (%.5f) на з'єднанні %d

source: Can't jog invalid joint number %d.
uk: Неможливо виконати штовхання з недійсним номером з'єднання %d.

source: Can't jog joint %d further past max hard limit.
uk: Неможливо перемістити з'єднання %d далі за максимальну жорстку межу.

source: Can't jog joint %d further past min hard limit.
uk: Неможливо перемістити з'єднання %d далі за мінімальне жорстке обмеження.

source: Can't jog joint %d further past max soft limit.
uk: Неможливо перемістити з'єднання %d далі максимальної м'якої межі.

source: Can't jog joint %d further past min soft limit.
uk: Неможливо перемістити з'єднання %d далі за мінімальну програмну межу.

source: %s move on line %d would exceed %c's %s limit
uk: %s рухатися онлайн %d перевищить %c's %s ліміт

source: negative
uk: негативний

source: positive
uk: позитивний

source: %s move on line %d fails kinematicsInverse
uk: %s рух по лінії %d не вдається виконати кінематикуInverse

source: %s move on line %d gave non-finite joint location on joint %d
uk: %s переміщення на лінії %d видало некінцеве розташування суглоба на суглобі %d

source: %s move on line %d would exceed joint %d's positive limit max:[%f]
uk: %s рух по лінії %d перевищить додатну межу з'єднання %d:[%f]

source: %s move on line %d would exceed joint %d's negative limit min:[%f]
uk: %s рух по лінії %d перевищить від'ємну межу з'єднання %d:[%f]

source: all joints must be homed before going into coordinated mode
uk: всі з'єднання повинні бути повернуті до вихідного положення перед переходом у скоординований режим

source: Can't jog joint when not enabled.
uk: Неможливо перемістити з'єднання, якщо воно не ввімкнено.

source: Cannot jog while jog-inhibit is active.
uk: Неможливо виконувати штовхання, коли активовано блокування штовхання.

source: Can't jog any joints while homing.
uk: Не можна рухати суглобами під час повернення додому.

source: Can't jog any joint while homing.
uk: Не можу поштовхнути жодним суглобом під час повернення додому.

source: need to be enabled, in coord mode for linear move
uk: потрібно ввімкнути в режимі координат для лінійного переміщення

source: invalid params in linear command
uk: недійсні параметри в лінійній команді

source: can't do linear move with limits exceeded
uk: не можна виконати лінійний рух з перевищенням обмежень

source: can't add linear move at line %d, error code %d
uk: Не вдається додати лінійний переміщення на рядку %d, код помилки %d

source: need to be enabled, in coord mode for circular move
uk: потрібно ввімкнути в режимі координації для кругового руху

source: can't do circular move with limits exceeded
uk: не можна виконувати круговий рух з перевищенням обмежень

source: can't add circular move at line %d, error code %d
uk: Не вдається додати круговий рух у рядку %d, код помилки %d

source: MOTION: can't STEP while already executing
uk: РУХ: неможливо СТЕРІНГУВАТИ, поки вже виконується

source: can't enable motion, enable input is false
uk: не вдається ввімкнути рух, вхід увімкнення хибний

source: must be in joint mode to home
uk: має бути в режимі спільного доступу до дому

source: Homing denied by motion.homing-inhibit joint=%d
uk: Самонаведення відмовлено motion.homing-inhibit joint=%d

source: must be in joint mode or disabled to unhome
uk: має бути в спільному режимі або вимкнено, щоб розблокувати

source: need to be enabled, in coord mode for probe move
uk: потрібно ввімкнути в режимі координації для переміщення зонда

source: can't do probe move with limits exceeded
uk: неможливо виконати переміщення зонда, якщо перевищено обмеження

source: Probe is already clear when starting G38.4 or G38.5 move
uk: Зонд вже вільний під час початку руху G38.4 або G38.5

source: Probe is already tripped when starting G38.2 or G38.3 move
uk: Зонд вже спрацьовує під час запуску переміщення G38.2 або G38.3

source: can't add probe move
uk: не вдається додати переміщення зонда

source: need to be enabled, in coord mode for rigid tap move
uk: потрібно ввімкнути в координованому режимі для жорсткого руху різьблення

source: can't do rigid tap move with limits exceeded
uk: не вдається виконати жорсткий рух торканням, якщо перевищено обмеження

source: can't add rigid tap move at line %d, error code %d
uk: Не вдається додати жорсткий переміщення торканням у рядку %d, код помилки %d

source: Attempt to configure non-existent spindle
uk: Спроба налаштувати неіснуючий шпиндель

source: Attempt to start non-existent spindle
uk: Спроба запустити неіснуючий шпиндель

source: Attempt to stop non-existent spindle <%d>
uk: Спроба зупинити неіснуючий шпиндель <%d>

source: Attempt to orient non-existent spindle <%d>
uk: Спроба орієнтувати неіснуючий шпиндель <%d>

source: Attempt to increase non-existent spindle <%d>
uk: Спроба збільшити неіснуючий шпиндель <%d>

source: Attempt to decrease non-existent spindle <%d>.
uk: Спроба зменшити неіснуючий шпиндель <%d>.

source: Attempt to engage brake of non-existent spindle <%d>
uk: Спроба задіяти гальмо неіснуючого шпинделя <%d>

source: Attempt to release brake of non-existent spindle <%d>
uk: Спроба відпустити гальмо неіснуючого шпинделя <%d>

source: joint %d: too many compensation entries
uk: спільний %d: забагато записів компенсації

source: joint %d: compensation values must increase
uk: суглоб %d: значення компенсації мають збільшитися

source: unrecognized command %d
uk: нерозпізнана команда %d

source: all joints must be homed before going into teleop mode
uk: всі шарніри повинні бути відрегульовані в головне положення перед переходом у режим телеопу

source: MOTION: hal_init() failed
uk: РУХ: hal_init() не вдалося

source: MOTION: num_joints is %d, must be between 1 and %d
uk: РУХ: num_joints дорівнює %d, має бути між 1 та %d

source: MOTION: num_extrajoints is %d, must be between 0 and %d
uk: РУХ: num_extrajoints дорівнює %d, має бути між 0 та %d

source: MOTION: nonzero num_extrajoints requires KINEMATICS_BOTH
uk: РУХ: ненульовий num_extrajoints вимагає KINEMATICS_BOTH

source: MOTION: kinematicjoints=%2d extrajoints=%2d Total joints=%2d
uk: РУХ: kinematicjoints=%2d extrajoints=%2d Всього суглобів=%2d

source: MOTION: num_spindles is %d, must be between 0 and %d
uk: РУХ: кількість_шпиндел дорівнює %d, має бути між 0 та %d

source: MOTION: Can't specify both names and number for digital pins
uk: РУХ: Неможливо вказати і назви, і номер для цифрових контактів

source: MOTION: num_dio is %d, must be between 1 and %d
uk: РУХ: num_dio дорівнює %d, має бути між 1 та %d

source: MOTION: Can't specify both names and number for analog pins
uk: РУХ: Неможливо вказати і назви, і номер для аналогових контактів

source: MOTION: num_aio is %d, must be between 1 and %d
uk: РУХ: num_aio дорівнює %d, має бути між 1 та %d

source: MOTION: Can't specify both names and number for misc error
uk: РУХ: Неможливо вказати і ім'я, і номер через помилку "різне"

source: MOTION: num_misc_error is %d, must be between 0 and %d
uk: РУХ: num_misc_error дорівнює %d, має бути між 0 та %d

source: MOTION: init_hal_io() failed
uk: РУХ: init_hal_io() не вдалося

source: MOTION: init_comm_buffers() failed
uk: РУХ: init_comm_buffers() не вдалося

source: MOTION: module_intfc() failed
uk: РУХ: module_intfc() не вдалося

source: MOTION: tp_init() failed
uk: РУХ: tp_init() не вдалося

source: MOTION: init_threads() failed
uk: РУХ: init_threads() не вдалося

source: MOTION: homing_init() failed
uk: РУХ: homing_init() не вдалося

source: MOTION: hal_stop_threads() failed, returned %d
uk: РУХ: hal_stop_threads() не вдалося, повернуто %d

source: MOTION: rtapi_shmem_delete() failed, returned %d
uk: РУХ: rtapi_shmem_delete() не вдалося, повернуто %d

source: MOTION: hal_exit() failed, returned %d
uk: РУХ: hal_exit() не вдалося, повернуто %d

source: MOTION: emcmot_hal_data malloc failed
uk: РУХ: не вдалося виконати loc emcmot_hal_data

source: MOTION: spindle %d pin export failed
uk: РУХ: експорт шпинделя %d не вдався

source: MOTION: joint %d pin/param export failed
uk: РУХ: експорт виводу/параметра %d не вдався

source: MOTION: ejoint %d pin/param export failed
uk: РУХ: експорт ejoint %d pin/parameter не вдався

source: j%d hit limit in home state %d
uk: j%d ліміт досягнень у рідному штаті %d

source: j%d end of move in home state %d
uk: j%d кінець переїзду в рідному штаті %d

source: HOMING: all_joints_home_data_t malloc failed
uk: HOMING: помилка malloc для all_joints_home_data_t

source: Cannot unhome while homing, joint %d
uk: Неможливо повернути додому під час повернення додому, з'єднання %d

source: Cannot unhome while moving, joint %d
uk: Неможливо повернути додому під час руху, суглоб %d

source: Cannot unhome extrajoint <%d> with motion enabled
uk: Неможливо відійти від початкового положення позашляховика <%d>, якщо ввімкнено рух

source: homing.c Unexpected joint=%d jseq=%d current_seq=%d
uk: homing.c Несподіваний суглоб=%d jseq=%d current_seq=%d

source: unknown state '%d' during homing sequence
uk: невідомий стан '%d' під час послідовності повернення до початкового положення

source: Cannot unhome invalid joint %d (max %d)
uk: Неможливо зняти з початкового положення недійсний з'єднання %d (максимум %d)

source: Cannot unhome extrajoint <%d> with motion enabled
uk: Неможливо відійти від початкового положення extrajoint <%d>, якщо ввімкнено рух

source: Cannot unhome while homing, joint %d
uk: Неможливо повернути додому під час повернення додому, з'єднання %d

source: Cannot unhome while moving, joint %d
uk: Неможливо повернути додому під час руху, суглоб %d

source: Cannot unhome inactive joint %d
uk: Неможливо повернути неактивний суглоб %d з початкового положення

source: Cannot home while shared home switch is closed j=%d
uk: Неможливо повернутися додому, поки перемикач спільного дому закритий j=%d

source: invalid homing config: non-zero LATCH_VEL needs either SEARCH_VEL or USE_INDEX
uk: недійсна конфігурація самонаведення: ненульовий LATCH_VEL потребує або SEARCH_VEL, або USE_INDEX

source: invalid homing config: non-zero SEARCH_VEL needs LATCH_VEL
uk: недійсна конфігурація самонаведення: ненульовий SEARCH_VEL потребує LATCH_VEL

source: Home switch inactive before start of backoff move j=%d
uk: Домашній перемикач неактивний перед початком відступу j=%d

source: Home switch active before start of latch move j=%d
uk: Перемикач «Додому» активний перед початком руху фіксатора j=%d

source: Home switch inactive before start of latch move j=%d
uk: Перемикач додому неактивний до початку руху фіксатора j=%d

source: hit limit in home state j=%d
uk: ліміт потраплянь у домашньому стані j=%d

source: unknown state '%d' during homing j=%d
uk: невідомий стан '%d' під час самонаведення j=%d

source: ERROR CLASSICLADDER- Error initializing classicladder user module.
uk: ПОМИЛКА CLASSICLADDER- Помилка ініціалізації користувацького модуля classicladder.

source: Stopped program - press run button to continue.
uk: Зупинено програму – натисніть кнопку запуску, щоб продовжити.

source: Started program - press stop to pause.
uk: Запущено програму – натисніть кнопку «Стоп», щоб поставити на паузу.

source: INFO CLASSICLADDER- No ladder GUI requested-Realtime runs till HAL closes.
uk: INFO CLASSICLADDER- Не запитується графічний інтерфейс сходів – режим реального часу працює до закриття HAL.

source: Project loaded and running
uk: Проєкт завантажено та запущено

source: Project failed to load...
uk: Не вдалося завантажити проєкт...

source: GUI reloaded with existing ladder program
uk: Графічний інтерфейс перезавантажено з існуючою програмою сходинок

source: INFO CLASSICLADDER- Ladder GUI closed. Realtime runs till HAL closes
uk: INFO CLASSICLADDER0- Графічний інтерфейс сходів закрито. Режим реального часу працює до закриття HAL.

source: ERROR CLASSICLADDER- Ladder memory allocation error
uk: ERROR CLASSICLADDER- Помилка розподілу пам'яті сходової логіки

source: Load Error
uk: Помилка завантаження

source: Failed to load the project file...
uk: Не вдалося завантажити файл проєкту...

source: Ok
uk: Добре

source: Project loaded (stopped).
uk: Проєкт завантажено (зупинено).

source: Save Error
uk: Помилка збереження

source: Failed to save the project file...
uk: Не вдалося зберегти файл проекту...

source: SAVE %s %d
uk: ЗБЕРЕГТИ %s %d

source: LOAD %s %d
uk: НАВАНТАЖЕННЯ %s %d

source: Old directories projects
uk: Старі проекти каталогів

source: ClassicLadder projects
uk: Проєкти ClassicLadder

source: New
uk: Новий

source: Do you really want to clear all data ?
uk: Ви справді хочете очистити всі дані?

source: Please select the project to load
uk: Будь ласка, виберіть проєкт для завантаження

source: Sure?
uk: Звичайно?

source: Do you really want to load another project ? If not saved, all modifications on the current project will be lost
uk: Ви справді хочете завантажити інший проєкт? Якщо не зберегти, усі зміни в поточному проєкті будуть втрачені.

source: Please select the project to save
uk: Будь ласка, виберіть проєкт для збереження

source: Warning!
uk: Попередження!

source: Resetting a running program can cause unexpected behavior Do you really want to reset?
uk: Скидання налаштувань запущеної програми може спричинити неочікувану поведінку. Ви дійсно хочете скинути налаштування?

source: Reset logic data - Now running.
uk: Скидання логічних даних – Зараз працює.

source: Reset logic data done.
uk: Скидання логічних даних виконано.

source: About ClassicLadder
uk: Про ClassicLadder

source: Save SVG File
uk: Зберегти SVG-файл

source: Save PNG File
uk: Зберегти PNG-файл

source: Error
uk: Помилка

source: Yes
uk: Так

source: No
uk: Ні

source: If not saved, all modifications will be lost. Do you really want to quit ?
uk: Якщо не зберегти, усі зміни будуть втрачені. Ви справді хочете вийти?

source: Confirm!
uk: Підтвердити!

source: Do you really want to quit ?
uk: Ти справді хочеш кинути?

source: MODBUS will stop if you quit. Do you really want to quit ?
uk: MODBUS зупиниться, якщо ви вийдете. Ви справді хочете вийти?

source: ClassicLadder Section Display
uk: ClassicLadder Відображення розділу

source: Label of the current selected rung
uk: Мітка поточного вибраного рядка

source: Comment of the current selected ladder rung or sequential page
uk: Коментар до поточної вибраної сходинки або послідовної сторінки

source: Display symbols
uk: Символи відображення

source: Statusbar
uk: Рядок стану

source: Load
uk: Навантаження

source: Save
uk: Зберегти

source: Save As
uk: Зберегти як

source: Reset
uk: Скинути

source: Vars
uk: Чий

source: About
uk: Про нас

source: Editor
uk: Редактор

source: Symbols
uk: Символи

source: Config
uk: Конфігурація

source: Preview
uk: Попередній перегляд

source: Print
uk: Друк

source: %d µs
uk: %d мкс

source: Config hardware error occurred!
uk: Сталася помилка конфігурації обладнання!

source: Failed MODBUS communications
uk: Збій зв'язку MODBUS

source: Section Display of %s
uk: Розділ відображення %s

source: Rung Refresh Rate (milliseconds)
uk: Частота оновлення ланцюжка (мілісекунди)

source: Number of rungs (%d%c used)
uk: Кількість сходинок (використано %d%c)

source: Number of Bits
uk: Кількість бітів

source: Number of Words
uk: Кількість слів

source: Number of Counters
uk: Кількість лічильників

source: Number of Timers IEC
uk: Кількість таймерів IEC

source: Number of BIT Inputs HAL pins
uk: Кількість бітових входів, контакти HAL

source: Number of BIT Outputs HAL pins
uk: Кількість виходів BIT, контакти HAL

source: Number of S32in HAL pins
uk: Кількість контактів HAL S32in

source: Number of S32out HAL pins
uk: Кількість контактів HAL S32out

source: Number of Arithmetic Expressions
uk: Кількість арифметичних виразів

source: Number of Sections (%d%c used)
uk: Кількість секцій (використано %d%c)

source: Number of Symbols
uk: Кількість символів

source: Number of Timers
uk: Кількість таймерів

source: Number of Monostables
uk: Кількість моностабільних пристроїв

source: Number of Error Bits
uk: Кількість бітів помилок

source: Number of floatin HAL pins
uk: Кількість плаваючих HAL-контактів

source: Number of floatout HAL pins
uk: Кількість виведених HAL-контактів

source: Current path/filename:
uk: Поточний шлях/ім'я файлу:

source: 1st %I mapped
uk: 1-й %I нанесено на карту

source: 1st %Q mapped
uk: 1-й %Q відображено

source: Inverted
uk: Перевернутий

source: Error in I/O modbus conf: overflow for I,Q,B,IQ, or WQ mapping detected...ASKED=%i,MAX=%i
uk: Помилка в конфігурації modbus вводу/виводу: виявлено переповнення для відображення I, Q, B, IQ або WQ...ASKED=%i,MAX=%i

source: Overflow error for I,Q,B,IQ,WQ or W mapping detected...
uk: Виявлено помилку переповнення для зіставлення I, Q, B, IQ, WQ або W...

source: Serial port (blank = IP mode)
uk: Послідовний порт (порожній = IP-режим)

source: Serial baud rate
uk: Швидкість послідовного передавання даних

source: Serial data bits
uk: Біти послідовних даних

source: Serial parity
uk: Послідовний контроль парності

source: Serial stop bits
uk: Послідовні стоп-біти

source: After transmit pause - milliseconds
uk: Після паузи передачі - мілісекунди

source: After receive pause - milliseconds
uk: Пауза після отримання – мілісекунди

source: Request Timeout length - milliseconds
uk: Тривалість часу очікування запиту – мілісекунди

source: Use RTS to send
uk: Використовуйте RTS для надсилання

source: Modbus element offset
uk: Зміщення елемента Modbus

source: Debug level
uk: Рівень налагодження

source: QUIET
uk: ТИША

source: LEVEL
uk: РІВЕНЬ

source: VERBOSE
uk: ДЕТАЛІСНО

source: Read inputs map to
uk: Зчитування карти вхідних даних

source: Read Coils/inputs map to
uk: Зчитування карти котушок/входів

source: Write Coils map from
uk: Напишіть карту котушок з

source: Read input registers map to
uk: Зчитування вхідних регістрів, що відповідають

source: Read register/holding map to
uk: Зчитати карту реєстру/холдингу

source: Write hold registers map from
uk: Карта регістрів утримання запису з

source: Period/object info
uk: Інформація про період/об'єкт

source: Modbus communication setup
uk: Налаштування зв'язку Modbus

source: Modbus I/O register setup
uk: Налаштування регістра вводу/виводу Modbus

source: Variable
uk: Змінна

source: JumpToLabel
uk: Перейти до мітки

source: Sub-Routine
uk: Підпрограма

source: TimerNbr
uk: Номер таймера

source: Base
uk: База

source: Preset
uk: Попередньо налаштовано

source: MonostNbr
uk: МоностНбр

source: CounterNbr
uk: Номер лічильника

source: TimerMode
uk: Режим таймера

source: Expression
uk: Вираз

source: Variable: %s Hal sig: %s
uk: Змінна: %s Hal sig: %s

source: Label: %s
uk: Мітка: %s

source: Sub-Routine: %d
uk: Підпрограма: %d

source: %cT%d: Preset=%d Base=%s
uk: %cT%d: Попередньо встановлено=%d Базове значення=%s

source: %cM%d: Preset=%d Base=%s
uk: %cM%d: Попередньо встановлено=%d Базово=%s

source: %cC%d: Preset=%d
uk: %cC%d: Попередньо встановлено=%d

source: %cTM%d: Preset=%d Base=%s Mode=%s
uk: %cTM%d: Попередньо встановлено=%d Базовий=%s Режим=%s

source: HAL sig: %s
uk: HAL себе: %s

source: Incompatible type of variable (must be an integer!)
uk: Несумісний тип змінної (має бути цілим числом!)

source: New expr=%s
uk: Новий вираз=%s

source: Expression too long
uk: Вираз занадто довгий

source: Incompatible type of variable for index (must be an integer!)
uk: Несумісний тип змінної для індексу (має бути цілим числом!)

source: Parser error for indexed variable !
uk: Помилка парсера для індексованої змінної!

source: You must select a boolean variable !
uk: Ви повинні вибрати булеву змінну!

source: You must select a read/write variable for a coil!
uk: Ви повинні вибрати змінну для читання/запису котушки!

source: Unknown variable...
uk: Невідома змінна...

source: !!!Abnormal current type=%d in rung...(file %s,line %d)
uk: !!!Аномальний струм типу=%d у рядку...(файл %s,рядок %d)

source: No more free function block of this type available...
uk: Більше немає вільних функціональних блоків цього типу...

source: No more free arithmetic expression for this type available...
uk: Більше немає вільних арифметичних виразів для цього типу...

source: You clicked outside of the current rung actually selected...
uk: Ви клацнули поза межами поточного вибраного рядка...

source: Current rung in edit mode...
uk: Поточний рядок у режимі редагування...

source: Edit mode...
uk: Режим редагування...

source: Delete
uk: Видалити

source: Do you really want to delete the current rung ?
uk: Ви справді хочете видалити поточний рядок?

source: Add
uk: Додати

source: Insert
uk: Вставка

source: Modify
uk: Змінити

source: Cancel
uk: Скасувати

source: Step Nbr
uk: Номер кроку

source: Comment
uk: Коментар

source: step search posiX=%d, posiY=%d ;
uk: крок пошуку posiX=%d, posiY=%d ;

source: found=%d!!!
uk: знайдено=%d!!!

source: transi search posiX=%d, posiY=%d ;
uk: пошук транзитів posiX=%d, posiY=%d ;

source: comment search posiX=%d, posiY=%d ;
uk: пошук коментарів posiX=%d, posiY=%d ;
