Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: X axis: Total Travel = 10 Home Offset = Origin to Home Switch distance = 0 Neg Travel Distance = Origin to neg limit distance = 0 Pos Travel Distance = Total Travel - neg travel distance = 10 Home Position = Origin to Home Position distance = 6 Y axis: Total Travel = 8 Home Offset = Origin to Home Switch distance = 0 Neg Travel Distance = Origin to neg limit distance = -8 Pos Travel Distance = Total Travel - neg travel distance = 0 Home Position = Origin to Home Position distance = 0 Z axis: Total Travel = 12 Home Offset = Origin to Home Switch distance = 0 Neg Travel Distance = Origin to neg limit distance = -12 Pos Travel Distance = Total Travel - neg travel distance = 0 Home Position = Origin to Home Position distance = 0 Note that the direction indicators on the top right show movement of the TOOL and on the actual machine, often it is the table that actually moves. In that case the directions are opposite of shown. Note this is an example, Many other combinations are possible
uk: Вісь X: Загальний хід = 10 Зсув від початкової позиції = Відстань від початку координат до перемикача початкової позиції = 0 Відстань негативного ходу = Відстань від початку координат до негативного обмеження = 0 Відстань позитивного ходу = Загальний хід - відстань негативного ходу = 10 Початкова позиція = Відстань від початку координат до початкової позиції = 6 Вісь Y: Загальний хід = 8 Зсув від початкової позиції = Відстань від початку координат до перемикача початкової позиції = 0 Відстань негативного переміщення = Відстань від початку координат до негативного обмеження = -8 Відстань позитивного переміщення = Загальний хід - відстань негативного переміщення = 0 Початкове положення = Відстань від початку координат до початкового положення = 0 Вісь Z: Загальний хід = 12 Зсув початкового положення = Відстань від початку координат до перемикача початкового положення = 0 Відстань негативного переміщення = Відстань від початку координат до негативного обмеження = -12 Відстань позитивного переміщення = Загальне переміщення - відстань негативного переміщення = 0 Початкове положення = Відстань від початку координат до початкового положення = 0 Зверніть увагу, що індикатори напрямку в правому верхньому куті показують рух ІНСТРУМЕНТА, а на фактичній машині часто фактично рухається стіл. У цьому випадку напрямки протилежні показаним. Зверніть увагу, що це приклад, можливі багато інших комбінацій

source: Separate Home and Limit Switches Example The negative and positive directions are based on Tool Movement which can be different then the actual machine movement. ie on a mill typically the table moves rather then the tool. Soft(ware) limits are inside the limit switch area. (If using switch based homing) the homing switch(es) utilize the limit switches (shared home / limit switch) or are inside the limit switch area when using a separate home switch. The G53 machine zero origin is typically inside the soft limits area but not necessarily. If using a separate homing switch, it's possible to start homing on the wrong side of the home switch, which combined with HOME_IGNORE_LIMITS option will lead to a hard crash. You can avoid this by making the home switch toggle it's state when the trip dog is on a particular side until it returns passed the trip point again. Said another way, the home switch state must represent the position of the dog relative to the switch (ie before or after the switch), and must stay that way even if the dog coasts past the switch in the same direction. The distance between the limit switches and soft limits (-L<->A and D<-+L) is magnified in this example Note that there is distance between the limit switches and actual physical hard contact for coasting after the amplifier is disabled.
uk: Приклад окремих перемикачів початкової позиції та кінцевих вимикачів Негативний та позитивний напрямки базуються на русі інструменту, який може відрізнятися від фактичного руху верстата. Тобто на фрезерному верстаті зазвичай рухається стіл, а не інструмент. М'які (програмні) обмеження знаходяться всередині зони кінцевих вимикачів. (При використанні перемикача на основі перемикача) перемикач(і) початкової позиції використовують кінцеві вимикачі (спільний перемикач початкової позиції / кінцевий вимикач) або знаходяться в зоні кінцевого вимикача при використанні окремого вимикача початкової позиції. Початкова точка машини G53 зазвичай знаходиться в зоні програмних обмежень, але не обов'язково. При використанні окремого вимикача початкової позиції можливий запуск повернення до початкової позиції з неправильної сторони вимикача, що в поєднанні з опцією HOME_IGNORE_LIMITS призведе до серйозної аварії. Цього можна уникнути, змусивши перемикач початкового положення змінювати свій стан, коли фіксатор знаходиться на певній стороні, доки він знову не пройде точку спрацьовування. Іншими словами, стан перемикача початкового положення повинен відображати положення фіксатора відносно перемикача (тобто перед або після перемикача) і повинен залишатися таким, навіть якщо фіксатор проходить повз перемикач у тому ж напрямку. Відстань між кінцевими вимикачами та м'якими обмежувачами (-L<->A та D<-+L) в цьому прикладі збільшена. Зверніть увагу, що між кінцевими вимикачами та фактичним фізичним жорстким контактом для ковзання після вимкнення підсилювача є відстань.

source: Help Page
uk: Сторінка довідки

source: Mill
uk: Млин

source: Total Travel = 4 + 6 = 10 Z Home Offset = Origin to Home Switch distance = 10 Z Neg Travel Distance = Origin to neg limit distance = 0 Z Pos Travel Distance = Total Travel - neg travel distance = 10 Z Home Position = Origin to Home Position distance = 4 X axis would be similar but not shown fully for clarity. This is just a sample reference other switch combinations are possible.
uk: Загальний хід = 4 + 6 = 10 Зсув Z від початкової позиції = відстань від початку координат до перемикача початкової позиції = 10 Відстань негативного ходу Z = відстань від початку координат до негативного обмеження = 0 Відстань позитивного ходу Z = загальний хід - відстань негативного ходу = 10 Початкова позиція Z = відстань від початку координат до початкової позиції = 4 Ось X буде аналогічною, але для наочності не показана повністю. Це лише приклад, можливі й інші комбінації перемикачів. .

source: Lathe
uk: Токарний верстат

source: A is the negative software limit B is the G53 machine coordinate Origin C is the home switch trip point/ Shared min limit trip D is the positive software limit H is the final Home Position = 3 units The -L and +L are the limit switches trip points A<->B is the Negative Travel Distance = -0 units B<->C is the home Switch Location = -0.7 units B<->D is the Positive Travel Distance = 10 units A<->D is the total travel = 10 units
uk: A — це негативний програмний ліміт. B — це початок координат верстата G53. C — це точка спрацьовування вимикача початкового положення/ спільний мінімальний ліміт спрацьовування. D — це позитивний програмний ліміт. H — це кінцеве початкове положення = 3 одиниці. -L і +L — точки спрацьовування кінцевих вимикачів A<->B — відстань негативного переміщення = -0 одиниць B<->C — розташування вимикача початкового положення = -0,7 одиниць B<->D — відстань позитивного переміщення = 10 одиниць A<->D — загальна відстань переміщення = 10 одиниць

source: Shared Home Switch
uk: Спільний домашній комутатор

source: A is the negative software limit B is the G53 machine coordinate Origin C is the home switch trip point D is the positive software limit H is the final home position = 0 units The -L and +L are the limit switches trip points A<->B is the Negative Travel Distance = -3 units B<->C is the Home Switch Location = -2.3 units B<->D is the Positive Travel Distance = 7 units A<->D is the total travel = 10 units
uk: A — це негативний програмний обмежувач. B — це початок координат верстата G53. C — це точка спрацьовування вимикача початкового положення. D — це позитивний програмний обмежувач. H — це кінцеве початкове положення = 0 одиниць. -L і +L — це точки спрацьовування кінцевих вимикачів. A<->B — це відстань негативного переміщення = -3 одиниці. B<->C — це розташування вимикача початкового положення = -2,3 одиниці B<->D — це позитивна відстань переміщення = 7 одиниць A<->D — це загальна відстань переміщення = 10 одиниць

source: Separate Homing Switches
uk: Окремі перемикачі самонаведення

source: Diagram
uk: Діаграма

source: Output
uk: Вихід

source: Input
uk: Вхід

source: Print Map
uk: Друк карти

source: Map
uk: Карта

source: Press the button to make the tabbed pages accept the changes. Click on each page tab to configure signal names for each connector port.
uk: Натисніть кнопку, щоб зміни були прийняті на вкладках. Натисніть на кожну вкладку сторінки, щоб налаштувати назви сигналів для кожного порту роз'єму.

source: 3PWM base frequency:
uk: Базова частота 3PWM:

source: Card address:
uk: Адреса картки:

source: Firmware:
uk: Прошивка:

source: Num of 3 pwm generators:
uk: Кількість 3 ШІМ-генераторів:

source: Total number of pins:
uk: Загальна кількість контактів:

source: Accept components Changes
uk: Прийняти компоненти Зміни

source: PWM base frequency:
uk: PWM базова частота:

source: PDM base frequency:
uk: PDM базова частота:

source: Watchdog timeout:
uk: Тайм-аут сторожового таймера:

source: Num of encoders:
uk: Кількість кодерів:

source: Num of pwm generators:
uk: Кількість ШІМ-генераторів:

source: Num of step generators:
uk: Кількість генераторів кроків:

source: Board name
uk: Назва ради директорів

source: Num of Smart Serial Ports:
uk: Кількість інтелектуальних послідовних портів:

source: 7i29 daughter board
uk: Дочірня плата 7i29

source: 7i30 daughter board
uk: Дочірня плата 7i30

source: 7i33 daughter board
uk: Дочірня плата 7i33

source: 7i40 daughter board
uk: Дочірня плата 7i40

source: 7i48 daughter board
uk: Дочірня плата 7i48

source: <b>Sanity Checks</b>
uk: <b>Перевірки на осудність</b>

source: Num of channels:
uk: Кількість каналів:

source: Num of resolvers:
uk: Кількість розв'язувачів:

source: Board Discovery
uk: Дошка Відкриття

source: Configuration Page
uk: Конфігурація Сторінка

source: Pin Type
uk: Тип штифта

source: Inv
uk: Рахунок-фактура

source: function
uk: функція

source: Launch test panel
uk: Запуск тестової панелі

source: I/O Connector 1
uk: I/O З'єднувач 1

source: I/O Connector 2
uk: I/O З'єднувач 2

source: I/O Connector 3
uk: I/O З'єднувач 3

source: I/O Connector 4
uk: I/O З'єднувач 4

source: I/O Connector 5
uk: I/O З'єднувач 5

source: I/O Connector 6
uk: I/O З'єднувач 6

source: I/O Connector 7
uk: I/O З'єднувач 7

source: I/O Connector 8
uk: I/O З'єднувач 8

source: I/O Connector 9
uk: I/O З'єднувач 9

source: page 2
uk: сторінка 2

source: page 3
uk: сторінка 3

source: Smart Serial 0
uk: Розумний серійний номер 0

source: Smart Serial 1
uk: Розумний серійний номер 1

source: Smart Serial 2
uk: Розумний серійний номер 2

source: Smart Serial 3
uk: Розумний серійний номер 3

source: Smart Serial 4
uk: Розумний серійний номер 4

source: Smart Serial 5
uk: Розумний серійний номер 5

source: Smart Serial 6
uk: Розумний серійний номер 6

source: Smart Serial 7
uk: Розумний серійний номер 7

source: Create a desktop launcher to start LinuxCNC with this configuration
uk: Створіть панель запуску на робочому столі для запуску LinuxCNC з цією конфігурацією

source: Create a desktop shortcut (symlink) to configuration files
uk: Створення ярлика (символічного посилання) на файли конфігурації на робочому столі

source: Show Advanced Option Pages
uk: Показати сторінки розширених параметрів

source: Use INI substitution for Mesa board names
uk: Використовуйте заміну INI для назв дощок Mesa

source: <b>Serial VFD</b>
uk: <b>Серійний VFD</b>

source: <b>External Button Jogging</b>
uk: <b>Зовнішня кнопка керування</b>

source: <b>External MPG Jogging</b>
uk: <b>Зовнішній біг на 100 км/год</b>

source: <b>External Feed Override</b>
uk: <b>Змінити зовнішній канал</b>

source: <b>Max Velocity Override</b>
uk: <b>Перевизначення максимальної швидкості</b>

source: <b>Spindle Override</b>
uk: <b>Перевірка шпинделя</b>

source: <b>USB Jogging</b>
uk: <b>Біг через USB</b>

source: Use the checkboxes to enable options. Press the corresponding info button to show / adjust parameters.
uk: Використовуйте прапорці, щоб увімкнути опції. Натисніть відповідну інформаційну кнопку, щоб показати/налаштувати параметри.

source: Add device rule
uk: Додати правило для пристрою

source: Test device
uk: Тестовий пристрій

source: Search for device rules
uk: Пошук правил для пристроїв

source: Device Name:
uk: Назва пристрою:

source: mm/min
uk: мм/хв

source: <b>default</b>
uk: <b>за замовчуванням</b>

source: Speed B
uk: Швидкість Б

source: Speed A
uk: Швидкість A

source: Digital Control
uk: Цифрове керування

source: Analog Control
uk: Аналогове керування

source: Joy Jog
uk: Закон радості

source: shared buttons for all axis
uk: спільні кнопки для всіх осей

source: buttons for each axis
uk: кнопки для кожної осі

source: Shared MPG / selectable axis
uk: Спільний показник витрати пального / вісь, що вибирається

source: Mpg per axis
uk: Міль на галон на вісь

source: selectable MPG increments
uk: вибір кроку збільшення MPG на галон

source: ignore all inputs false
uk: ігнорувати всі вхідні дані хибно

source: use gray code
uk: використовувати код Грея

source: use debounce
uk: використовувати усунення дребезгу

source: Mux options
uk: Варіанти мультиплексування

source: Sec
uk: Розділ

source: increments
uk: прирости

source: Use MPG
uk: Використання MPG

source: use switches
uk: використовувати перемикачі

source: use graycode
uk: використовувати грейкод

source: ignore all-inputs false
uk: ігнорувати всі входи false

source: Increments
uk: Прирости

source: Serial connected VFD
uk: Послідовно підключений VFD

source: Mitsubishi FR Spindle VFD
uk: Шпиндель Mitsubishi FR VFD

source: GS2 Spindle VFD
uk: GS2 Шпиндель VFD

source: Deacceleration Time
uk: Час розгону

source: Acceleration Time
uk: Час розгону

source: Slave number
uk: Номер раба

source: Baud Rate
uk: Швидкість передачі даних

source: Device Name
uk: Назва пристрою

source: XZ Lathe
uk: XZ Токарний верстат

source: Machine Name:
uk: Назва машини:

source: Axis configuration:
uk: Конфігурація осей:

source: Include Spindle
uk: Включити шпиндель

source: Machine units:
uk: Машинні агрегати:

source: <b>Machine Basics</b>
uk: <b>Основи машин</b>

source: Actual Servo Period:
uk: Фактичний період сервоприводу:

source: Recommend servo period: 1000000
uk: Рекомендований період сервоприводу: 1000000

source: Test Base Period Jitter
uk: Тестова база Період тремтіння

source: <b>Computer Response Time</b>
uk: <b>Час відгуку комп'ютера</b>

source: Mesa0 PCI/ Etho/ Parport Card:
uk: Плата Mesa0 PCI/Etho/Parport:

source: Mesa1 PCI/ Etho/ Parport Card:
uk: Плата Mesa1 PCI/Etho/Parport:

source: <b>I/O Control Ports/ Boards</b>
uk: <b>Порти/плати керування вводом/виводом</b>

source: Force individual manual homing
uk: Примусове індивідуальне ручне самонаведення

source: Random position toolchanger
uk: Змінювач інструментів у випадковому положенні

source: Require homing before MDI / Running
uk: Вимагати повернення до початкового положення перед MDI / запуском

source: Popup Manual Toolchange Prompt
uk: Спливаюче вікно з підказкою щодо ручної зміни інструменту

source: Leave spindle on during tool change
uk: Залишайте шпиндель увімкненим під час зміни інструменту

source: Move spindle up before tool change
uk: Перемістіть шпиндель вгору перед зміною інструменту

source: Restore joint position after shutdown
uk: Відновлення положення суглоба після вимкнення

source: <b>Defaults and Options</b>
uk: <b>Налаштування за замовчуванням та параметри</b>

source: <b>GUI Screen list</b>
uk: <b>Список екранів графічного інтерфейсу</b>

source: Position_offset
uk: Зсув_позиції

source: Position_feedback
uk: Відгук_про_позицію

source: Max Spindle Override
uk: Максимальне коригування шпинделя

source: Min Spindle Override
uk: Мін. корекція шпинделя

source: Max Feed Override
uk: Перевизначення максимальної подачі

source: Display Geometry
uk: Геометрія дисплея

source: <b>General GUI Defaults</b>
uk: <b>Загальні налаштування графічного інтерфейсу за замовчуванням</b>

source: Default linear velocity
uk: Лінійна швидкість за замовчуванням

source: Min linear velocity
uk: Мінімальна лінійна швидкість

source: Max linear velocity
uk: Максимальна лінійна швидкість

source: Default Angular velocity
uk: Кутова швидкість за замовчуванням

source: Min Angular velocity
uk: Мінімальна кутова швидкість

source: Increments
uk: Прирости

source: 5mm 1mm .5mm .1mm .05mm .01mm .005mm
uk: 5 мм 1 мм 0,5 мм 0,1 мм 0,05 мм 0,01 мм 0,005 мм

source: Max Angular velocity
uk: Максимальна кутова швидкість

source: size
uk: розмір

source: Position
uk: Позиція

source: Force Axis to Maximize
uk: Примусове максимізування осі

source: AXIS Defaults
uk: Налаштування AXIS за замовчуванням

source: Force Touchy to Maximize after positioning
uk: Примусово розгортати Touchy після позиціонування

source: GTK Theme
uk: Тема GTK

source: Absolute Text Color
uk: Абсолютний колір тексту

source: Absolute Textcolor
uk: Абсолютний колір тексту

source: Relative Textcolor
uk: Відносний колір тексту

source: DTG Textcolor
uk: Колір тексту DTG

source: Error Textcolor
uk: Колір тексту помилки

source: Touchy Defaults
uk: Делікатні налаштування за замовчуванням

source: Force Gmoccapy to Maximize after positioning
uk: Примусово розгортати Gmoccapy після позиціонування

source: Gmoccapy Defaults
uk: Значення за замовчуванням Gmoccapy

source: QtPlasmaC Options
uk: Параметри QtPlasmaC

source: <b>Virtual Control Panel</b>
uk: <b>Віртуальна панель керування</b>

source: XYZ buttons (uses Halui)
uk: Кнопки XYZ (використовує Halui)

source: Geometry Options
uk: Параметри геометрії

source: Pyvcp Details
uk: Деталі Pyvcp

source: Sample display
uk: Зразок дисплея

source: Standalone Panel
uk: Автономна панель

source: Rightside Embedded
uk: Вбудований праворуч

source: Center Tab Embedded
uk: Вбудована центральна вкладка

source: Force Maximize
uk: Примусове максимізування

source: Display Options
uk: Параметри відображення

source: Max RPM
uk: Макс RPM

source: Spindle Speed Indicator
uk: Індикатор швидкості шпинделя

source: Spindle At Speed LED
uk: Світлодіодний індикатор швидкості шпинделя

source: Zero X Button
uk: Кнопка «Нуль X»

source: Zero Y Button
uk: Кнопка «Нуль Y»

source: Zero Z Button
uk: Кнопка «Нуль Z»

source: Zero A Button
uk: Кнопка «Нуль А»

source: Auto Z Touch Off Button
uk: Кнопка автоматичного сенсорного вимкнення Z

source: Requires Classicladder touch-off program
uk: Потрібна програма дотику до сходів Classicladder

source: Sample Options
uk: Варіанти зразків

source: Gladevcp Details
uk: Деталі Gladevcp

source: Include custom GladeVCP GUI panel
uk: Включити власну панель графічного інтерфейсу GladeVCP

source: Full Scale Frequency (kHz)
uk: Повна шкала частоти (кГц)

source: 0V Frequency (kHz)
uk: Частота 0 В (кГц)

source: Type 1
uk: Тип 1

source: Type 2
uk: Тип 2

source: Towards Negative Limit
uk: До негативної межі

source: Towards Positive Limit
uk: До позитивної межі

source: Use Encoder Index For Home:
uk: Використовуйте індекс енкодера для дому:

source: Home Final Velocity:
uk: Кінцева швидкість додому:

source: Home Latch Direction:
uk: Напрямок фіксатора будинку:

source: Home Search Direction:
uk: Напрямок пошуку на головній сторінці:

source: Home latch Velocity:
uk: Швидкість фіксації дому:

source: Use Compensation Filename:
uk: Використати файл компенсації:

source: Use Backlash Compensation:
uk: Використовуйте компенсацію люфту:

source: Final Home Position location (Offset from machine zero Origin):
uk: Кінцеве розташування домашнього положення (зміщення від нульової точки відліку машини):

source: Negative Travel Distance (Machine zero Origin to end of - travel):
uk: Від'ємна відстань переміщення (від початку координат нульової точки верстата до кінця переміщення):

source: Tandem Home Switch location (Offset from machine zero Origin):
uk: Розташування тандемного перемикача додому (зміщення від нульової точки відліку машини):

source: Home Search Velocity:
uk: Швидкість пошуку на головній сторінці:

source: Positive Travel Distance (Machine zero Origin to end of + travel):
uk: Додатна відстань переміщення (від початку координат нульової точки верстата до кінця + переміщення):

source: Home Search Sequence:
uk: Послідовність пошуку на головній сторінці:

source: Home Switch location (offset from machine zero Origin):
uk: Розташування домашнього перемикача (зміщення від нульової точки машини):

source: Max Output
uk: Максимальна вихідна потужність

source: Deadband
uk: Мертва зона

source: Bias
uk: Упередженість

source: PID Info
uk: Інформація про PID

source: 3pwm Scale:
uk: 3-пімометрична шкала:

source: 3pwm Deadtime:
uk: 3pwm Мертвий час:

source: Quad Pulses / Rev:
uk: Квадратні імпульси / оберти:

source: Open Loop Test
uk: Розімкнутий цикл Тест

source: Analog Min Limit:
uk: Мінімальна межа аналогового сигналу:

source: Analog Max limit:
uk: Максимальне аналогове обмеження:

source: Analog Max Scale:
uk: Аналогова максимальна шкала:

source: Output Info
uk: Вихідна інформація

source: Step On-Time
uk: Вчасно крокуйте

source: Step Space
uk: Кроковий простір

source: Direction Hold
uk: Утримання напрямку

source: Direction Setup
uk: Налаштування напрямку

source: Driver Type:
uk: Тип драйвера:

source: Stepper Info
uk: Інформація про степер

source: No feedback
uk: Без відгуків

source: Absolute Feedback
uk: Абсолютний зворотний зв'язок

source: Incremental Feedback
uk: Інкрементальний зворотний зв'язок

source: Incremental Encoder
uk: Інкрементальний енкодер

source: Hall sensors
uk: Датчики Холла

source: Fanuc Red Cap
uk: Червона шапка Fanuc

source: Use encoder Index
uk: Використовувати індекс кодувальника

source: <b>Input Options</b>
uk: <b>Параметри введення</b>

source: Digital instead of PWM outputs
uk: Цифрові виходи замість PWM

source: 6 outputs instead of 3
uk: 6 виходів замість 3

source: Force Trapezoid Mode
uk: Примусовий режим трапеції

source: Emulate feedback
uk: Емуляція зворотного зв'язку

source: Emulated Hall sensors
uk: Емульовані датчики Холла

source: Emulated Fanuc Red Cap
uk: Емульована червона ковпачка Fanuc

source: 8i20 Max Current
uk: Максимальний струм 8i20

source: <b>Output Options</b>
uk: <b>Параметри виводу</b>

source: alignment current
uk: струм вирівнювання

source: lead angle
uk: кут випередження

source: Input-pattern
uk: Вхідний шаблон

source: output-pattern
uk: вихідний шаблон

source: Drive-offset
uk: Зсув приводу

source: Encoder-offset
uk: Зсув енкодера

source: Poles
uk: Поляки

source: <b>Configuration</b>
uk: <b>Конфігурація</b>

source: Details
uk: Деталі

source: <b>Use BLDC Motor Commutation Control</b>
uk: <b>Використовуйте комутаційне керування двигуном BLDC</b>

source: Scale:
uk: Масштаб:

source: Range:
uk: Діапазон:

source: <b>Use Spindle-At-Speed</b>
uk: <b>Використовуйте шпиндель зі швидкістю</b>

source: Filter gain:
uk: Підсилення фільтра:

source: <b>Spindle Display Filter Settings</b>
uk: <b>Налаштування фільтра відображення шпинделя</b>

source: Rapid Speed Following Error:
uk: Помилка швидкого руху:

source: Feed Speed Following Error:
uk: Помилка відстеження швидкості подачі:

source: Invert Motor Direction
uk: Змінити напрямок руху двигуна

source: Invert Encoder Direction
uk: Інвертувати напрямок енкодера

source: Single Input Encoder
uk: Одновхідний енкодер

source: encoder Scale:
uk: Масштаб енкодера:

source: Stepper Scale:
uk: Шкала крокового механізму:

source: Calculate Scale
uk: Розрахувати Масштаб

source: Test / Tune Axis
uk: Перевірка / налаштування осі

source: Servo Info
uk: Інформація про сервопривід

source: analog Max Voltage:
uk: аналоговий максимальний напруга:
