Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: Distance to accelerate to max speed:
uk: Відстань для розгону до максимальної швидкості:

source: Pulse rate at max speed:
uk: Частота пульсу на максимальній швидкості:

source: Axis SCALE:
uk: МАСШТАБ осі:

source: All the necessary information has now been gathered. Click "Done" to write your configuration files to disk. If you experience lockups while running LinuxCNC: -you will need to decrease the maximum velocity which will have the effect of increasing BASE_PERIOD. If you experience lost steps while running LinuxCNC: -first verify that you entered the proper timings for your stepper drivers. -then run a more thorough latency test as described on the linuxcnc.org wiki. http://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting If you experience the "Unexpected Realtime Delay" message: -run a more thorough latency test as described on the linuxcnc.org wiki: http://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting
uk: Вся необхідна інформація вже зібрана. Натисніть «Готово», щоб записати файли конфігурації на диск. Якщо під час роботи LinuxCNC виникають зависання: -вам потрібно зменшити максимальну швидкість, що призведе до збільшення BASE_PERIOD. Якщо під час роботи LinuxCNC ви відчуваєте втрату кроків: - спочатку переконайтеся, що ви ввели правильні часові параметри для ваших крокових драйверів. - потім виконайте більш ретельний тест затримки, як описано на вікі-сторінці linuxcnc.org. http://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting Якщо ви бачите повідомлення «Unexpected Realtime Delay» (Несподівана затримка в реальному часі): -проведіть більш ретельний тест затримки, як описано на вікі-сайті linuxcnc.org: http://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting

source: Simulator: will not run hardware
uk: Симулятор: не запускатиме обладнання

source: PNCconf encountered an error. The following information may be useful in troubleshooting: LinuxCNC Version: %s
uk: У PNCconf сталася помилка. Наступна інформація може бути корисною для усунення несправностей: Версія LinuxCNC: %s

source: PnCconf is setting up
uk: PnCconf налаштовується

source: **** PNCCONF ERROR: custom firmware loading error
uk: **** ПОМИЛКА PNCCONF: помилка завантаження користувацького програмного забезпечення

source: **** PNCCONF INFO: Found extra firmware in file
uk: **** PNCCONF INFO: Знайдено додаткову прошивку у файлі

source: Discovery metadata update
uk: Оновлення метаданих виявлення

source: %s metadata update
uk: %s оновлення метаданих

source: PnCconf setup
uk: Налаштування PnCconf

source: **** Debug Pause! ****
uk: **** Налагодження призупинено! ****

source: Specific Help page is unavailable
uk: Конкретна сторінка довідки недоступна

source: Help Pages
uk: Сторінки довідки

source: Some older cards require firmware. You have no hostmot2 firmware downloaded in folder: %s PNCconf will use It's internal firmware data samples so you can continue. You could also try the discovery option if your card is connected and doesn't require firmware to be loaded at run time. Discovery option requires the advanced options checked on this page.
uk: Деякі старі карти вимагають прошивки. У папці немає завантаженої прошивки hostmot2: %s PNCconf використовуватиме внутрішні зразки даних прошивки, щоб ви могли продовжити. Ви також можете спробувати опцію виявлення, якщо ваша карта підключена і не вимагає завантаження прошивки під час роботи. Опція виявлення вимагає, щоб на цій сторінці були відмічені розширені опції.

source: LinuxCNC 'PNCconf' configuration files
uk: Файли конфігурації LinuxCNC 'PNCconf'

source: It seems data in this file is from too old of a version of PNCConf to continue.
uk: Схоже, дані в цьому файлі надто старі, щоб продовжити.

source: PIN file is empty:
uk: Файл PIN-коду порожній:

source: To use PIN file discovery mode, the contents of the
uk: Щоб використовувати режим виявлення PIN-файлів, вміст

source: cards PIN file needs to be pasted into the Input tab
uk: PIN-файл картки потрібно вставити у вкладку введення

source: of the Help window before clicking Board Discovery
uk: вікна довідки, перш ніж натискати кнопку «Виявлення плати»

source: Address is required for ethernet card
uk: Для карти Ethernet потрібна адреса

source: %s board was not found
uk: %s дошку не знайдено

source: Is the address correct?
uk: Чи правильна адреса?

source: %s is an unsupported device
uk: %s – це непідтримуваний пристрій

source: Unspecified Error with Discovery option
uk: Невизначена помилка з опцією виявлення

source: Discovery has an error, Is mesaflash installed? %s
uk: Помилка виявлення. Чи встановлено mesaflash? %s

source: Discovery is unavailable
uk: Дізнання недоступне

source: The pasted PIN file may be an invalid format
uk: Вставлений файл PIN-коду може бути в недійсному форматі

source: The data returned from discovery is invalid
uk: Дані, повернуті з пошуку, недійсні

source: USB device Info Search
uk: Пошук інформації про USB-пристрій

source: USB device page is unavailable
uk: Сторінка USB-пристрою недоступна

source: Pin names are unavailable
uk: Назви пінів недоступні

source: Device names are unavailable
uk: Назви пристроїв недоступні

source: No Pncconf made device rules were found
uk: Не знайдено правил пристроїв, створених Pncconf

source: OK to replace existing glade panel ? It will be renamed and added to 'backups' folder. Clicking 'existing custom program' will avoid this warning, but if you change related options later -such as spindle feedback- the HAL connection will not update
uk: Чи можна замінити існуючу панель glade? Вона буде перейменована і додана до папки «backups». Натискання «existing custom program» дозволить уникнути цього попередження, але якщо ви пізніше зміните відповідні параметри, такі як зворотний зв'язок шпинделя, з'єднання HAL не оновиться

source: OK to replace existing custom pyvcp panel? Existing pyvcp-panel.xml will be renamed and added to 'backups' folder Clicking 'existing custom program' will avoid this warning.
uk: Можна замінити існуючу користувацьку панель pyvcp? Існуючий файл pyvcp-panel.xml буде перейменовано та додано до папки «резервні копії». Натискання кнопки «існуюча користувацька програма» допоможе уникнути цього попередження.

source: Unused Channel
uk: Невикористаний канал

source: You can not have both steppers and pwm signals for spindle control
uk: Ви не можете використовувати одночасно крокові двигуни та ШІМ-сигнали для керування шпинделем.

source: You forgot to designate a stepper or pwm signal for axis %s
uk: Ви забули призначити кроковий або ШІМ-сигнал для осі %s

source: You forgot to designate an encoder /resolver signal for axis %s servo
uk: Ви забули призначити сигнал енкодера/резольвера для сервоприводу осі %s

source: You forgot to designate a pwm signal or stepper signal for axis %s
uk: Ви забули призначити ШІМ-сигнал або сигнал крокового механізму для осі %s

source: You can not have both steppers and pwm signals for axis %s
uk: Не можна використовувати одночасно сигнали крокових двигунів та ШІМ для осі %s

source: If using a tandem axis stepper, you must select a master stepgen for axis %s
uk: Якщо використовується тандемний кроковий двигун, необхідно вибрати головний кроковий двигун для осі %s.

source: Touchy require an external cycle start signal
uk: Для сенсорних пристроїв потрібен зовнішній сигнал запуску циклу

source: Touchy require an external abort signal
uk: Для чутливих пристроїв потрібен зовнішній сигнал переривання

source: Touchy require an external single-step signal
uk: Для чутливих потрібен зовнішній однокроковий сигнал

source: Touchy require an external multi handwheel MPG encoder signal on the mesa page
uk: Для Touchy потрібен зовнішній сигнал енкодера MPG з кількома маховиками на сторінці mesa

source: Touchy require 'external mpg jogging' to be selected on the external control page
uk: Для сенсорного керування потрібно вибрати опцію «зовнішній контроль витрати пального» на сторінці зовнішнього керування

source: Touchy require the external mpg to be in 'shared mpg' mode on the external controls page
uk: Touchy вимагає, щоб зовнішній показник витрати пального був у режимі «спільний показник витрати пального» на сторінці зовнішніх елементів керування.

source: Touchy require selectable increments to be unchecked on the external controls page
uk: Для сенсорних функцій потрібно зняти позначку з опції «Вибір приросту» на сторінці зовнішніх елементів керування.

source: The 7i29 daughter board requires PWM type generators and a PWM base frequency of 20 khz
uk: Дочірня плата 7i29 вимагає генераторів типу ШІМ та базової частоти ШІМ 20 кГц.

source: The 7i30 daughter board requires PWM type generators and a PWM base frequency of 20 khz
uk: Дочірня плата 7i30 вимагає генераторів типу ШІМ та базової частоти ШІМ 20 кГц.

source: The 7i33 daughter board requires PDM type generators and a PDM base frequency of 6 Mhz
uk: Дочірня плата 7i33 вимагає генераторів типу PDM та базової частоти PDM 6 МГц.

source: The 7i40 daughter board requires PWM type generators and a PWM base frequency of 50 khz
uk: Дочірня плата 7i40 вимагає генераторів типу ШІМ та базової частоти ШІМ 50 кГц.

source: The 7i48 daughter board requires UDM type generators and a PWM base frequency of 24 khz
uk: Дочірня плата 7i48 вимагає генераторів типу UDM та базової частоти ШІМ 24 кГц.

source: Gearbox Reduction Ratio
uk: Передавальне число коробки передач

source: Reduction Ratio
uk: Коефіцієнт зменшення

source: Leadscrew Pitch
uk: Крок ходового гвинта

source: Leadscrew TPI
uk: TPI ходового гвинта

source: / min
uk: / хв

source: / sec²
uk: / сек²

source: / Step
uk: / Крок

source: Steps /
uk: Кроки /

source: / encoder pulse
uk: / імпульс енкодера

source: Encoder pulses /
uk: Імпульси енкодера /

source: Resolver Scale:
uk: Шкала роздільної здатності:

source: Spindle Scale Calculation
uk: Розрахунок масштабу шпинделя

source: Axis Scale Calculation
uk: Розрахунок масштабу осей

source: Point and click configuration - %s.pncconf
uk: Конфігурація "вкажи та клацни" - %s.pncconf

source: You need to designate a parport and/or mesa I/O device before continuing.
uk: Перш ніж продовжити, потрібно призначити пристрій вводу/виводу parport та/або mesa.

source: PCI search page is unavailable
uk: Сторінка пошуку PCI недоступна

source: in / min
uk: дюймів/хв

source: mm / min
uk: мм/хв

source: You need to configure the mesa0 page. Choose the board type, firmware, component amounts and press 'Accept component changes' button'
uk: Вам потрібно налаштувати сторінку mesa0. Виберіть тип плати, прошивку, кількість компонентів і натисніть кнопку «Прийняти зміни компонентів»

source: The chosen Mesa0 board is different from the current displayed. please press 'Accept component changes' button'
uk: Обрана плата Mesa0 відрізняється від поточної, що відображається. Будь ласка, натисніть кнопку «Прийняти зміни компонентів»

source: You need to configure the mesa1 page. Choose the board type, firmware, component amounts and press 'Accept component changes' button'
uk: Вам потрібно налаштувати сторінку mesa1. Виберіть тип плати, прошивку, кількість компонентів і натисніть кнопку «Прийняти зміни компонентів»

source: The chosen Mesa1 board is different from the current displayed. please press 'Accept component changes' button'
uk: Обрана плата Mesa1 відрізняється від поточної, що відображається. Будь ласка, натисніть кнопку «Прийняти зміни компонентів»

source: You need to designate an E-stop input pin for this ladder program.
uk: Вам потрібно призначити вхідний контакт аварійної зупинки для цієї програми логічної схеми.

source: You need to designate a probe input pin for this ladder program.
uk: Вам потрібно призначити вхідний контакт зонда для цієї програми релейної логічної схеми.

source: OK to replace existing custom ladder program? Existing Custom.clp will be renamed custom_backup.clp. Any existing file named -custom_backup.clp- will be lost.Selecting 'existing ladder program' will avoid this warning
uk: Чи можна замінити існуючу програму Custom Ladder? Існуючий файл Custom.clp буде перейменовано на custom_backup.clp. Будь-який існуючий файл з назвою -custom_backup.clp- буде втрачено. Вибір «існуючої програми Ladder» дозволить уникнути цього попередження

source: # Generated by PNCconf at %s
uk: # Згенеровано PNCconf о %s

source: # Using LinuxCNC version: %s
uk: # Використовується версія LinuxCNC: %s

source: # overwritten when you run PNCconf again
uk: # перезаписується при повторному запуску PNCconf

source: # **** This is for info only ****
uk: # **** Це лише для інформації ****

source: # These are to ease setting custom component's parameters in a custom HAL file
uk: # Це полегшує налаштування параметрів користувацьких компонентів у користувацькому HAL-файлі

source: # The values below should be 25% larger than MAX_VELOCITY and MAX_ACCELERATION
uk: # Значення нижче мають бути на 25% більшими за MAX_VELOCITY та MAX_ACCELERATION

source: # If using BACKLASH compensation STEPGEN_MAXACCEL should be 100% larger.
uk: # Якщо використовується компенсація BACKLASH, значення STEPGEN_MAXACCEL має бути на 100% більшим.

source: # these are in nanoseconds
uk: # це в наносекундах

source: # MAX_VEL & MAX_ACC need to be twice the corresponding joint value
uk: # MAX_VEL та MAX_ACC мають бути вдвічі більшими за відповідне значення джоіна

source: # ---Chargepump StepGen: 10000 velocity-cmd = 10Khz square wave output---
uk: # ---Chargepump StepGen: 10000 velocity-cmd = 10 кГц прямокутний вихід---

source: # connect miscellaneous signals
uk: # підключення різних сигналів

source: # ---HALUI signals---
uk: # ---Сигнали HALUI---

source: # ---charge pump signals---
uk: # ---сигнали зарядного насоса---

source: # ---coolant signals---
uk: # ---сигнали охолоджувальної рідини---

source: # ---probe signal---
uk: # ---сигнал зонда---

source: # ---jog button signals---
uk: # ---сигнали кнопки поворотного керування---

source: # ---USB device jog button signals---
uk: # ---Сигнали кнопки керування USB-пристроєм---

source: # connect selectable mpg jog speeds
uk: # підключити вибір швидкості бігової пробіжки з можливістю миль на галон

source: # ---jogwheel signals to mesa encoder - shared MPG---
uk: # ---сигнали поворотного колеса до кодера mesa - спільний MPG---

source: # ---mpg signals---
uk: # ---сигнали миль на галон---

source: # for axis %s MPG
uk: #. для осі %s MPG

source: # ---jogwheel signals to mesa encoder - %s axis MPG---
uk: # ---Сигнали поворотного колеса до меза-енкодера - вісь %s MPG---

source: # connect selectable mpg jog increments
uk: # підключення вибраних приростів витрати пального (миль на галон)

source: # ---feed override signals to mesa encoder - mpg---
uk: # ---подача сигналів корекції на кодер mesa - mpg---

source: # connect feed override increments - MPG
uk: # прирости перевизначення каналу підключення - MPG

source: # connect feed override increments - switches
uk: # підключення перевизначення подачі приростів - перемикачі

source: # ---max velocity override signals to mesa encoder - mpg---
uk: # ---сигнали корекції максимальної швидкості для кодера мези - mpg---

source: # connect max velocity override increments - MPG
uk: # підключення приростів корекції максимальної швидкості - MPG

source: # connect max velocity override increments - switches
uk: # підключення приростів корекції максимальної швидкості - перемикачі

source: # ---spindle override signals to mesa encoder - mpg---
uk: # ---сигнали корекції шпинделя до кодера мези - mpg---

source: # connect spindle override increments - MPG
uk: # підключення приростів корекції шпинделя - MPG

source: # connect spindle override increments
uk: # підключення приростів корекції шпинделя

source: # ---motion control signals---
uk: # ---сигнали керування рухом---

source: # ---digital in / out signals---
uk: # ---цифрові вхідні/вихідні сигнали---

source: # ---estop signals---
uk: # ---знаки зупинки---

source: # ---manual tool change signals---
uk: # ---сигнали ручної зміни інструменту---

source: # ---Use external manual tool change dialog---
uk: # ---Використовувати зовнішнє діалогове вікно ручної зміни інструменту---

source: # ---signals to show tool offset in the GUI---
uk: # ---сигнали для відображення зміщення інструменту в графічному інтерфейсі---

source: # ---manual tool change signals to gmoccapy's dialog---
uk: # ---сигнали ручної зміни інструментів до діалогового вікна gmoccapy---

source: # ---spindle-at-speed indicator---
uk: # ---індикатор швидкості обертання шпинделя--

source: net spindle-at-speed => gmoccapy.spindle_at_speed_led
uk: мережевий шпиндель зі швидкістю => gmoccapy.spindle_at_speed_led

source: # ---manual tool change signals to qtdragon's dialog---
uk: # ---сигнали ручної зміни інструменту до діалогового вікна qtdragon---

source: # ---ignore tool prepare requests---
uk: # ---ігнорувати запити на підготовку інструментів---

source: # ---toolchange signals for custom tool changer---
uk: # ---сигнали зміни інструменту для спеціального пристрою зміни інструменту---

source: # ---QTPLASMAC TOOLCHANGE PASSTHROUGH---
uk: # ---QTPLASMAC ЗМІНА ТООЛЕТІВ ПРОХІДНИЙ--

source: # Load Classicladder with modbus master included (GUI must run for Modbus)
uk: # Завантаження Classicladder з включеним Modbus Master (графічний інтерфейс має бути запущений для Modbus)

source: # --- Classicladder signals for Z axis Auto touch off program---
uk: # --- Класичні сигнали сходів для програми автоматичного вимкнення дотику осі Z---

source: # These files are loaded post gladeVCP, in the order they appear
uk: # Ці файли завантажуються після gladeVCP у порядку їх появи

source: # _DO NOT_ include your HAL commands here.
uk: # _НЕ_ включайте сюди ваші команди HAL.

source: # Put custom HAL commands in custom_gvcp.hal
uk: # Додайте власні команди HAL до custom_gvcp.hal

source: # **** Setup of spindle speed display using gladevcp ****
uk: # **** Налаштування відображення швидкості шпинделя за допомогою gladevcp ****

source: # **** Setup GLADE MDI buttons ****
uk: # **** Налаштування кнопок GLADE MDI ****

source: # **** Z axis touch-off button - requires the touch-off classicladder program ****
uk: # **** Кнопка дотику осі Z - потрібна програма класичної сходової рамки для дотику ****

source: # Put custom HAL commands in custom_postgui.hal
uk: # Додайте власні команди HAL до custom_postgui.hal

source: # The commands in this file are run after the GUI loads
uk: # Команди в цьому файлі виконуються після завантаження графічного інтерфейсу

source: # **** Setup of spindle speed display using pyvcp -END ****
uk: # **** Налаштування відображення швидкості шпинделя за допомогою pyvcp -END ****

source: # This file will not be overwritten when you run PNCconf again
uk: # Цей файл не буде перезаписано під час повторного запуску PNCconf

source: # These commands are required for Touchy GUI
uk: # Ці команди необхідні для графічного інтерфейсу Touchy

source: # Automation Direct GS2 VFD for spindle control
uk: # ЧРП Automation Direct GS2 для керування шпинделем

source: # The communications switches must be set to RS-232C
uk: # Комунікаційні перемикачі мають бути встановлені в режим RS-232C

source: # The motor parameters must be set to match the motor
uk: # Параметри двигуна мають бути налаштовані відповідно до двигуна

source: # P3.00 (Source of Operation Command) must be set to Operation determined by RS-485 interface, 03 or 04
uk: # P3.00 (Джерело команди керування) має бути встановлено на «Робота визначається інтерфейсом RS-485», 03 або 04

source: # P4.00 (Source of Frequency Command) must be set to Frequency determined by RS232C/RS485 communication interface, 05
uk: # P4.00 (Джерело команди частоти) має бути встановлено на Частоту, визначену інтерфейсом зв'язку RS232C/RS485, 05

source: # P9.01 (Transmission Speed) must be set to the specified baud, 9600 = 01
uk: # P9.01 (Швидкість передачі) має бути встановлено на задану швидкість передачі, 9600 = 01

source: # P9.02 (Communication Protocol) must be set to "Modbus RTU mode, 8 data bits, no parity, 2 stop bits", 03
uk: # P9.02 (Протокол зв'язку) має бути встановлено на "Режим Modbus RTU, 8 бітів даних, без парності, 2 стоп-біти", 03

source: # Misubishi FR VFD for spindle control
uk: # Частотний перетворювач Misubishi FR для керування шпинделем

source: Generated by PNCconf at %s
uk: Згенеровано PNCconf о %s

source: configures LinuxCNC as:
uk: налаштовує LinuxCNC як:

source: type CNC
uk: тип CNC

source: will be used as the frontend display
uk: буде використовуватися як дисплей фронтенду

source: connector
uk: роз'єм

source: invrt
uk: інвертувати

source: %(name)s Parport
uk: %(name)s Паркпорт

source: -> inverted
uk: -> перевернутий

source: pin# %(pinnum)d is connected to input signal:'%(data)s' %(mesag)s
uk: контакт № %(pinnum)d підключено до вхідного сигналу: '%(data)s' %(mesag)s

source: pin# %(pinnum)d is connected to output signal:'%(data)s' %(mesag)s
uk: контакт № %(pinnum)d підключено до вихідного сигналу: '%(data)s' %(mesag)s

source: # SPINDLE
uk: # ШПИНДЕЛЬ

source: # -- BLDC setup --
uk: # -- Налаштування BLDC --

source: # ---TPPWM Generator signals/setup---
uk: # ---Сигнали/налаштування генератора TPPWM---

source: # six output 3pwg
uk: # шість вихідних 3pwg

source: # three output 3pwg
uk: # три виходи 3pwg

source: # TODO write some commands!
uk: # ЗАДАЧА напишіть кілька команд!

source: # ---8i20 amplifier card signals/setup---
uk: # ---Сигнали/налаштування плати підсилювача 8i20---

source: # ---digital potentiometer output signals/setup---
uk: # ---вихідні сигнали/налаштування цифрового потенціометра---

source: # ---PWM Generator signals/setup---
uk: # ---Сигнали/налаштування ШІМ-генератора---

source: # enable _all_ sserial pwmgens
uk: # увімкнути _всі_ серійні pwmgens

source: # Step Gen signals/setup for tandem axis
uk: # Крок Генерація сигналів/налаштування для тандемної осі

source: # Step Gen signals/setup
uk: # Крок Генерація сигналів/налаштування

source: # ---closedloop stepper signals---
uk: # ---сигнали крокового двигуна із замкнутим контуром---

source: # ---Encoder feedback signals/setup---
uk: # ---Сигнали/налаштування зворотного зв'язку енкодера---

source: # ---Resolver feedback signals/setup---
uk: # ---Сигнали/налаштування зворотного зв'язку резольвера---

source: # ---setup spindle control signals---
uk: # ---налаштування сигналів керування шпинделем---

source: # ---Setup spindle at speed signals---
uk: # ---Налаштування шпинделя за сигналами швидкості---

source: # Use ACTUAL spindle velocity from spindle encoder
uk: # Використовувати ДІЙСНУ швидкість шпинделя з датчика шпинделя

source: # spindle-velocity bounces around so we filter it with lowpass
uk: # швидкість шпинделя коливається, тому ми фільтруємо її за допомогою низькочастотного сигналу

source: # spindle-velocity is signed so we use absolute component to remove sign
uk: # швидкість шпинделя має знак, тому ми використовуємо абсолютну складову для видалення знака

source: # ACTUAL velocity is in RPS not RPM so we scale it.
uk: # ДІЙСНА швидкість вимірюється в обертах за секунду, а не в хвилинах за хвилину, тому ми її масштабуємо.

source: # ---setup home / limit switch signals---
uk: # ---налаштування сигналів домашнього/кінцевого вимикача---

source: # external input signals
uk: # зовнішні вхідні сигнали

source: # external output signals
uk: # зовнішні вихідні сигнали

source: # ---PLASMA INPUT DEBOUNCE---
uk: # ---ЗНИЖЕННЯ ВІДБРОСУ ПЛАЗМИ НА ВХОДІ---

source: #values for these are in custom.hal
uk: #значення для цих значень знаходяться в custom.hal

source: # ---JOINT ASSOCIATED WITH THE Z AXIS---
uk: # ---СУГЛІН, ПОВ'ЯЗАНИЙ З ВІСЮ Z---

source: # ---PLASMA INPUTS---
uk: # ---ПЛАЗМОВІ ВХОДИ---

source: # ---all modes---
uk: # ---всі режими---

source: # ---modes 0 & 1
uk: # ---режими 0 та 1

source: # ---modes 1 & 2
uk: # ---режими 1 та 2

source: # ---mode 2
uk: # ---режим 2
