Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: command (%s) cannot be executed until the machine is out of E-stop and turned on
uk: Команду (%s) неможливо виконати, доки машина не вийде з аварійної зупинки та не ввімкнеться

source: can't do that (%s:%d) in manual mode
uk: не можу зробити це (%s:%d) у ручному режимі

source: can't do that (%s) in auto mode with the interpreter idle
uk: Неможливо зробити це (%s) в автоматичному режимі, коли інтерпретатор не працює

source: can't do that (%s) in auto mode with the interpreter reading
uk: не можу зробити це (%s) в автоматичному режимі з читанням інтерпретатора

source: can't do that (%s) in auto mode with the interpreter paused
uk: не можу зробити це (%s) в автоматичному режимі з призупиненим інтерпретатором

source: can't do that (%s) in auto mode with the interpreter waiting
uk: не можу зробити це (%s) в автоматичному режимі, коли інтерпретатор чекає

source: can't do that (%s:%d) in MDI mode
uk: не можу це зробити (%s:%d) у режимі MDI

source: Can't switch mode while mode is AUTO and interpreter is not IDLE
uk: Неможливо перемкнути режим, якщо режим AUTO (АВТОМАТИЧНИЙ), а перекладач не в режимі IDLE (ОЧАЙНИЙ)

source: failed to close file
uk: не вдалося закрити файл

source: can't open %s
uk: не вдається відкрити %s

source: Can't issue MDI command when not homed
uk: Неможливо виконати команду MDI, якщо вона не переведена в HomeReader

source: Must be in MDI mode to issue MDI command
uk: Для виконання команди MDI необхідно бути в режимі MDI

source: Can't run a program when not homed
uk: Неможливо запустити програму, якщо вона не переведена в домашній режим

source: Zero-radius arc: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f
uk: Дуга з нульовим радіусом: початок=(%c%.4f,%c%.4f) центр=(%c%.4f,%c%.4f) кінець=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f

source: Radius to end of arc differs from radius to start: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f abs_err=%.4g rel_err=%.4f%%
uk: Радіус до кінця дуги відрізняється від радіуса до початку: start=(%c%.4f,%c%.4f) center=(%c%.4f,%c%.4f) end=(%c%.4f,%c%.4f) r1=%.4f r2=%.4f abs_err=%.4g rel_err=%.4f%%

source: G4 not allowed with G2 or G3 because they both use P
uk: G4 не дозволено з G2 або G3, оскільки обидва використовують P

source: Line with G10 does not have L0, L1, L10, L11, L2, or L20
uk: Лінія з G10 не має L0, L1, L10, L11, L2 або L20

source: P value not an integer with G10
uk: Значення P не є цілим числом з G10

source: P value out of range (0-9) with G10 L%d
uk: Значення P поза діапазоном (0-9) з G10 L%d

source: P value out of range with G10 L%d
uk: Значення P поза діапазоном при G10 L%d

source: Between G5.2 and G5.3 codes, only additional G5.2 codes are allowed.
uk: Між кодами G5.2 та G5.3 дозволені лише додаткові коди G5.2.

source: D word with no G41, G41.1, G42, G42.1, G71, G71.1, G71.2 G73, G83 or G96 to use it
uk: Слово D без G41, G41.1, G42, G42.1, G71, G71.1, G71.2 або G96 для його використання

source: $ (spindle selection) word with no M3, M4, M5, M19, M51, G33, G33.1, G76, G95, G96 or G97 to use it
uk: Слово $ (вибір шпинделя) без M3, M4, M5, M19, M51, G33, G33.1, G76, G95, G96 або G97 для його використання

source: E word with no G70, G76, M66, M67 or M68 to use it
uk: Слово на валідній лінії без G70, G76, M66, M67 або M68 для його використання

source: H word with no G43 or G76 to use it
uk: Слово на H без G43 або G76 для його використання

source: I word with no G2, G3, G5, G5.1, G6, G6.1, G10, G33.1, G76, or G87 to use it
uk: Я слово без G2, G3, G5, G5.1, G6, G6.1, G10, G33.1, G76 або G87 для його використання

source: J word with no G2, G3, G5, G5.1, G6, G6.1, G10, G76 or G87 to use it
uk: Слово на J без G2, G3, G5, G5.1, G6, G6.1, G10, G76 або G87 для його використання

source: K word with no G2, G3, G6.2, G33, G33.1, G76, or G87 to use it
uk: Слово на літеру K без G2, G3, G6.2, G33, G33.1, G76 або G87 для його використання

source: L word with no G10, cutter compensation, canned cycle, digital/analog input, M98 or NURBS code
uk: L-слово без G10, компенсація різця, стандартний цикл, цифровий/аналоговий вхід, код M98 або NURBS

source: P word with no G2 G3 G4 G10 G64 G5 G5.2 G6, G6.2, G76 G82 G86 G88 G89 or M50 M51 M52 M53 M62 M63 M64 M65 M66 M98 or user M code to use it
uk: P-слово без G2 G3 G4 G10 G64 G5 G5.2 G6, G6.2, G76 G82 G86 G88 G89 або M50 M51 M52 M53 M62 M63 M64 M65 M66 M98 або M-коду користувача для його використання

source: P value not an integer with M19 G2 or G3
uk: Значення P не є цілим числом з M19 G2 або G3

source: P value must be 0,1,or 2 with M19
uk: Значення P має бути 0, 1 або 2 для M19

source: P value should be 1 or greater with G2 or G3
uk: Значення P має бути 1 або більше при G2 або G3

source: Q word with no G5, G6, G10, G64, G73, G76, G83, M19, M66, M67, M68 or user M code that uses it
uk: Q-слово без G5, G6, G10, G64, G73, G76, G83, M19, M66, M67, M68 або коду користувача M, який його використовує

source: R value must be within 0..360 with M19
uk: Значення R має бути в межах 0..360 з M19

source: You must specify both X and Y coordinates for Control Points
uk: Ви повинні вказати координати X та Y для контрольних точок

source: Can specify P without X and Y only for the first control point
uk: Можна вказати P без X та Y лише для першої контрольної точки

source: You must specify both Y and Z coordinates for Control Points
uk: Ви повинні вказати координати Y та Z для контрольних точок

source: Can specify P without Y and Z only for the first control point
uk: Можна вказати P без Y та Z лише для першої контрольної точки

source: You must specify both X and Z coordinates for Control Points
uk: Ви повинні вказати координати X та Z для контрольних точок

source: Can specify P without X and Z only for the first control point
uk: Можна вказати P без X та Z лише для першої контрольної точки

source: Must specify positive weight P for every Control Point
uk: Потрібно вказати додатну вагу P для кожної контрольної точки

source: Cannot make a NURBS with 0 feedrate
uk: Неможливо створити NURBS з 0-швидкістю подачі

source: Cannot use G5.3 without G5.2 first
uk: Неможливо використовувати G5.3 без попереднього підключення G5.2

source: You must specify a number of control points at least equal to the order L = %d
uk: Ви повинні вказати кількість контрольних точок, щонайменше рівну порядку L = %d

source: one plane must be selected for nurbs: XY, YZ, ZX
uk: Для нур-орієнтів (NURB) необхідно вибрати одну площину: XY, YZ, ZX

source: Program the nurbs order P in the first block of instruction
uk: Запрограмуйте порядок NURB P у першому блоці інструкцій

source: nurbs order P number is not an integer
uk: Номер P у порядку NURB не є цілим числом

source: Program the nurbs Q value (1,2,3) in the first block of nurbs instruction
uk: Запрограмуйте значення Q (1,2,3) для nurbs у першому блоці інструкції nurbs

source: nurbs Q value not in range 1 to 3
uk: значення Q nurbs не входить до діапазону від 1 до 3

source: nurbs Q number is not an integer
uk: Число Q не є цілим числом

source: Must specify positive nurbs weight R for every Control Point
uk: Потрібно вказати додатну вагу R для кожної контрольної точки

source: Must specify nurbs K number for every Control Point
uk: Потрібно вказати число K для кожної контрольної точки

source: nurbs K number is not an integer
uk: Число K не є цілим числом

source: Cannot make a nurbs with 0 feedrate
uk: Неможливо створити NURB з 0-кратною швидкістю подачі

source: You must specify a number of control points at least equal to the order P = %d
uk: Ви повинні вказати кількість контрольних точок, щонайменше рівну порядку P = %d

source: Cannot convert spline with cutter radius compensation
uk: Неможливо конвертувати сплайн з компенсацією радіуса різця

source: Splines may not have motion in A, B, or C
uk: Сплайни можуть не мати руху в A, B або C

source: Must specify both I and J with G5.1 or G6.1
uk: Потрібно вказати як I, так і J за допомогою G5.1 або G6.1

source: Must specify both I and J, or neither
uk: Потрібно вказати як I, так і J, або жодного

source: Must specify both P and Q with G5
uk: Потрібно вказати як P, так і Q за допомогою G5

source: The move just after exiting cutter compensation mode must be straight, not an arc
uk: Рух одразу після виходу з режиму компенсації різця має бути прямим, а не дугоподібним

source: Cannot do an arc in planes G17.1, G18.1, or G19.1
uk: Неможливо побудувати дугу в площинах G17.1, G18.1 або G19.1

source: Cannot feed with zero spindle speed in feed per rev mode
uk: Неможливо подати з нульовою швидкістю шпинделя в режимі подачі на оберт

source: %c word missing in absolute center arc
uk: %c слово відсутнє в дузі абсолютного центру

source: Radius of cutter compensation entry arc is not greater than the tool radius
uk: Радіус дуги входу компенсації різця не перевищує радіуса інструменту

source: Arc move in concave corner cannot be reached by the tool without gouging
uk: Інструмент не може досягти дугового руху у увігнутому куті без строжки

source: Arc to arc motion is invalid because the arcs have the same center
uk: Рух від дуги до дуги недійсний, оскільки дуги мають однаковий центр

source: Arc to arc motion makes a corner the compensated tool can't fit in without gouging
uk: Рух від дуги до дуги створює кут, в який компенсований інструмент не може поміститися без строжки

source: Invalid absolute position %5.2f for wrapped rotary axis %c
uk: Недійсна абсолютна позиція %5.2f для обертальної осі %c

source: Cannot change control mode with cutter radius compensation on
uk: Неможливо змінити режим керування, якщо ввімкнено компенсацію радіуса різця

source: Cannot change coordinate systems with cutter radius compensation on
uk: Неможливо змінити системи координат, якщо ввімкнено компенсацію радіуса різця

source: G%d.1 with no D word
uk: G%d.1 без слова на D

source: G%d.1 with L word, but plane is not G18
uk: G%d.1 зі словом L, але площина не є G18

source: G%d requires D word to be a whole number
uk: G%d вимагає, щоб слово D було цілим числом

source: G%d with lathe tool, but plane is not G18
uk: G%d з токарним інструментом, але площина не G18

source: Cannot set reference point with cutter compensation in effect
uk: Неможливо встановити контрольну точку, якщо діє корекція на різець

source: gen_restore G20/G21 failed: '%s'
uk: Помилка gen_restore G20/G21: '%s'

source: BUG: cannot restore from a lower call level (%d) to a higher call level (%d)
uk: ПОМИЛКА: неможливо відновити з нижчого рівня виклику (%d) на вищий рівень виклику (%d)

source: BUG: restore from level %d !?
uk: ПОМИЛКА: відновлення з рівня %d !?

source: BUG: restore to level %d !?
uk: ПОМИЛКА: відновити до рівня %d !?

source: M7x: restore_settings G20/G21 failed: '%s'
uk: M7x: не вдалося restore_settings G20/G21: '%s'

source: M7x: restore_settings failed executing: '%s': %s
uk: M7x: не вдалося виконати restore_settings: '%s': %s

source: Failed to restore interp state on abort '%s': %s
uk: Не вдалося відновити стан інтерфейсу під час переривання '%s': %s

source: Cannot set motion output with cutter radius compensation on
uk: Неможливо встановити вихідний рух, якщо ввімкнено компенсацію радіуса різця

source: No valid P word with M62
uk: Немає дійсного P-слова з M62

source: Cannot set motion digital output with cutter radius compensation on
uk: Неможливо встановити цифровий вихід руху, якщо ввімкнено компенсацію радіуса різця

source: No valid P word with M63
uk: Немає дійсного P-слова з M63

source: Cannot set auxiliary digital output with cutter radius compensation on
uk: Неможливо встановити допоміжний цифровий вихід, якщо ввімкнено компенсацію радіуса різця

source: No valid P word with M64
uk: Немає дійсного P-слова з M64

source: No valid P word with M65
uk: Немає дійсного P-слова з M65

source: invalid P-word with M66
uk: недійсне слово на P з M66

source: Cannot wait for digital input with cutter radius compensation on
uk: Неможливо дочекатися цифрового входу, якщо ввімкнено компенсацію радіуса різця

source: Cannot wait for analog input with cutter radius compensation on
uk: Неможливо чекати на аналоговий вхідний сигнал, якщо ввімкнено компенсацію радіуса різця

source: Cannot set motion analog output with cutter radius compensation on
uk: Неможливо встановити аналоговий вихід руху, якщо ввімкнено компенсацію радіуса різця

source: Invalid analog index with M67
uk: Недійсний аналоговий індекс з M67

source: Cannot set auxiliary analog output with cutter radius compensation on
uk: Неможливо встановити допоміжний аналоговий вихід, якщо ввімкнено компенсацію радіуса різця

source: Invalid analog index with M68
uk: Недійсний аналоговий індекс з M68

source: Need non-negative Q-word to specify tool number with M61
uk: Потрібне невід'ємне Q-слово для визначення номера інструменту за допомогою M61

source: Spindle ($) number out of range in M3 Command num_spindles =%i. $=%d
uk: Номер шпинделя ($) поза діапазоном у команді M3 num_spindles =%i. $=%d

source: Spindle ($) number out of range in M4 Command num_spindles =%i. $=%d
uk: Номер шпинделя ($) поза діапазоном у команді M4 num_spindles =%i. $=%d

source: Spindle ($) number out of range in M5 Command num_spindles =%i. $=%d
uk: Номер шпинделя ($) поза діапазоном у команді M5 num_spindles =%i. $=%d

source: Spindle ($) number out of range in M19 Command
uk: Номер шпинделя ($) поза діапазоном у команді M19

source: Q word with M19 requires a value > 0
uk: Q-слово з M19 вимагає значення > 0

source: Cannot restore context from invalid stack frame - missing M70/M73?
uk: Неможливо відновити контекст з недійсного стекового кадру – відсутній M70/M73?

source: Cannot enable overrides with cutter radius compensation on
uk: Неможливо ввімкнути коригування, якщо ввімкнено компенсацію радіуса різця

source: Cannot disable overrides with cutter radius compensation on
uk: Неможливо вимкнути коригування, якщо ввімкнено компенсацію радіуса різця

source: Invalid spindle ($) number in M51 command
uk: Недійсний номер шпинделя ($) у команді M51

source: Indexing axis %c can only be moved with G0
uk: Індексовану вісь %c можна переміщувати лише за допомогою G0

source: Indexing axis %c can only be moved alone
uk: Індексовану вісь %c можна переміщувати лише окремо

source: Cannot probe with feed per rev mode
uk: Неможливо зондувати в режимі подачі на оберт

source: Cannot change retract mode with cutter radius compensation on
uk: Неможливо змінити режим відведення, якщо ввімкнено компенсацію радіуса різця

source: G10 L1 without offsets has no effect
uk: G10 L1 без зміщень не має ефекту

source: Q number in G10 is not an integer
uk: Число Q у G10 не є цілим числом

source: Invalid tool orientation
uk: Неправильна орієнтація інструменту

source: I J words not allowed with G10 L2
uk: Слова I J не дозволені з G10 L2

source: Cannot change the active coordinate system with cutter radius compensation on
uk: Неможливо змінити активну систему координат, якщо ввімкнено компенсацію радіуса різця

source: R not allowed in G10 L20
uk: R не дозволено в G10 L20

source: Bug: Reached convert_stop() from M99 as subprogram return
uk: Помилка: Досягнуто convert_stop() з M99 як повернення підпрограми

source: Invalid spindle ($) number in G33 move
uk: Недійсний номер шпинделя ($) у переміщенні G33

source: Spindle not turning in G33
uk: Шпиндель не обертається в G33

source: Invalid spindle ($) number in G33.1 move
uk: Недійсний номер шпинделя ($) у переміщенні G33.1

source: Spindle not turning in G33.1
uk: Шпиндель не обертається в G33.1

source: Invalid D-number in G76 cycle
uk: Недійсний номер D у циклі G76

source: Chosen spindle (%i) not turning in G76
uk: Вибраний шпиндель (%i) не обертається в G76

source: BUG: An axis incorrectly moved along with an indexer
uk: ПОМИЛКА: Вісь неправильно переміщувалася разом з індексатором

source: BUG: trying to index incorrect axis
uk: ПОМИЛКА: спроба індексувати неправильну вісь

source: Cannot use G76 threading cycle with cutter radius compensation on
uk: Неможливо використовувати цикл нарізання різьби G76 з увімкненою компенсацією радіуса різця

source: In G76, I must not be 0
uk: У G76 я не повинен бути 0

source: In G76, J must be greater than 0
uk: У G76 J має бути більше 0

source: In G76, K must be greater than J
uk: У G76 K має бути більше, ніж J

source: Length of cutter compensation entry move is not greater than the tool radius
uk: Довжина вхідного ходу компенсації різця не перевищує радіуса інструменту

source: Zero degree inside corner is invalid for cutter compensation
uk: Нульовий градус внутрішнього кута недійсний для компенсації різця

source: Arc to straight motion makes a corner the compensated tool can't fit in without gouging
uk: Рух від дуги до прямолінійного створює кут, в який компенсований інструмент не може поміститися без строжки

source: Cannot change tools with cutter radius compensation on
uk: Неможливо змінити інструменти, якщо ввімкнено компенсацію радіуса різця

source: Cannot change tool offset with cutter radius compensation on
uk: Неможливо змінити зміщення інструменту, якщо ввімкнено компенсацію радіуса різця

source: G43.2: Can not have both H and axis words
uk: G43.2: Не може містити одночасно слова H та слова осі

source: G43.2: No axes specified and H word missing
uk: G43.2: Не вказано осі та відсутнє слово H

source: BUG: cutter compensation has generated an invalid arc with mismatched radii r1 %f r2 %f
uk: ПОМИЛКА: компенсація різця згенерувала недійсну дугу з невідповідними радіусами r1 %f r2 %f

source: BUG: Unsupported plane in cutter compensation
uk: ПОМИЛКА: Непідтримувана площина в компенсації різця

source: Straight traverse in concave corner cannot be reached by the tool without gouging
uk: Інструмент не може досягти прямого перерізу у увігнутому куті без строжки

source: BUG: Unsupported plane [%d] in cutter compensation
uk: ПОМИЛКА: Непідтримувана площина [%d] у компенсації різця

source: Straight feed in concave corner cannot be reached by the tool without gouging
uk: Пряма подача у увігнутому куті не може бути досягнута інструментом без строжки

source: Spindle not turning in %s
uk: Шпиндель не обертається через %s

source: Spindle turning clockwise in G74
uk: Обертання шпинделя за годинниковою стрілкою в G74

source: Spindle turning counterclockwise in G84
uk: Обертання шпинделя проти годинникової стрілки в G84

source: Spindle state unknown for %s
uk: Стан шпинделя невідомий для %s

source: Cannot feed with zero feed rate
uk: Неможливо подати з нульовою швидкістю подачі

source: Cannot use inverse time feed with canned cycles
uk: Не можна використовувати зворотну подачу за часом зі стандартними циклами

source: Cannot use canned cycles with cutter compensation on
uk: Неможливо використовувати стандартні цикли з увімкненою компенсацією різця

source: G17 canned cycle is not possible on a machine without Z axis
uk: Стандартний цикл G17 неможливий на верстаті без осі Z

source: Invalid spindle ($) number in G74/G84 cycle
uk: Недійсний номер шпинделя ($) у циклі G74/G84

source: G17.1 canned cycle is not possible on a machine without W axis
uk: Стандартний цикл G17.1 неможливий на верстаті без осі W

source: G19 canned cycle is not possible on a machine without X axis
uk: Стандартний цикл G19 неможливий на верстаті без осі X

source: G19.1 canned cycle is not possible on a machine without U axis
uk: Стандартний цикл G19.1 неможливий на верстаті без осі U

source: G18 canned cycle is not possible on a machine without Y axis
uk: Стандартний цикл G18 неможливий на верстаті без осі Y

source: Invalid E-number in G74/G84 cycle
uk: Недійсний номер E у циклі G74/G84

source: G18.1 canned cycle is not possible on a machine without V axis
uk: Стандартний цикл G18.1 неможливий на верстаті без осі V

source: Invalid spindle ($) number in Spindle Mode command
uk: Недійсний номер шпинделя ($) у команді Spindle Mode

source: Invalid spindle ($) number in Spindle Feed command
uk: Недійсний номер шпинделя ($) у команді подачі шпинделя

source: Invalid spindle ($) number in Spindle speed command
uk: Недійсний номер шпинделя ($) у команді швидкості шпинделя

source: Cannot use polar coordinates with G53
uk: Неможливо використовувати полярні координати з G53

source: Cannot specify X or Y words with polar coordinate
uk: Не можна вказати слова X або Y з полярною координатою

source: Must specify angle in polar coordinate if at the origin
uk: Потрібно вказати кут у полярних координатах, якщо він знаходиться в початку координат

source: Incremental motion with polar coordinates is indeterminate when at the origin
uk: Інкрементальний рух з полярними координатами є невизначеним у початку координат

source: G91 motion with polar coordinates is indeterminate when at the origin
uk: Рух G91 з полярними координатами є невизначеним у початку координат

source: Requested tool %d not found in the tool table
uk: Запитаний інструмент %d не знайдено в таблиці інструментів

source: Cannot use polar coordinate on a machine lacking X or Y axes
uk: Неможливо використовувати полярні координати на машині, на якій відсутні осі X або Y

source: Cannot use polar coordinate except in G17 plane
uk: Неможливо використовувати полярну координату, окрім як у площині G17

source: Cannot specify both polar coordinate and X word
uk: Не можна вказати одночасно полярну координату та слово X

source: Cannot specify both polar coordinate and Y word
uk: Не можна вказати одночасно полярну координату та слово Y

source: Polar coordinates can only be used for motion
uk: Полярні координати можна використовувати лише для руху

source: Bad character '\%03o' used
uk: Використано недійсний символ '\%03o'

source: Bad character '%c' used
uk: Використано недійсний символ '%c'

source: %d: Bug: Non-m98/m99 M-code passed to read_o(): '%s'
uk: %d: Помилка: До read_o() передано M-код, що не відповідає m98/m99: '%s'

source: Left bracket missing after 'while'
uk: Ліва дужка відсутня після слова «while»

source: Left bracket missing after 'repeat'
uk: Ліва дужка відсутня після слова «повторити»

source: Left bracket missing after 'if'
uk: Ліва дужка відсутня після "якщо"

source: Left bracket missing after 'elseif'
uk: Відсутня ліва дужка після 'elseif'

source: Cannot read current position with cutter radius compensation on
uk: Не вдається зчитати поточне положення, якщо ввімкнено компенсацію радіуса різця

source: Expected # reading parameter
uk: Очікуваний # параметр читання

source: Expected ] reading bracketed parameter
uk: Очікується ] зчитування параметра в дужках

source: bad number format (conversion failed) parsing '%s'
uk: неправильний формат числа (не вдалося конвертувати), розбір '%s'

source: bad number format (trailing characters) parsing '%s'
uk: неправильний формат числа (завершальні символи) під час розбору '%s'

source: Calculation resulted in 'not a number'
uk: В результаті обчислення вийшло «не число»

source: Calculation resulted in 'infinity'
uk: Обчислення призвело до «нескінченності»

source: EOF in file:%s seeking o-word: o<%s> from line: %d
uk: EOF у файлі:%s шукає o-слово: o<%s> з рядка: %d

source: Multiple U words on one line
uk: Кілька слів на букву "U" в одному рядку

source: Multiple V words on one line
uk: Кілька слів на букву V в одному рядку

source: Multiple W words on one line
uk: Кілька слів на W в одному рядку

source: File:%s line:%d sub: o|%s| found in illegal location
uk: Файл:%s рядок:%d підрядок: o|%s| знайдено в недозволеному місці

source: File:%s line:%d redefining sub: o|%s| already defined in file:%s
uk: Файл:%s рядок:%d перевизначення підрядка: o|%s| вже визначено у файлі:%s

source: %d: not in a subroutine definition: '%s'
uk: %d: не у визначенні підпрограми: '%s'

source: %d: duplicate O-word label: '%s' - defined in line %d
uk: %d: дублікат мітки O-слова: '%s' - визначено в рядку %d
