Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: Tool Setting
uk: Налаштування інструменту

source: Run At Line
uk: Біжи на лінії

source: Change View
uk: Змінити Перегляд

source: Homing
uk: Самонаведення

source: Ignore Limits
uk: Ігнорувати Обмеження

source: Set Override
uk: Встановити Перезаписати

source: Graphics
uk: Графіка

source: Menu Level
uk: Меню Рівень

source: Launch Keyboard
uk: Запуск Клавіатура

source: <b>Select Buttons</b>
uk: <b>Вибрати кнопки</b>

source: screen 2
uk: екран 2

source: Move to your home directory
uk: Перейти до вашого домашнього каталогу

source: Move to parent directory
uk: Перемістити до батьківського каталогу

source: Select the previous file
uk: Вибрати попередній файл

source: Select the next file
uk: Вибрати наступний файл

source: Jump to user defined directory
uk: Перейти до користувацького каталогу

source: select the highlighted file and return the path
uk: вибрати виділений файл і повернути шлях

source: Close without returning a file path
uk: Закрити без повернення шляху до файлу

source: Command
uk: Команда

source: ERROR loading halshow
uk: ПОМИЛКА завантаження halshow

source: offsetpage widget error: unrecognized float input
uk: Помилка віджета offsetpage: нерозпізнаний вхідний код з плаваючою комою

source: offsetpage widget error: MDI call error
uk: Помилка віджета offsetpage: помилка виклику MDI

source: MDI error in offsetpage widget -zero G92
uk: Помилка MDI у віджеті offsetpage -нуль G92

source: MDI error in offsetpage widget-zero rotational offset
uk: Помилка MDI у віджеті offsetpage – нульове зміщення обертання

source: offsetpage_widget error: cannot select coordinate system
uk: Помилка offsetpage_widget: неможливо вибрати систему координат

source: tooledit_widget error: cannot select tool number
uk: помилка tooledit_widget: неможливо вибрати номер інструменту

source: Toolfile does not exist
uk: Файл інструментів не існує

source: Tooledit widget int error
uk: Помилка цілого числа віджета Tooledit

source: Tooledit widget float error
uk: Помилка віджета Tooledit з плаваючою точкою

source: Something wrong with the locale settings. Will not save the tool table.
uk: Щось не так з налаштуваннями локалі. Не вдається зберегти таблицю інструментів.

source: Error converting a float with the given localization setting. A backup file has been created:
uk: Помилка конвертації числа з плаваючою комою з заданим налаштуванням локалізації. Створено резервний файл:

source: Reloading tooltable into linuxcnc failed
uk: Не вдалося перезавантажити таблицю інструментів у linuxcnc

source: Tool file was modified since it was last read
uk: Файл інструмента було змінено з моменту останнього читання

source: radiobutton
uk: радіокнопка

source: checkbutton
uk: прапорець

source: button
uk: кнопка

source: togglebutton
uk: перемикач

source: Offset
uk: Зсув

source: Rot
uk: Гниль

source: Zero G92
uk: Нуль G92

source: Zero Rotational
uk: Нульовий Обертальний

source: Select
uk: Виберіть

source: Tool#
uk: Інструмент#

source: Pocket
uk: Кишеньковий

source: Diameter
uk: Діаметр

source: Front
uk: Фронт

source: Orientation
uk: Орієнтація

source: Comments
uk: Коментарі

source: Reload
uk: Перезавантажити

source: All Offsets
uk: Усі зміщення

source: X Wear
uk: Носить Х

source: Z Wear
uk: Носить Z

source: Lathe Wear Offsets
uk: Зміщення зносу токарного верстата

source: X Tool
uk: Інструмент X

source: Z Tool
uk: Інструмент Z

source: Lathe Tool Offsets
uk: Зміщення токарного інструменту

source: mm → in
uk: мм → дюйм

source: in → mm
uk: дюйми → мм
