Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: stop loading program preview
uk: зупинити завантаження попереднього перегляду програми

source: Toggle mist
uk: Увімкнути/вимкнути туман

source: Toggle flood
uk: Увімкнути/вимкнути затоплення

source: Spindle brake off
uk: Гальмо шпинделя вимкнено

source: Spindle brake on
uk: Гальмо шпинделя увімкнено

source: Turn spindle clockwise
uk: Поверніть шпиндель за годинниковою стрілкою

source: Turn spindle counterclockwise
uk: Поверніть шпиндель проти годинникової стрілки

source: Turn spindle more slowly
uk: Поверніть шпиндель повільніше

source: Turn spindle more quickly
uk: Швидше обертайте шпиндель

source: Clear live plot
uk: Очистити живий сюжет

source: Cycle among preset views
uk: Перемикання між попередньо встановленими режимами перегляду

source: Cycle among preview, DRO, and user tabs
uk: Перемикання між вкладками попереднього перегляду, DRO та користувача

source: toggle Actual/Commanded
uk: перемикання між фактичним/заданим

source: toggle Relative/Machine
uk: перемикання між відносним/машинним

source: Clear notifications
uk: Очистити сповіщення

source: Open a Menu
uk: Відкрити меню

source: Unknown tool %d
uk: Невідомий інструмент %d

source: No tool
uk: Без інструменту

source: Tool %(tool)d, offset %(zo)g, diameter %(dia)g
uk: Інструмент %(tool)d, зміщення %(zo)g, діаметр %(dia)g

source: Tool %(tool)d, zo %(zo)g, xo %(xo)g, dia %(dia)g
uk: Інструмент %(tool)d, zo %(zo)g, xo %(xo)g, діаметр %(dia)g

source: G-code preview loading timed out
uk: Час очікування завантаження попереднього перегляду G-коду минув

source: Filtering...
uk: Фільтрація...

source: Filter failed
uk: Фільтр не вдалося

source: The program %(program)r exited with code %(code)d. Any error messages it produced are shown below:
uk: Програма %(program)r завершилася з кодом %(code)d. Будь-які повідомлення про помилки, які вона видала, наведено нижче:

source: G-Code error in %s
uk: Помилка G-коду в %s

source: Near line %(seq)d of %(f)s: %(error_str)s
uk: Біля рядка %(seq)d від %(f)s: %(error_str)s

source: Continuous
uk: Безперервний

source: T Tool Table
uk: T подібний стіл інструментів

source: in
uk: в

source: radius
uk: радіус

source: diameter
uk: діаметр

source: Coordinate System:
uk: Система координат:

source: fixture
uk: пристосування

source: workpiece
uk: заготовка

source: Name:
uk: Ім'я:

source: Size:
uk: Розмір:

source: Tool order:
uk: Замовлення інструментів:

source: Rapid distance:
uk: Швидка дистанція:

source: Feed distance:
uk: Відстань подачі:

source: Total distance:
uk: Загальна відстань:

source: Run time:
uk: Час виконання:

source: Tool Change List:
uk: Список змін інструментів:

source: X bounds:
uk: Межі X:

source: Y bounds:
uk: Межі Y:

source: Z bounds:
uk: Z-межі:

source: A bounds:
uk: A межі:

source: B bounds:
uk: B межі:

source: C bounds:
uk: C межі:

source: Program exceeds machine minimum on axis %s
uk: Програма перевищує мінімальну величину верстата на осі %s

source: Program exceeds machine maximum on axis %s
uk: Програма перевищує максимальну потужність машини на осі %s

source: Program exceeds machine limits
uk: Програма перевищує обмеження машини

source: Re-Check
uk: Перевірте ще раз

source: Run Anyway
uk: Все одно запустити

source: No file loaded
uk: Файл не завантажено

source: generated from %s
uk: згенеровано з %s

source: %(size)s bytes %(lines)s G-code lines
uk: %(size)s байтів %(lines)s рядків G-коду

source: %.1f minutes
uk: %.1f хвилин

source: %d seconds
uk: %d секунди

source: %(a)f to %(b)f = %(diff)f %(units)s
uk: %(a)f до %(b)f = %(diff)f %(units)s

source: G-Code Properties
uk: Властивості G-коду

source: Homing request
uk: Запит на самонаведення

source: After turning On the machine power, You need find axes origins. Run homing process?
uk: Після ввімкнення живлення машини, вам потрібно знайти походження осей. Запустити процес повернення до початкового положення?

source: All machinable files
uk: Усі файли, що підлягають обробці

source: rs274ngc files
uk: Файли rs274ngc

source: axis cannot accept remote command while running
uk: вісь не може приймати віддалені команди під час роботи

source: File not Writable:
uk: Файл не доступний для запису:

source: This file is not writable You can Edit-readonly or Save it to your own directory then open that saved, writable file
uk: Цей файл не можна записувати Ви можете редагувати лише для читання або Зберегти його у власному каталозі а потім відкрити цей збережений файл з можливістю запису

source: Edit-readonly
uk: Тільки для редагування

source: Custom Grid
uk: Користувацька сітка

source: Enter grid size
uk: Введіть розмір сітки

source: Joint is already homed, are you sure you want to re-home?
uk: Стик вже зарахований до житла, ви впевнені, що хочете перезарахувати його до житла?

source: home_joint <%s> Use joint mode for homing
uk: home_joint <%s> Використовувати режим спільного розташування для переміщення по головній сторінці

source: Individual axis homing disallowed for duplicated letter:<%s>
uk: Індивідуальне переміщення по осі заборонено для дублікату літери: <%s>

source: This joint is already homed, are you sure you want to re-home?
uk: Цей джоінг вже заселений, ви впевнені, що хочете перезаселений?

source: Enter %s coordinate relative to %%s:
uk: Введіть координату %s відносно %%s:

source: Tool %s TouchOff
uk: Інструмент %s TouchOff

source: Error saving file
uk: Помилка збереження файлу

source: Missing required specifier: %s See the 'INI Configuration' documents
uk: Відсутній обов'язковий специфікатор: %s Див. документи «Конфігурація INI»

source: Missing required specifier (has linear joint or axis): %s See the 'INI Configuration' documents
uk: Відсутній обов'язковий специфікатор (має лінійний шарнір або вісь): %s Див. документи «Конфігурація INI»

source: Warning: Missing required specifier (has angular joint or axis): %s See the 'INI Configuration' documents
uk: Попередження: Відсутній обов'язковий специфікатор (має кутовий шарнір або вісь): %s Див. документи «Конфігурація INI»

source: Axes
uk: Сокири

source: Joints
uk: Суглоби

source: Home All
uk: Головна сторінка Всі

source: Home all %s [Ctrl-Home]
uk: Головна сторінка всі %s [Ctrl-Home]

source: Home All %s
uk: Головна сторінка Усі %s

source: Unhome All %s
uk: Зняти з дому всі %s

source: Warning: Forward kinematics must handle duplicate coordinate letters:%s
uk: Попередження: Кінематика вперед повинна обробляти дублікати координатних літер:%s

source: Note: number of [TRAJ]COORDINATES=%(t)s exceeds [KINS]JOINTS=%(l)d
uk: Примітка: кількість [TRAJ]COORDINATES=%(t)s перевищує [KINS]JOINTS=%(l)d

source: Note: Individual axis homing is not currently supported for
uk: Примітка: Переміщення по осях наразі не підтримується для

source: KINEMATICS_IDENTITY with duplicate axis letter <%s>
uk: KINEMATICS_IDENTITY з дублікатом літери осі <%s>

source: Joint
uk: Суглоб

source: Home Joint
uk: Домашній суглоб

source: Home %(name)s _%(id)s
uk: Головна сторінка %(name)s _%(id)s

source: Unhome %(name)s _%(id)s
uk: Недоступні %(name)s _%(id)s

source: Run from here
uk: Біжи звідси

source: toggle PYVCP panel visibility
uk: перемикання видимості панелі PYVCP

source: Show PyVCP pan_el
uk: Показати PyVCP pan_el

source: Error in ~/.axisrc
uk: Помилка в ~/.axisrc

source: LinuxCNC Status
uk: Статус LinuxCNC

source: Copy All
uk: Копіювати все

source: Remove the tool and click continue when ready
uk: Вилучити інструмент і натисніть «Продовжити», коли будете готові

source: Tool change
uk: Зміна інструменту

source: Continue
uk: Продовжити

source: Insert tool and click continue when ready. Tool number: %(number)s Diameter: %(diameter)s%(units)s Comment: %(comment)s
uk: Вставте інструмент і натисніть «Продовжити», коли будете готові. Номер інструменту: %(number)s Діаметр: %(diameter)s%(units)s Коментар: %(comment)s

source: Insert tool %d and click continue when ready
uk: Вставте інструмент %d та натисніть «Продовжити», коли будете готові

source: Error: %s
uk: Помилка: %s

source: AXIS Manual Toolchanger
uk: Ручний змінник інструментів AXIS

source: This window is part of the AXIS manual toolchanger. It is safe to close or iconify this window, or it will close automatically after a few seconds.
uk: Це вікно є частиною ручного змінника інструментів AXIS. Ви можете безпечно закрити або перетворити це вікно на піктограму, інакше воно закриється автоматично через кілька секунд.

source: %s: Image to G-code
uk: %s: Зображення в G-код

source: Image to G-code
uk: Зображення в G-код

source: Image size: %(w)d x %(h)d pixels Minimum pixel value: %(min)d Maximum pixel value: %(max)d
uk: Розмір зображення: %(w)d x %(h)d пікселів Мінімальне значення пікселя: %(min)d Максимальне значення пікселя: %(max)d

source: G20 (in)
uk: G20 (в)

source: G21 (mm)
uk: G21 (мм)

source: White
uk: Білий

source: Black
uk: Чорний

source: Rows
uk: Рядки

source: Columns
uk: Колонки

source: Rows then Columns
uk: Спочатку рядки, потім стовпці

source: Columns then Rows
uk: Спочатку стовпці, потім рядки

source: Positive
uk: Позитивний

source: Negative
uk: Негативний

source: Alternating
uk: Чергування

source: Up Milling
uk: Фрезерування вгору

source: Down Milling
uk: Фрезерування вниз

source: Ball End
uk: Кульовий кінець

source: Flat End
uk: Плоский кінець

source: 30 Degree
uk: 30 градусів

source: 45 Degree
uk: 45 градусів

source: 60 Degree
uk: 60 градусів

source: Secondary
uk: Вторинний

source: Full
uk: Повний

source: Invert Image
uk: Інвертувати зображення

source: Normalize Image
uk: Нормалізувати зображення

source: Extend Image Border
uk: Розширити межу зображення

source: Pixel Size (Units)
uk: Розмір пікселя (одиниці)

source: Depth (units)
uk: Глибина (одиниці)

source: Tolerance (units)
uk: Толерантність (одиниці)

source: Stepover (pixels)
uk: Перехід (пікселі)

source: Tool Diameter (units)
uk: Діаметр інструменту (одиниці)

source: Tool Type
uk: Тип інструменту

source: Feed Rate (units per minute)
uk: Швидкість подачі (одиниць за хвилину)

source: Plunge Feed Rate (units per minute)
uk: Швидкість подачі при зануренні (одиниць за хвилину)

source: Safety Height (units)
uk: Безпечна висота (одиниці)

source: Scan Pattern
uk: Шаблон сканування

source: Scan Direction
uk: Напрямок сканування

source: Lace Bounding
uk: Мереживне облямівання

source: Contact Angle (degrees)
uk: Кут змочування (градуси)

source: Spindle Speed (RPM)
uk: Швидкість шпинделя (RPM)

source: Roughing offset (units, 0=no roughing)
uk: Зміщення чорнової обробки (одиниці, 0 = без чорнової обробки)

source: Roughing depth per pass (units)
uk: Глибина чорнової обробки за прохід (одиниці)

source: image-to-gcode: User pressed cancel
uk: зображення в g-код: Користувач натиснув кнопку скасування

source: Depth images
uk: Зображення глибини

source: LinuxCNC Debug Level
uk: Рівень налагодження LinuxCNC

source: debuglevel
uk: рівень налагодження

source: Configuration *
uk: Конфігурація *

source: Version Numbers *
uk: Номери версій *

source: Task Issue
uk: Проблема завдання

source: Motion Time
uk: Час руху

source: Interpreter List
uk: Список перекладачів

source: State Tags
uk: Теги штату

source: Inifile setting for this debug level: [EMC]DEBUG=0x%08x
uk: Налаштування INI-файлу для цього рівня налагодження: [EMC]DEBUG=0x%08x

source: * This option can only be enabled in the inifile
uk: * Цю опцію можна ввімкнути лише в iniфайлі

source: _Open...
uk: _Відкрити...

source: Recent _Files
uk: Нещодавні _файли

source: _Edit...
uk: _Редагувати...

source: _Reload
uk: _Перезавантажити

source: _Save G-code as...
uk: _Зберегти G-код як...

source: G-code _properties...
uk: Властивості _G-коду...

source: Edit _tool data...
uk: Редагувати дані _інструменту...

source: Reload tool _data
uk: Перезавантажити інструмент _data

source: _Ladder Editor...
uk: _Редактор сходів...

source: Toggle _Emergency Stop
uk: Перемикач _Аварійна зупинка

source: Toggle _Machine Power
uk: Перемикач _Потужність машини

source: _Run program
uk: _Запустити програму

source: Ru_n from selected line
uk: Запустити з вибраного рядка

source: S_tep
uk: S_step

source: _Pause
uk: _Пауза

source: Re_sume
uk: Резюме

source: Stop at M_1
uk: Зупинка на M_1

source: Skip lines with '_/'
uk: Пропускати рядки з символами '_/'

source: Clear MDI h_istory
uk: Очистити історію MDI

source: Copy from MDI hist_ory
uk: Копіювати з історії MDI

source: Paste to MDI histor_y
uk: Вставити в MDI history_y

source: _Calibration
uk: Калібрування

source: Show _Hal Configuration
uk: Показати конфігурацію _Hal

source: H_al Meter
uk: H_al метр

source: Ha_l Scope
uk: Область застосування Ha_l

source: Sho_w LinuxCNC Status
uk: Показати стан LinuxCNC

source: Set _Debug Level
uk: Встановити рівень _Debug

source: _Unhoming
uk: Зняття з дому

source: _Zero coordinate system
uk: _Нульова система координат

source: Tool touch off to wor_kpiece
uk: Дотик інструменту до деталі

source: Tool touch off to _fixture
uk: Дотик інструменту до кріплення

source: _Top view
uk: _Вид зверху

source: _Rotated Top view
uk: _Повернутий вигляд зверху

source: _Side view
uk: _Вид збоку

source: _Front view
uk: _Вигляд спереду

source: _Perspective view
uk: _Перспективний вид

source: Display _Inches
uk: Дисплей _Дюйми

source: Display _MM
uk: Дисплей _MM

source: S_how program
uk: Програма S_show

source: Show program r_apids
uk: Показати програму r_apids

source: Alpha-_blend program
uk: Програма Alpha-_blend

source: Sho_w live plot
uk: Показати сюжет у прямому ефірі

source: Show too_l
uk: Показати too_l

source: Show e_xtents
uk: Показати e_xtents

source: _Grid
uk: _Сітка

source: Show o_ffsets
uk: Показати зміщення

source: Sh_ow machine limits
uk: Показати обмеження машини

source: Show v_elocity
uk: Показати v_elocity

source: Show _distance to go
uk: Показати _відстань, що залишилася

source: Large coordinate fo_nt
uk: Велика координата fo_nt

source: _Clear live plot
uk: _Очистити графік у реальному часі

source: Show commanded position
uk: Показати командну позицію

source: Show actual position
uk: Показати фактичне положення

source: Show machine position
uk: Показати положення машини

source: Show relative position
uk: Показати відносне положення

source: Joint mode
uk: Спільний режим

source: World mode
uk: Світовий режим

source: _Off
uk: _Вимк

source: _Custom
uk: _Користувацька

source: _About AXIS
uk: _Про AXIS

source: Quick _Reference
uk: Короткий довідник

source: _Machine
uk: _Машина

source: _View
uk: _Перегляд

source: Toggle Emergency Stop [F1]
uk: Перемикач аварійної зупинки [F1]

source: Toggle Machine power [F2]
uk: Перемикач живлення машини [F2]

source: Open G-Code file [O]
uk: Відкрити файл G-коду [O]

source: Reopen current file [Ctrl-R]
uk: Відкрити поточний файл знову [Ctrl-R]

source: Begin executing current file [R]
uk: Розпочати виконання поточного файлу [R]

source: Execute next line [T]
uk: Виконати наступний рядок [T]

source: Pause [P] / resume [S] execution
uk: Призупинити [P] / відновити [S] виконання

source: Stop program execution [ESC]
uk: Зупинити виконання програми [ESC]

source: Toggle skip lines with '/' [Alt-M /]
uk: Перемикання пропусків рядків за допомогою '/' [Alt-M /]

source: Toggle optional pause [Alt-M 1]
uk: Увімкнути/вимкнути необов'язкову паузу [Alt-M 1]

source: Zoom in
uk: Збільшити масштаб

source: Zoom out
uk: Зменшити масштаб

source: Top view
uk: Вид зверху

source: Rotated top view
uk: Повернутий вигляд зверху

source: Side view
uk: Вид збоку

source: Front view
uk: Вид спереду

source: Inverted Front view
uk: Перевернутий вид спереду

source: Perspective view
uk: Перспективний вид

source: Toggle between Drag and Rotate Mode [D]
uk: Перемикання між режимом перетягування та повороту [D]

source: Clear live plot [Ctrl-K]
uk: Очистити графік у реальному часі [Ctrl-K]

source: Manual Control [F3]
uk: Ручне керування [F3]

source: Axis:
uk: Вісь:

source: Home Axis
uk: Домашня вісь

source: Touch Off
uk: Дотик вимкнено

source: Tool Touch Off
uk: Інструмент Дотик Вимкнено

source: Spindle:
uk: Шпиндель:

source: Brake
uk: Гальмо

source: Coolant:
uk: Охолоджувальна рідина:

source: Mist
uk: Туман

source: Flood
uk: Повінь

source: History:
uk: Історія:

source: MDI Command:
uk: Команда MDI:

source: Go
uk: Іти

source: Active G-Codes:
uk: Активні G-коди:

source: Jog Speed:
uk: Швидкість штовхання:

source: Max Velocity:
uk: Максимальна швидкість:

source: Spindle Override:
uk: Корекції шпинделя:

source: Rapid Override:
uk: Швидке перевизначення:

source: LinuxCNC/AXIS version $version Copyright (C) 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016 Jeff Epler and Chris Radek. This is free software, and you are welcome to redistribute it under certain conditions. See the file COPYING, included with LinuxCNC. Visit the LinuxCNC web site:
uk: LinuxCNC/AXIS версія $version Copyright (C) 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016 Джеф Еплер і Кріс Радек. Це безкоштовне програмне забезпечення, яке ви можете розповсюджувати за певних умов. Дивіться файл COPYING, що входить до складу LinuxCNC. Відвідайте веб-сайт LinuxCNC:

source: About AXIS
uk: Про AXIS

source: AXIS Quick Reference
uk: Короткий довідник AXIS

source: AXIS $::version on $::machine
uk: AXIS $::version на $::machine

source: (no file)
uk: (немає файлу)

source: Position:
uk: Позиція:

source: Machine
uk: Машина

source: Relative
uk: Родич

source: Actual
uk: Фактичний

source: Commanded
uk: Наказав

source: Joint:
uk: Суглоб:

source: _Clear Recents List
uk: _Очистити список нещодавніх

source: Turn spindle counterclockwise [F10]
uk: Поверніть шпиндель проти годинникової стрілки [F10]

source: Turn spindle clockwise [F9]
uk: Поверніть шпиндель за годинниковою стрілкою [F9]

source: Stop spindle [F9/F10]
uk: Зупинити шпиндель [F9/F10]

source: Turn spindle Faster [F12]
uk: Швидше обертати шпиндель [F12]

source: Turn spindle Slower [F11]
uk: Повільніше обертати шпиндель [F11]

source: Turn spindle brake on [Shift-B] or off [B]
uk: Увімкнути гальмо шпинделя [Shift-B] або вимкнути [B]

source: Turn flood on or off [F8]
uk: Увімкнути або вимкнути затоплення [F8]

source: Turn mist on or off [F7]
uk: Увімкнути або вимкнути туман [F7]

source: Send active axis home [Home]
uk: Надіслати активну вісь додому [Home]

source: Set G54 offset for active axis [End]
uk: Встановити зміщення G54 для активної осі [End]

source: Set tool offset for loaded tool [Ctrl-End]
uk: Встановлення зміщення інструменту для завантаженого інструменту [Ctrl-End]

source: Activate axis [X]
uk: Активувати вісь [X]

source: Activate axis [Y]
uk: Активувати вісь [Y]

source: Activate axis [Z]
uk: Активувати вісь [Z]

source: Activate axis [A]
uk: Активувати вісь [A]

source: Activate axis [4]
uk: Активувати вісь [4]

source: Activate axis [5]
uk: Активувати вісь [5]

source: Jog selected axis
uk: Поштовховий переміщення вибраної осі

source: Temporarily allow jogging outside machine limits [L]
uk: Тимчасово дозволити штовхання поза межами верстата [L]

source: Follow System Theme
uk: Слідкуйте за системною темою

source: Spindle CW
uk: Шпиндель CW

source: Spindle CCW
uk: Шпиндель CCW

source: Set tool number
uk: Встановити номер інструменту

source: Input control
uk: Контроль введення

source: Straight rapid
uk: Прямий швидкий

source: Straight feed
uk: Пряма подача

source: Arc CW
uk: Дуга CW

source: Arc CCW
uk: Дуга CCW

source: Dwell
uk: Залишатися

source: Setup
uk: Встановлення

source: Spindle synchronized feed
uk: Синхронізована подача шпинделя

source: Rigid tap
uk: Жорсткий мітчик

source: Probe
uk: Зонд

source: Radius compensation left
uk: Компенсація радіуса ліворуч

source: Radius compensation right
uk: Компенсація радіуса праворуч

source: Radius compensation left, immediate
uk: Компенсація радіуса ліворуч, негайна

source: Radius compensation right, immediate
uk: Компенсація радіуса праворуч, негайна

source: Tool length offset
uk: Зміщення довжини інструменту

source: Tool length offset immediate
uk: Негайне зміщення довжини інструменту

source: Tool length offset additional
uk: Додаткове зміщення довжини інструменту

source: Motion in unoffset coordinates
uk: Рух у незміщених координатах

source: Continuous mode
uk: Безперервний режим

source: Drill
uk: Дриль

source: Drill with dwell
uk: Свердління з затримкою

source: Peck drill
uk: Дриль Пека

source: Chip-break drill
uk: Свердло з ламким стружкою

source: Bore
uk: Дірка

source: Bore with dwell
uk: Отвір з затримкою

source: Offset all coordinate systems
uk: Змістити всі системи координат

source: CSS Mode
uk: Режим CSS

source: Stopped
uk: Зупинено

source: Absolute
uk: Абсолютний

source: Estop Reset
uk: Зупинити скидання

source: Estop
uk: Естій

source: Machine On
uk: Машина ввімкнена

source: Machine Off
uk: Машина вимкнена

source: <b>Power</b>
uk: <b>Потужність</b>

source: Unhome All
uk: Зняти з дому всіх

source: Home Selected
uk: Вибрано для дому

source: Unhome Selected
uk: Вибрано бездомним

source: <b>Homing</b>
uk: <b>Самонаведення</b>

source: Startup
uk: Запуск

source: Set Tool
uk: Інструмент «Набір»

source: Set Origin
uk: Встановити походження

source: Macro
uk: Макрос

source: Flood On
uk: Потоп увімк

source: Flood Off
uk: Потоп вимк

source: Mist On
uk: Туман увімк

source: Mist Off
uk: Туман вимк

source: <b>Coolant</b>
uk: <b>Охолоджувальна рідина</b>

source: Spindle Forward
uk: Шпиндель вперед

source: Spindle Reverse
uk: Реверс шпинделя

source: Spindle Off
uk: Шпиндель вимкнено

source: Spindle Faster
uk: Шпиндель швидше

source: Spindle Slower
uk: Повільніше обертання шпинделя

source: Spindle speed:
uk: Швидкість шпинделя:

source: <b>Spindle</b>
uk: <b>Шпиндель</b>

source: <b>Page</b>
uk: <b>Сторінка</b>

source: <span foreground="blue" weight="bold">Start Point</span>
uk: <span foreground="blue" weight="bold">Початкова точка</span>

source: <b>Loaded File</b>
uk: <b>Завантажений файл</b>

source: Loaded file:
uk: Завантажений файл:

source: Interpreted line:
uk: Інтерпретований рядок:

source: Distance:
uk: Відстань:

source: Velocity:
uk: Швидкість:

source: Delay:
uk: Затримка:

source: On limit switch:
uk: На кінцевому вимикачі:

source: Spindle direction:
uk: Напрямок шпинделя:

source: Loaded tool:
uk: Завантажений інструмент:

source: Prepped tool:
uk: Підготовлений інструмент:

source: Running line:
uk: Запуск лінія:

source: XY Rotation:
uk: Обертання XY:

source: Tool length:
uk: Довжина інструменту:

source: Active codes:
uk: Активні коди:

source: G5x Offset:
uk: Зсув G5x:

source: G92 Offset:
uk: Зсув G92:

source: Loaded file lines:
uk: Завантажені рядки файлу:

source: Pockets:
uk: Кишені:

source: Status
uk: Статус

source: Control Font:
uk: Шрифт керування:

source: DRO Font:
uk: Шрифт DRO:

source: Error Font:
uk: Шрифт помилки:

source: DRO Font
uk: Шрифт DRO

source: Error Font
uk: Шрифт помилки

source: Listing Font:
uk: Шрифт лістингу:

source: Listing Font
uk: Шрифт лістингу

source: Hide pointer
uk: Приховати вказівник

source: Show pointer
uk: Показати вказівник

source: Theme:
uk: Тема:

source: <b>Display Options</b>
uk: <b>Параметри відображення</b>

source: Inch
uk: Дюйм

source: <b>Position Readout</b>
uk: <b>Зчитування положення</b>

source: Workpiece
uk: Заготовка

source: Fixture
uk: Пристрій

source: <b>Tool Setting</b>
uk: <b>Налаштування інструменту</b>

source: Delete / lines
uk: Видалити / рядки

source: Keep / lines
uk: Зберегти / лінії

source: Pause on M1
uk: Пауза на М1

source: Ignore M1
uk: Ігнорувати M1

source: <b>Program Options</b>
uk: <b>Варіанти програми</b>

source: Preferences
uk: Параметри

source: Jogging
uk: Біг підтюпцем

source: Start Point
uk: Початкова точка

source: <b>Handwheel</b>
uk: <b>Маховик</b>

source: Stepconf encountered an error. The following information may be useful in troubleshooting:
uk: Stepconf виявив помилку. Наступна інформація може бути корисною для усунення несправності:
