Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: # ---PLASMA OUTPUTS---
uk: # ---ПЛАЗМОВІ ВИХОДИ---

source: # ---ARC VOLTAGE ENCODER---
uk: # ---ЕНКОДЕР НАПРУГИ ДУГИ---

source: # ---OHMIC SENSE LINK---
uk: # ---ОМІЧНИЙ ЧУТЛИВИЙ ЗВ'ЯЗОК---

source: # ---COMMON PLASMAC DEBOUNCE---
uk: # ---ЗВИЧАЙНИЙ ПЛАЗМОВИЙ ДЕБАНС---

source: # for the float and ohmic inputs each increment in delay is
uk: # для входів з плаваючою точкою та омічним входом кожен приріст затримки становить

source: # is a 0.001mm (0.00004") increase in any probed height result
uk: # – це збільшення будь-якого результату вимірювання висоти на 0,001 мм (0,00004 дюйма)

source: # set to zero if using internal ohmic sensing
uk: # встановити на нуль, якщо використовується внутрішнє омічне зондування

source: # ---OHMIC SENSE CONTACT DEBOUNCE---
uk: # ---ОМІЧНИЙ ЧУТЛИВИЙ КОНТАКТНИЙ ДЕБАУНС---

source: Screen
uk: Екран

source: External Controls
uk: Зовнішні засоби контролю

source: Mesa Card 0
uk: Картка Меса 0

source: Mesa Card 1
uk: Картка Меса 1

source: Parallel Port 0
uk: Паралельний порт 0

source: Mesa THCAD
uk: Таблиця THCAD

source: X Motor
uk: X Мотор

source: X Axis
uk: Вісь X

source: Y Motor
uk: Y Мотор

source: Y Axis
uk: Y Вісь

source: Z Motor
uk: Z Мотор

source: Z Axis
uk: Z Вісь

source: A Motor
uk: A Мотор

source: A Axis
uk: A Вісь

source: Spindle Motor
uk: Шпиндельний двигун

source: Realtime
uk: У режимі реального часу

source: Not Used
uk: Не використовується

source: Dummy
uk: Манекен

source: 8i20 Servo Drive
uk: Сервопривід 8i20

source: POT Output
uk: Вихід POT

source: POT Enable
uk: Увімкнення POT

source: POT Dir
uk: POT Ви

source: GPIO Input
uk: GPIO Вхід

source: GPIO Output
uk: GPIO Вихід

source: GPIO O Drain
uk: GPIO O Злив

source: SSR Output
uk: Вихід SSR

source: OUTM Output
uk: Вихід OUTM

source: INM Input
uk: Вхід INM

source: Quad Enc-A
uk: Квадратний Enc-A

source: Quad Enc-B
uk: Квадратний Enc-B

source: Quad Enc-I
uk: Квадратний Enc-I

source: Quad Enc-M
uk: Квадратний енкодер-М

source: Muxed Enc 0
uk: Муксований код 0

source: Muxed Enc 1
uk: Муксований код 1

source: muxed Enc I
uk: мультиплексований Enc I

source: Muxed Enc M
uk: Муксований енкодер M

source: mux select
uk: вибір мультиплексора

source: Resolver 0 Encoder
uk: Резольвер 0 Енкодер

source: Resolver 1 Encoder
uk: Резольвер 1 Енкодер

source: Resolver 2 Encoder
uk: Резольвер 2 Енкодер

source: Resolver 3 Encoder
uk: Резолвер 3 Енкодер

source: Resolver 4 Encoder
uk: Резольвер 4 Енкодер

source: Resolver 5 Encoder
uk: Резолвер 5 Енкодер

source: Step Gen-A
uk: Крок Gen-A

source: Dir Gen-B
uk: Ви, покоління B

source: StepGen Phase-C
uk: StepGen Фаза-C

source: StepGen Phase-D
uk: StepGen Фаза D

source: StepGen Phase-E
uk: StepGen Фаза-E

source: StepGen Phase-F
uk: StepGen Фаза F

source: PWM Gen-P
uk: PWM покоління P

source: PWM Gen-D
uk: PWM покоління D

source: PWM Gen-E
uk: PWM Покоління E

source: PDM Gen-P
uk: PDM Покоління П

source: PDM Gen-D
uk: PDM Генерація D

source: PDM Gen-E
uk: PDM Покоління E

source: UDM -Up
uk: UDM -Вгору

source: UDM-Down
uk: UDM-Вниз

source: Motor Phase A
uk: Фаза двигуна А

source: Motor Phase B
uk: Фаза B двигуна

source: Motor Phase C
uk: Фаза C двигуна

source: Motor Phase A Not
uk: Фаза двигуна A Не

source: Motor Phase B Not
uk: Фаза B двигуна Не

source: Motor Phase C Not
uk: Фаза C двигуна Не

source: Motor Enable
uk: Увімкнення двигуна

source: Motor Fault
uk: Несправність двигуна

source: 7i77 Analog-SS1
uk: 7i77 Аналоговий-SS1

source: 7i77 Analog-SS4
uk: 7i77 Аналоговий-SS4

source: Analog Input
uk: Аналоговий вхід

source: X Home
uk: X Головна сторінка

source: Y Home
uk: Y Головна сторінка

source: Z Home
uk: Z Головна сторінка

source: A Home
uk: A Головна сторінка

source: All Home
uk: Все Головного сторінках

source: X2 Tandem Home
uk: X2 Тандем Дім

source: Y2 Tandem Home
uk: Y2 Тандем Дім

source: Z2 Tandem Home
uk: Z2 Тандемний дім

source: A2 Tandem Home
uk: A2 Тандемний дім

source: X Minimum Limit + Home
uk: Мінімальний ліміт X + Дім

source: Y Minimum Limit + Home
uk: Y Мінімальний ліміт + Дім

source: Z Minimum Limit + Home
uk: Мінімальний ліміт Z + Дім

source: A Minimum Limit + Home
uk: Мінімальний ліміт + Дім

source: X Maximum Limit + Home
uk: X Максимальний ліміт + Дім

source: Y Maximum Limit + Home
uk: Y Максимальна межа + Дім

source: Z Maximum Limit + Home
uk: Максимальна межа Z + Дім

source: A Maximum Limit + Home
uk: Максимальна межа + Дім

source: X Both Limit + Home
uk: X Обидва ліміти + Дім

source: Y Both Limit + Home
uk: Y Обидва ліміти + Дім

source: Z Both Limit + Home
uk: Z Обидва ліміти + Дім

source: A Both Limit + Home
uk: Обидва ліміти + Дім

source: All Limits + Home
uk: Усі ліміти + Дім

source: X2 Minimum Limit + Home
uk: Мінімальний ліміт X2 + Дім

source: Y2 Minimum Limit + Home
uk: Мінімальний ліміт Y2 + домашній

source: Z2 Minimum Limit + Home
uk: Мінімальний ліміт Z2 + Дім

source: A2 Minimum Limit + Home
uk: Мінімальний ліміт A2 + Дім

source: X2 Maximum Limit + Home
uk: X2 Максимальний ліміт + Дім

source: Y2 Maximum Limit + Home
uk: Максимальний ліміт Y2 + Дім

source: Z2 Maximum Limit + Home
uk: Максимальний ліміт Z2 + Дім

source: A2 Maximum Limit + Home
uk: A2 Максимальний ліміт + Дім

source: X2 Both Limit + Home
uk: X2 Обидва ліміти + Дім

source: Y2 Both Limit + Home
uk: Y2 Обидва ліміти + Дім

source: Z2 Both Limit + Home
uk: Z2 Обидва ліміти + Дім

source: A2 Both Limit + Home
uk: A2 Обидва ліміти + Дім

source: Joint select A
uk: Спільний вибір А

source: Joint select B
uk: Спільний вибір B

source: Joint select C
uk: Спільний вибір C

source: Joint select D
uk: Спільний вибір D

source: Jog incr A
uk: Збільшення штовхання A

source: Jog incr B
uk: Збільшення бігової швидкості B

source: Jog incr C
uk: Збільшення штовхання C

source: Jog incr D
uk: Збільшення D

source: Feed Override incr A
uk: Збільшення A перевизначення подачі

source: Feed Override incr B
uk: Збільшення перевизначення подачі B

source: Feed Override incr C
uk: Збільшення C перевизначення подачі

source: Feed Override incr D
uk: Збільшення D перевизначення подачі

source: Spindle Override incr A
uk: Збільшення корекції шпинделя A

source: Spindle Override incr B
uk: Збільшення корекції шпинделя B

source: Spindle Override incr C
uk: Збільшення корекції шпинделя C

source: Spindle Override incr D
uk: Збільшення корекції шпинделя D

source: Max Vel Override incr A
uk: Збільшення корекції максимальної крутильної сили A

source: Max Vel Override incr B
uk: Збільшення корекції максимальної крутості B

source: Max Vel Override incr C
uk: Збільшення максимальної крутості C

source: Max Vel Override incr D
uk: Збільшення корекції максимальної крутильної сили D

source: Feed Override enable
uk: Увімкнення перевизначення подачі

source: Spindle Override enable
uk: Увімкнення корекції шпинделя

source: Max Vel Override enable
uk: Увімкнення корекції максимальної вел

source: Manual Spindle CW
uk: Ручний шпиндель за годинниковою стрілкою

source: Manual Spindle CCW
uk: Ручний шпиндель проти годинникової стрілки

source: Manual Spindle Stop
uk: Ручна зупинка шпинделя

source: Spindle Up-To-Speed
uk: Розгін шпинделя до потрібної швидкості

source: Gear Select A
uk: Вибір передачі A

source: Cycle Start
uk: Початок циклу

source: Abort
uk: Перервати

source: Single Step
uk: Один крок

source: Jog X +
uk: Так X +

source: Jog X -
uk: Так X -

source: Jog Y +
uk: Так Y +

source: Jog Y -
uk: Так Y -

source: Jog Z +
uk: Так Z +

source: Jog Z -
uk: Так Z -

source: Jog A +
uk: Так A +

source: Jog A -
uk: Так A -

source: Jog button selected +
uk: Вибрано кнопку Jog +

source: Jog button selected -
uk: Вибрано кнопку поштовху -

source: X Gray C1
uk: X Сірий C1

source: X Gray C2
uk: X Сірий C2

source: X Gray C4
uk: X Сірий C4

source: X Gray C8
uk: X Сірий C8

source: Y Gray C1
uk: Y Сірий C1

source: Y Gray C2
uk: Y Сірий C2

source: Y Gray C4
uk: Y Сірий C4

source: Y Gray C8
uk: Y Сірий C8

source: Z Gray C1
uk: Z Сірий C1

source: Z Gray C2
uk: Z Сірий C2

source: Z Gray C4
uk: Z Сірий C4

source: Z Gray C8
uk: Z Сірий C8

source: A Gray C1
uk: A Сірий C1

source: A Gray C2
uk: A Сірий C2

source: A Gray C4
uk: A Сірий C4

source: A Gray C8
uk: A Сірий C8

source: S Gray C1
uk: S Сірий C1

source: S Gray C2
uk: S Сірий C2

source: S Gray C4
uk: S Сірий C4

source: S Gray C8
uk: S Сірий C8

source: X Minimum Limit
uk: Мінімальний ліміт X

source: Y Minimum Limit
uk: Мінімальна межа Y

source: Z Minimum Limit
uk: Мінімальна ліміт Z

source: A Minimum Limit
uk: Мінімальна ліміт А

source: X Maximum Limit
uk: Максимальна ліміт X

source: Y Maximum Limit
uk: Максимальна ліміт Y

source: Z Maximum Limit
uk: Максимальна ліміт Z

source: A Maximum Limit
uk: Максимальна ліміт А

source: X Both Limit
uk: Обидві межі X

source: Y Both Limit
uk: Y Обидві ліміт

source: Z Both Limit
uk: Z Обидві ліміт

source: A Both Limit
uk: А Обидві ліміт

source: All Limits
uk: Усі ліміти

source: X2 Minimum Limit
uk: Мінімальний ліміт X2

source: Y2 Minimum Limit
uk: Мінімальний ліміт Y

source: Z2 Minimum Limit
uk: Мінімальна ліміт Z2

source: A2 Minimum Limit
uk: Мінімальний ліміт A2

source: X2 Maximum Limit
uk: Максимальний ліміт X2

source: Y2 Maximum Limit
uk: Максимальний ліміт Y2

source: Z2 Maximum Limit
uk: Максимальна межа Z2

source: A2 Maximum Limit
uk: Максимальний ліміт A2

source: X2 Both Limit
uk: X2 Обидва ліміти

source: Y2 Both Limit
uk: Y2 Обидва ліміти

source: Z2 Both Limit
uk: Z2 Обидві межі

source: A2 Both Limit
uk: A2 Обидва ліміти

source: Main Axis
uk: Головна вісь

source: Tandem Axis
uk: Тандемна вісь

source: Reverse
uk: Зворотний

source: Arc OK
uk: Дуга в порядку

source: Ohmic Contact
uk: Омічний контакт

source: Float Switch
uk: Поплавковий вимикач

source: Breakaway
uk: Відрив

source: Move Up
uk: Перемістити вгору

source: Unused Input
uk: Невикористаний вхід

source: Limits
uk: Ліміти

source: Limits/Home Shared
uk: Обмеження/Спільний доступ до дому

source: Digital
uk: Цифровий

source: Axis Selection
uk: Вибір осі

source: Overrides
uk: Перевизначення

source: Operation
uk: Операція

source: External Control
uk: Зовнішній контроль

source: Axis rapid
uk: Швидка ось

source: X BLDC Control
uk: X BLDC КОНТРОЛЬ

source: Y BLDC Control
uk: Y BLDC КОНТРОЛЬ

source: Z BLDC Control
uk: Z BLDC КОНТРОЛЬ

source: A BLDC Control
uk: A BLDC КОНТРОЛЬ

source: S BLDC Control
uk: S BLDC КОНТРОЛЬ

source: Plasma
uk: Плазма

source: Custom Signals
uk: Спеціальні сигнали

source: X2 Tandem PWM
uk: X2 Тандем PWM

source: Y2 Tandem PWM
uk: Y2 Тандем PWM

source: Z2 Tandem PWM
uk: Z2 Тандем PWM

source: A2 Tandem PWM
uk: A2 Тандем PWM

source: X Axis PWM
uk: X Вісь PWM

source: Y Axis PWM
uk: Y Вісь PWM

source: Z Axis PWM
uk: Z Вісь PWM

source: A Axis PWM
uk: A Вісь PWM

source: Unused PWM Gen
uk: Невикористаний PWM-генератор

source: Axis PWM
uk: Вісь PWM

source: X Axis StepGen
uk: Покроковий генератор осі X

source: Y Axis StepGen
uk: Покроковий генератор осі Y

source: Z Axis StepGen
uk: Покроковий генератор осі Z

source: A Axis StepGen
uk: Axis StepGen

source: X2 Tandem StepGen
uk: X2 Тандем StepGen

source: Y2 Tandem StepGen
uk: Y2 Тандем StepGen

source: Z2 Tandem StepGen
uk: Z2 Тандем StepGen

source: Unused StepGen
uk: Невикористаний StepGen

source: Charge Pump StepGen
uk: Зарядний насос StepGen

source: Spindle StepGen
uk: Шпиндель StepGen

source: X Encoder
uk: X Енкодер

source: Y Encoder
uk: Y Енкодер

source: Z Encoder
uk: Z Енкодер

source: A Encoder
uk: A Енкодер

source: X2 Tandem Encoder
uk: Тандемний енкодер X2

source: Y2 Tandem Encoder
uk: Тандемний енкодер Y2

source: Z2 Tandem Encoder
uk: Тандемний енкодер Z2

source: A2 Tandem Encoder
uk: Тандемний енкодер A2

source: X Hand Wheel
uk: Маховик X

source: Y Hand Wheel
uk: Маховик Y

source: Z Hand Wheel
uk: Маховик Z

source: A Hand Wheel
uk: Маховик А

source: Multi Hand Wheel
uk: Багаторучне колесо

source: Feed Override
uk: Перевизначення каналу

source: spindle Override
uk: Коригування шпинделя

source: Max Vel Override
uk: Макс. свердловинне перевизначення

source: Arc Voltage
uk: Напруга дуги

source: Unused Encoder
uk: Невикористаний кодер

source: Axis Encoder
uk: Осевий енкодер

source: Spindle Encoder
uk: Шпиндельний енкодер

source: MPG Jog Controls
uk: Елементи керування бігом MPG

source: Override MPG control
uk: Перевизначити контроль MPG

source: Plasma Encoder
uk: Плазмовий енкодер

source: Unused Unused
uk: Невикористаний Невикористаний

source: Spindle Enable
uk: Увімкнення шпинделя

source: Machine Is Enabled
uk: Машина ввімкнена

source: X Amplifier Enable
uk: Увімкнення підсилювача X

source: Y Amplifier Enable
uk: Увімкнення підсилювача Y

source: Z Amplifier Enable
uk: Увімкнення підсилювача Z

source: A Amplifier Enable
uk: Увімкнення підсилювача А

source: Force Pin True
uk: Примусове закріплення True

source: Ohmic Enable
uk: Омічне увімкнення

source: Scribe Arm
uk: Рука писаря

source: Scribe On
uk: Писати далі

source: Torch On
uk: Ліхтарик увімкнено

source: Laser On
uk: Лазер увімкнено

source: Unused Output
uk: Невикористаний вихід

source: Coolant
uk: Охолоджувальна рідина

source: Control
uk: Контроль

source: S BLDC Control
uk: S BLDC Контроль

source: Unused 8I20
uk: Невикористаний 8I20

source: Unused Resolver
uk: Невикористаний резольвер

source: X Resolver
uk: X-резольвер

source: Y Resolver
uk: Y-резольвер

source: Z Resolver
uk: Z-резольвер

source: A Resolver
uk: A-резольвер

source: S Resolver
uk: S-резольвер

source: Unused Analog Output
uk: Невикористаний аналоговий вихід

source: Spindle Output
uk: Вихід шпинделя

source: Unused TPPWM Gen
uk: Невикористаний TPPWM Gen

source: X Axis BL Driver
uk: Драйвер BL для осі X

source: Y Axis BL Driver
uk: Драйвер BL осі Y

source: Z Axis BL Driver
uk: Драйвер BL осі Z

source: A Axis BL Driver
uk: Драйвер Axis BL

source: S Axis BL Driver
uk: Драйвер BL для осі S

source: 8i20 Amplifier Card
uk: Плата підсилювача 8i20

source: 7i64 I/O Card
uk: Плата вводу/виводу 7i64

source: 7i69 I/O Card
uk: Плата вводу/виводу 7i69

source: 7i70 I/O Card
uk: Плата вводу/виводу 7i70

source: 7i71 I/O Card
uk: Плата вводу/виводу 7i71

source: 7i76 Mode 0 I/O Card
uk: Плата вводу/виводу 7i76 режиму 0

source: 7i76 Mode 2 I/O Card
uk: Плата вводу/виводу 7i76 режиму 2

source: 7i77 Mode 0 I/O Card
uk: Плата вводу/виводу 7i77 режиму 0

source: 7i77 Mode 3 I/O Card
uk: Плата вводу/виводу 7i77 режиму 3

source: 7i73 Mode 1 Pendant Card
uk: Підвісна картка режиму 1 7i73

source: 7i84 Mode 1 I/O Card
uk: Плата вводу/виводу 7i84 режиму 1

source: 7i84 Mode 3 I/O Card
uk: Плата вводу/виводу 7i84 режиму 3

source: Unused Analog In
uk: Невикористаний аналоговий вхід

source: 7i64-Input P3 and P4
uk: 7i64-Вхід P3 та P4

source: 7i64-Output P2 and P5
uk: 7i64-Вихід P2 та P5

source: 7i64-Analog In
uk: 7i64-Аналоговий вхід

source: 7i70-Input TB3
uk: 7i70-Вхід TB3

source: 7i70-Input TB2
uk: 7i70-Вхід TB2

source: 7i71-Output TB3
uk: 7i71-Вихід TB3

source: 7i71-Output TB2
uk: 7i71-Вихід TB2

source: 7i76-Analog Output TB4
uk: 7i76-Аналоговий вихід TB4

source: 7i77-Analog Output TB5
uk: 7i77-Аналоговий вихід TB5

source: OK to replace existing custom pyvcp panel and custom_postgui.hal file ? Existing custompanel.xml and custom_postgui.hal will be renamed custompanel_backup.xml and postgui_backup.hal. Any existing file named custompanel_backup.xml and custom_postgui.hal will be lost.
uk: Чи можна замінити існуючі файли custom pyvcp panel та custom_postgui.hal? Існуючі файли custompanel.xml та custom_postgui.hal будуть перейменовані на custompanel_backup.xml та postgui_backup.hal. Будь-які існуючі файли з іменами custompanel_backup.xml та custom_postgui.hal будуть втрачені.

source: Quit PNCconf and discard changes?
uk: Вийти з PNCconf та скасувати зміни?

source: Do you want to quit?
uk: Хочеш кинути?

source: Ok to replace AXIS's .axisrc file? If you haven't added custom commands to this hidden file, outside of pncconf, then this should be fine. Choosing no will mean AXIS options such as size/position and force maximum might not be as requested
uk: Чи можна замінити файл .axisrc AXIS? Якщо ви не додавали власні команди до цього прихованого файлу, окрім pncconf, то це не повинно бути проблемою. Вибір «Ні» означатиме, що опції AXIS, такі як розмір/позиція та максимальна сила, можуть не відповідати вашим вимогам.

source: You specified there is an existing gladefile, But there is not one in the machine-named folder..
uk: Ви вказали, що існує gladefile, але в папці з назвою машини його немає.

source: ± = move on both sides of start position + = move on positive side of start position - = move on negative side of start position
uk: ± = переміщення з обох боків від початкової позиції + = переміщення з позитивної сторони від початкової позиції - = переміщення з негативної сторони від початкової позиції

source: Servo tuning is not tested in PNCconf yet
uk: Налаштування сервоприводу ще не протестовано в PNCconf

source: degrees
uk: ступені

source: degrees / minute
uk: градусів/хвилину

source: degrees / second²
uk: градусів / секунду²

source: revolutions
uk: революції

source: revs / second²
uk: обертів/секунда²

source: mm / minute
uk: мм/хвилину

source: mm / second²
uk: мм/секунда²

source: inches / minute
uk: дюйми/хвилину

source: inches / second²
uk: дюйми/секунда²

source: %s Axis Tune
uk: %s Налаштування осі

source: You must designate a ENCODER / RESOLVER signal and an ANALOG SPINDLE signal for this axis test
uk: Для цього тесту осі необхідно призначити сигнал ЕНКОДЕРА/РЕЗОЛЬВЕРА та сигнал АНАЛОГОВОГО ШПИНДЕЛЯ

source: You must designate a ENCODER / RESOLVER signal and a PWM signal for this axis test
uk: Для цього тесту осі необхідно призначити сигнал ЕНКОДЕРА/РЕЗОЛЬВЕРА та сигнал PWM

source: Do to technical reasons this test panel can be loaded only once without reloading pncconf.You also will not be able to do any other testing until you reload pncconf and quite possibly open a terminal and type 'halrun -U' I hesitate to even allow it's use but at times it's very useful. Do you wish to continue the test?
uk: З технічних причин цю тестову панель можна завантажити тільки один раз без перезавантаження pncconf. Ви також не зможете виконувати будь-які інші тести, поки не перезавантажите pncconf і, ймовірно, не відкриєте термінал і не введете 'halrun -U'. Я навіть вагаюся, чи дозволяти її використання, але іноді вона дуже корисна. Чи бажаєте ви продовжити тест?

source: This configuration was saved with an earlier version of pncconf which may be incompatible. If it doesn't plainly cause an error, you still may want to save it with another name and check it. Safer to start from scratch. If you have a REALLY large config that you wish to convert to this newer version of PNConf - ask on the LinuxCNC forum - it may be possible..
uk: Ця конфігурація була збережена за допомогою попередньої версії pncconf, яка може бути несумісною. Якщо це не викликає явної помилки, ви все одно можете зберегти її під іншою назвою і перевірити. Безпечніше почати з нуля. Якщо у вас є ДУЖЕ велика конфігурація, яку ви хочете перетворити на цю нову версію PNConf, запитайте на форумі LinuxCNC — можливо, це можливо.

source: File %r was modified since it was written by PNCconf
uk: Файл %r було змінено з моменту його створення PNCconf

source: Saving this configuration file will discard configuration changes made outside PNCconf.
uk: Збереження цього файлу конфігурації призведе до скасування змін конфігурації, внесених поза межами PNCconf.

source: Continue? (y/n)
uk: Продовжити? (Так/Ні)

source: Desktop Launcher for LinuxCNC config made by PNCconf
uk: Програма запуску робочого столу для LinuxCNC конфігурації, створена PNCconf

source: PNCconf - Mesa Card Configuration Wizard
uk: PNCconf — Майстер налаштування картки Mesa

source: Save Data
uk: Зберегти Дані

source: This program creates configuration files (INI and HAL) for milling machines and lathes connected to a Mesa Card. It is a recommended strategy to start with very basic axes options, get them functional then go back and add other options such as VFD spindle control or advanced limit/home control etc.
uk: Ця програма створює конфігураційні файли (INI та HAL) для фрезерних верстатів та токарних верстатів, підключених до плати Mesa Card. Рекомендується почати з найпростіших опцій осей, налагодити їх роботу, а потім повернутися і додати інші опції, такі як управління шпинделем VFD або розширене управління межами/початковим положенням тощо.

source: page 1
uk: сторінка 1

source: PNCconf - Point aNd Click CONFigurator PNCconf is a configuration program for Linuxcnc. It configures machines using Mesa I/O cards. It configures servo,stepper or closed loop stepper machines. It supports some of Mesa's sserial cards. It will forever be a work in progress as Linuxcnc changes. Many thanks To: Jeff Eppler - PNCconf is based on stepconf - Jeff's creation. Jeff also has helped with technical difficulties. Big John T - John drew the original machine illustrations. Testing and suggestions. Peter Wallace - Technical questions on Mesa's I/O cards. Supplied sample equipment to test with. Andy Pugh - suggestions, questions answered and many pin name changes :) Dave Armstrong - testing and suggestions especially with resolvers. Everyone who gave a bug report ! I cannot test everything thoughly enough so reports help. Beta 1 version
uk: PNCconf - Point aNd Click CONFigurator PNCconf - це програма конфігурації для Linuxcnc. Вона конфігурує машини, що використовують плати вводу-виводу Mesa. Вона конфігурує серво-, крокові або крокові машини із замкнутим контуром. Вона підтримує деякі серійні плати Mesa. Вона завжди буде перебувати в процесі розробки, оскільки Linuxcnc постійно змінюється. Велика подяка: Джеф Епплер — PNCconf базується на stepconf — творінні Джефа. Джеф також допомагав у вирішенні технічних проблем. Біг Джону Т — Джон намалював оригінальні ілюстрації машин. Тестування та пропозиції. Пітеру Воллесу — технічні питання щодо карт вводу-виводу Mesa. Надав зразки обладнання для тестування. Енді Пью — пропозиції, відповіді на питання та багато змін назв контактів :) Дейву Армстронгу — тестування та пропозиції, особливо щодо резольверів. Всім, хто повідомив про помилки! Я не можу все ретельно протестувати, тому повідомлення про помилки дуже допомагають. Версія Beta 1
