Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: Use +- voltage for direction
uk: Використовуйте напругу +/- для напрямку

source: Range 1 Max RPM:
uk: Діапазон 1 Макс. обертів за хвилину:

source: Range 2 Max RPM
uk: Діапазон 2 Макс. RPM

source: Output Voltage Info
uk: Інформація про вихідну напругу

source: Slave number:
uk: Номер раба:

source: Serial Spindle VFD Info
uk: Інформація про серійний частотний перетворювач шпинделя

source: Use At-Speed Calculation
uk: Використовуйте розрахунок на швидкості

source: Spindle Display Filter:
uk: Фільтр відображення шпинделя:

source: Use Near Range
uk: Використовувати ближню дальність

source: Use Near Scale
uk: Використовувати близький масштаб

source: Include Halui user interface component / commands
uk: Включити компонент/команди інтерфейсу користувача Halui

source: Number of digital (bit) in pins:
uk: Кількість цифрових (бітних) значень на контактах:

source: Number of digital (bit) out pins:
uk: Кількість цифрових (бітових) вихідних контактів:

source: Number of Internal bit memory:
uk: Кількість внутрішньої бітової пам'яті:

source: Number of Internal word memory:
uk: Кількість слів у внутрішній пам'яті:

source: Setup number of external pins
uk: Налаштування кількості зовнішніх контактів

source: Z Auto Touch off program
uk: Програма автоматичного вимкнення сенсорного керування Z

source: Add HAL components with this page.
uk: Додайте компоненти HAL за допомогою цієї сторінки.

source: <b>Component</b>
uk: <b>Компонент</b>

source: <b>number of components</b>
uk: <b>кількість компонентів</b>

source: scale
uk: масштаб

source: lowpass
uk: низькочастотний

source: Base Thread
uk: Базова нитка

source: Servo Thread
uk: Серворіз

source: Load Command
uk: Команда завантаження

source: Thread Speed
uk: Швидкість потоку

source: Thread Command
uk: Команда потоку

source: <b>Custom Components Commands</b>
uk: <b>Команди користувацьких компонентів</b>

source: Pin 2:
uk: Закріпити 2:

source: Pin 3:
uk: Закріпити 3:

source: Pin 4:
uk: Закріпити 4:

source: Pin 5:
uk: Закріпити 5:

source: Pin 6:
uk: Закріпити 6:

source: Pin 7:
uk: Закріпити 7:

source: Pin 8:
uk: Закріпити 8:

source: Pin 9:
uk: Закріпити 9:

source: Pin _1:
uk: Закріпити _1:

source: Pin _2:
uk: Закріпити _2:

source: Pin _3:
uk: Закріпити _3:

source: Pin _4:
uk: Закріпити _4:

source: Pin _5:
uk: Закріпити _5:

source: Pin _6:
uk: Закріпити _6:

source: Pin _7:
uk: Закріпити _7:

source: Pin _8:
uk: Закріпити _8:

source: Pin _9:
uk: Закріпити _9:

source: Add-on PCI Parport Address Search
uk: Додатковий PCI Parport Адреса Пошук

source: Launch Test Panel
uk: Запуск тестової панелі

source: Parallel Port
uk: Паралельний порт

source: Interface type:
uk: Тип інтерфейсу:

source: Pncconf will try to discover the board connected to the system. Please select the appropriate settings. Field power should be connected to detect all pins.
uk: Pncconf спробує виявити плату, підключену до системи. Будь ласка, виберіть відповідні налаштування. Щоб виявити всі контакти, необхідно підключити польове живлення.

source: Ethernet Address:
uk: Адреса Ethernet:

source: Card Name:
uk: Назва картки:

source: Read hostmot2 PIN file From help's input tab
uk: Зчитати PIN-файл hostmot2 з вкладки введення довідки

source: Mesa Board Discovery<
uk: Відкриття Mesa Board<

source: Parallel Port -7i43
uk: Паралельний порт -7i43

source: Parallel Port- 7i90
uk: Паралельний порт- 7i90

source: Number of connectors:
uk: Кількість роз'ємів:

source: Number of pins per connector:
uk: Кількість контактів на роз'єм:

source: Pncconf doesn't recognize the board name. Please set the data and press ok
uk: Pncconf не розпізнає назву плати. Будь ласка, вкажіть дані та натисніть OK

source: Save & Quit
uk: Зберегти та вийти

source: Save entered data and quit or discard changes and quit?
uk: Зберегти введені дані та вийти чи скасувати зміни та вийти?

source: <b> Motor Encoder Openloop Test Warning limits switches Will not be obeyed</b>
uk: <b> Тест відкритого контуру енкодера двигуна Перемикачі меж попередження Не будуть дотримуватися</b>

source: Slow Dac Speed
uk: Повільна швидкість ЦАП

source: Fast Dac Speed
uk: Висока швидкість ЦАП

source: Dac Offset:
uk: Зсув ЦАП:

source: Encoder Scale:
uk: Шкала енкодера:

source: Reset Encoder
uk: Скинути кодер

source: Enable Amp
uk: Увімкнути підсилювач

source: Invert Encoder
uk: Інвертувати енкодер

source: Invert Motor
uk: Інвертний двигун

source: Pulley teeth (motor:gearbox):
uk: Зубці шківа (двигун:коробка передач):

source: Gear ratio 1 (Input:Output)
uk: Передавальне число 1 (Input:Output)

source: Microstep Multiplication Factor:
uk: Коефіцієнт множення мікрокроку:

source: Motor steps per revolution:
uk: Кроки двигуна за оберт:

source: Voltage for Max RPM:
uk: Напруга для Макс RPM:

source: Use Negative voltage for reverse:
uk: Використовуйте негативну напругу для зворотного ходу:

source: Gear ratio 2 (Input:Output)
uk: Передавальне число 2 (Input:Output)

source: <b>MOTOR</b> RPM at Max Voltage
uk: <b>МОТОР</b> RPM при максимальній напрузі

source: <b>Spindle Drive Motor</b>
uk: <b>Шпиндельний привідний двигун</b>

source: X 4 = Pulses/Rev
uk: X 4 = Імпульси/оберт

source: Encoder lines per revolution:
uk: Кількість ліній енкодера на оберт:

source: <b>Encoder Scale</b>
uk: <b>Шкала енкодера</b>

source: Spindle RPM at Max Motor Speed -gear 1:
uk: RPM шпинделя при максимальній швидкості двигуна - передача 1:

source: Spindle RPM at Max Motor Speed -gear 2:
uk: RPM шпинделя при максимальній швидкості двигуна - передача 2:

source: <b>Motion Data</b>
uk: <b>Дані руху</b>

source: Pulley teeth (motor:Leadscrew):
uk: Зубці шківа (motor:Leadscrew):

source: Worm turn ratio (Input:Outputl)
uk: Коефіцієнт витків черв'яка (Input:Outputl)

source: Leadscrew Metric Pitch
uk: Крок метричного гвинта

source: <b>Step Motor Scale</b>
uk: <b>Шкала крокового двигуна</b>

source: Pulley teeth (encoder:Leadscrew):
uk: Зубці шківа (encoder:Leadscrew):

source: encoder pulses per unit:
uk: імпульсів енкодера на одиницю:

source: motor steps per unit:
uk: кроки двигуна на одиницю:

source: <b>Calculated Scale</b>
uk: <b>Розрахунковий масштаб</b>

source: mm / encoder pulse
uk: мм / імпульс енкодера

source: Resolution:
uk: Роздільна здатність:

source: sec
uk: сек

source: Calculated Axis SCALE:
uk: Розрахункова МАСШТАБНА ОСЬ:

source: Motor RPM at max speed:
uk: RPM двигуна на максимальній швидкості:

source: Seconds
uk: Секунди

source: Enable
uk: Увімкнути

source: mm/minute^2
uk: мм/хвилину^2

source: mm/minute
uk: мм/хвилину

source: Current
uk: Поточний

source: Original
uk: Оригінал

source: DeadBand
uk: Мертва зона

source: PID Tuning
uk: Налаштування PID-регулятора

source: Step Time:
uk: Час кроку:

source: Step Space:
uk: Простір для кроків:

source: Direction Hold:
uk: Утримання напрямку:

source: Direction Setup:
uk: Налаштування напрямку:

source: Step Timing
uk: Час кроку

source: All the necessary info has now been gathered. Click "Done" to write your configuration files to disk. If you experience lockups while running LinuxCNC: -Decrease the maximum velocity which will have the effect of increasing BASE_PERIOD. If you experience lost steps while running LinuxCNC: -First verify that you entered the proper timings for your stepper drivers. -Then run a more thorough latency test as described on the linuxcnc.org wiki. https://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting If you experience the "Unexpected Realtime Delay" message: -Run a more thorough latency test as described on the linuxcnc.org wiki: https://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting
uk: Вся необхідна інформація зібрана. Натисніть «Готово», щоб записати файли конфігурації на диск. Якщо під час роботи LinuxCNC виникають зависання: -Зменште максимальну швидкість, що призведе до збільшення BASE_PERIOD. Якщо під час роботи LinuxCNC ви відчуваєте втрату кроків: -Спочатку переконайтеся, що ви ввели правильні часові параметри для ваших крокових драйверів. -Потім виконайте більш ретельний тест затримки, як описано на вікі-сторінці linuxcnc.org. https://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting Якщо з'являється повідомлення «Unexpected Realtime Delay» (Несподівана затримка в реальному часі): -Виконайте більш ретельний тест затримки, як описано на вікі-сайті linuxcnc.org: https://wiki.linuxcnc.org/cgi-bin/wiki.pl?TroubleShooting

source: Desktop notifications are available
uk: Сповіщення на робочому столі доступні

source: Desktop notifications are not available
uk: Сповіщення на робочому столі недоступні

source: There was a problem initializing the notification module
uk: Виникла проблема з ініціалізацією модуля сповіщень

source: Audio alerts are available!
uk: Доступні звукові сповіщення!

source: No audio alerts are available - Is gir1.2-gstreamer-1.0 package installed?
uk: Звукові сповіщення недоступні. Чи встановлено пакет gir1.2-gstreamer-1.0?

source: No widget '{}'
uk: Без віджета '{}'

source: Manual Mode
uk: Ручний режим

source: MDI Mode
uk: MDI Режим

source: Auto Mode
uk: Автоматичний режим

source: Adding import dir {}
uk: Додавання каталогу імпорту {}

source: Module '{}' skipped - import error: {}
uk: Модуль '{}' пропущено – помилка імпорту: {}

source: Module '{}' imported OK
uk: Модуль '{}' імпортовано нормально

source: Module '{}': '{}' function found
uk: Модуль '{}': знайдено функцію '{}'

source: Module '{}': no '{}' function - registering only functions as callbacks
uk: Модуль '{}': немає функції '{}' - реєстрація лише функцій як зворотних викликів

source: Registering handlers in module '{}' object '{}'
uk: Реєстрація обробників у модулі '{}' об'єкта '{}'

source: Trouble looking for handlers in '{}': {}
uk: Проблема з пошуком обробників у '{}': {}

source: Skin name = {}
uk: Назва скіна = {}

source: INI file path missing from Gscreen launch command
uk: Шлях до INI-файлу відсутній у команді запуску Gscreen

source: Custom locale name = {}
uk: Назва користувацького мовного коду = {}

source: Skin locale name = {}
uk: Назва локалізації скіна = {}

source: Using custom glade file from {}
uk: Використання власного Glade-файлу з {}

source: Using skin glade file from {}
uk: Використання файлу skin glade з {}

source: Using stock glade file from: {}
uk: Використовується стоковий файл Glade з: {}

source: With main screen xml file: {}
uk: З головним екраном xml-файлу: {}

source: Screen 2 - Using custom glade file from {}
uk: Екран 2 – Використання власного файлу glade з {}

source: Error with screen 2's xml file: {}
uk: Помилка з XML-файлом екрана 2: {}

source: No Screen 2 glade file present
uk: Немає файлу Screen 2 Glade

source: Audio test failed - Is gstreamer0.10-plugins-base installed?
uk: Тест аудіо не вдався – чи встановлено gstreamer0.10-plugins-base?

source: No coordinates entry found in [TRAJ] of INI file
uk: У файлі INI [TRAJ] не знайдено записів координат

source: No UNITS entry found in [TRAJ] or [AXIS_X] of INI file
uk: Не знайдено записів UNITS у [TRAJ] або [AXIS_X] INI-файлу

source: Asking for a HAL component using a name that already exists
uk: Запит компонента HAL з використанням імені, яке вже існує

source: Handler file path: {}
uk: Шлях до файлу обробника: {}

source: Preference file path: {}
uk: Шлях до файлу налаштувань: {}

source: No default jog increments entry found in [DISPLAY] of INI file
uk: У файлі INI [DISPLAY] не знайдено запису про кроки поштовху за замовчуванням

source: No default angular jog increments entry found in [DISPLAY] of INI file
uk: У файлі INI [DISPLAY] не знайдено запису про кутові кроки похибки за замовчуванням

source: No DEFAULT_LINEAR_VELOCITY entry found in [DISPLAY] of INI file: using internal default of %s
uk: У файлі INI [DISPLAY] не знайдено запису DEFAULT_LINEAR_VELOCITY: використовується внутрішній параметр за замовчуванням %s

source: No MAX_LINEAR_VELOCITY entry found in [DISPLAY] of INI file: using internal default of %s
uk: У файлі INI [DISPLAY] не знайдено запису MAX_LINEAR_VELOCITY: використовується внутрішній параметр за замовчуванням %s

source: No MAX_LINEAR_VELOCITY found in [TRAJ] of the INI file
uk: У [TRAJ] INI-файлу не знайдено значення MAX_LINEAR_VELOCITY

source: No DEFAULT_ANGULAR_VELOCITY entry found in [DISPLAY] of INI file: using internal default of %s
uk: У файлі INI [DISPLAY] не знайдено запису DEFAULT_ANGULAR_VELOCITY: використовується внутрішнє значення за замовчуванням %s

source: No MAX_ANGULAR_VELOCITY entry found in [DISPLAY] of INI file: using internal default of %s
uk: У файлі INI [DISPLAY] не знайдено запису MAX_ANGULAR_VELOCITY: використовується внутрішнє значення за замовчуванням %s

source: No MAX_SPINDLE_OVERRIDE entry found in [DISPLAY] of INI file
uk: У файлі INI [DISPLAY] не знайдено запису MAX_SPINDLE_OVERRIDE

source: No MIN_SPINDLE_OVERRIDE entry found in [DISPLAY] of INI file
uk: У файлі INI [DISPLAY] не знайдено запису MIN_SPINDLE_OVERRIDE

source: No MAX_FEED_OVERRIDE entry found in [DISPLAY] of INI file
uk: У файлі INI [DISPLAY] не знайдено запису MAX_FEED_OVERRIDE

source: This screen will be orientated for Lathe options
uk: Цей екран буде орієнтований на опції токарного верстата

source: CYCLE_TIME in [DISPLAY] of INI file is missing: defaulting to 100ms
uk: CYCLE_TIME у [DISPLAY] INI-файлу відсутній: за замовчуванням встановлено значення 100 мс

source: CYCLE_TIME in [DISPLAY] of INI file is too small: defaulting to 100ms
uk: CYCLE_TIME у [DISPLAY] INI-файлу занадто малий: за замовчуванням встановлено значення 100 мс

source: Ready For Homing
uk: Готовий до повернення

source: Could not initialize Vte terminal: Is libvte-2.91-0 package installed? Is a 'terminal_window' widget in the GLADE file?
uk: Не вдалося ініціалізувати термінал Vte: Чи встановлено пакет libvte-2.91-0? Чи є віджет «terminal_window» у файлі GLADE?

source: Exception while writing to terminal: {}
uk: Виняток під час запису в термінал: {}

source: Local Config Theme
uk: Тема локальної конфігурації

source: Window size is fullscreen
uk: Розмір вікна — повноекранний

source: Window size is maximized
uk: Розмір вікна збільшено до максимуму

source: Window size set to {}x{}
uk: Розмір вікна встановлено на {}x{}

source: Invalid window size specified '{}', defaulted to {}x{}
uk: Вказано недійсний розмір вікна '{}', за замовчуванням встановлено значення {}x{}

source: Using default window size: {}x{}
uk: Використовується розмір вікна за замовчуванням: {}x{}

source: Control powered up and initialized
uk: Контроль увімкнено та ініціалізовано

source: Unlock code #{}
uk: Код розблокування №{}

source: Key {} ({}) was pressed state: {} last: {}
uk: Клавіша {} ({}) була натиснута стан: {} останнє натискання: {}

source: Control was being held down
uk: Контроль був послаблений

source: Alt was being held down
uk: Альт був притиснутий

source: Shift was being held down
uk: Shift було натиснуто

source: Cycle start pressed in AUTO mode
uk: Натиснуто кнопку запуску циклу в автоматичному режимі

source: Cycle start pressed in MDI mode
uk: Натиснуто кнопку MDI в режимі ручного введення даних

source: Please change to tool # %s, then click OK.
uk: Будь ласка, змініть інструмент на %s, а потім натисніть кнопку «ОК».

source: INFO:
uk: ІНФОРМАЦІЯ:

source: Can't start spindle manually while MDI busy
uk: Неможливо запустити шпиндель вручну, коли MDI зайнятий

source: can't start spindle manually in Auto mode
uk: Не вдається запустити шпиндель вручну в автоматичному режимі

source: No direction selected for spindle
uk: Напрямок для шпинделя не вибрано

source: Spindle Speed Preset Entry
uk: Введення попереднього значення швидкості шпинделя

source: Manual Tool Index Entry
uk: Ручне введення індексу інструментів

source: Entry dialog
uk: Діалогове вікно введення

source: Classicladder realtime component not detected
uk: Компонент Classicladder у реальному часі не виявлено

source: ladder not available - is the realtime component loaded?
uk: Лейдер недоступний - чи завантажено компонент реального часу?

source: Estopping and killing gscreen
uk: Зупинка та завершення роботи gscreen

source: Override Entry
uk: Заміна запису

source: Machine powered on
uk: Машина увімкнена

source: Machine Estopped!
uk: Машина зупинена!

source: Calculator
uk: Калькулятор

source: Axes %s are homed
uk: Осі %s повернуті в початкове положення

source: All the axes have been homed
uk: Усі сокири приведені в головне положення

source: There are unhomed axes: %s
uk: Є невідведені осі: %s

source: Program loaded: %s
uk: Програма завантажена: %s

source: Cannot set focus to hal_mdihistory when Onboard launched - Is this widget name in glade file?
uk: Не вдається встановити фокус на hal_mdihistory під час запуску Onboard - Чи є ця назва віджета у файлі glade?

source: Cannot set focus to gcode_view when Onboard launched - Is this widget name in glade file?
uk: Не вдається встановити фокус на gcode_view під час запуску Onboard - Чи є ця назва віджета у файлі glade?

source: Manual Spindle Control
uk: Ручне керування шпинделем

source: Error with launching on-screen keyboard program - cannot find program
uk: Помилка запуску програми екранної клавіатури - не вдається знайти програму

source: Keyboard
uk: Клавіатура

source: Error with launching 'Onboard' on-screen keyboard program {}
uk: Помилка запуску програми екранної клавіатури «Onboard» {}

source: Overriding internal signal call to '{}'
uk: Перевизначення внутрішнього виклику сигналу для '{}'

source: Could not connect '{}' to '{}'
uk: Не вдалося підключити '{}' до '{}'

source: No widget named '{}' to sensitize
uk: Немає віджета з назвою '{}' для сенсибілізації

source: Zero
uk: Нуль

source: Set At
uk: Встановити на

source: Zero Origin
uk: Нульове походження

source: Offset Origin
uk: Зміщення початку координат

source: Invalid message configuration (missing text or type) in INI File [DISPLAY] section
uk: Недійсна конфігурація повідомлення (відсутній текст або тип) у розділі INI-файлу [DISPLAY]

source: Invalid message configuration (missing pinname) in INI File [DISPLAY] section
uk: Недійсна конфігурація повідомлення (відсутнє ім'я PIN-коду) у розділі INI-файлу [DISPLAY]

source: Invalid message configuration (missing boldtext) in INI File [DISPLAY] section
uk: Недійсна конфігурація повідомлення (відсутній жирний текст) у розділі INI-файлу [DISPLAY]

source: Invalid message type ({})in INI File [DISPLAY] section
uk: Недійсний тип повідомлення ({}) у розділі INI-файлу [DISPLAY]

source: Dialog error - Is the dialog handler missing from the handler file?
uk: Помилка діалогу – чи відсутній обробник діалогу у файлі обробника?

source: Manual Toolchange
uk: Ручна зміна інструменту

source: Operator Message
uk: Повідомлення оператора

source: Restart Entry
uk: Перезавантажити вхід

source: _Up
uk: _Вгору

source: _Down
uk: _Вниз

source: _Jump to
uk: Перейти до

source: Ready to Restart program from line %d
uk: Готово до перезапуску програми з рядка %d

source: Invalid embedded tab configuration
uk: Недійсна конфігурація вбудованої вкладки

source: Can't jog multiple axis
uk: Неможливо виконати штовхання за кількома осями

source: No axis selected to jog
uk: Не вибрано вісь для штовхання

source: No axis selected to move
uk: Не вибрано вісь для переміщення

source: Can't home multiple axis - select HOME ALL instead
uk: Не вдається перевести кілька осей у вихідне положення – виберіть замість цього «ДОМУ ВСЕ»

source: No axis selected to home
uk: Вісь для дому не вибрано

source: Can't unhome multiple axis
uk: Не вдається зняти з початкового положення кілька осей

source: No axis selected to unhome
uk: Не вибрано жодної осі для зняття з початкового положення

source: No axis selected for origin zeroing
uk: Для обнулення початку координат не вибрано жодної осі

source: No axis selected for origin touch-off
uk: Не вибрано вісь для точки відліку початку координат

source: Can't tool touch-off multiple axes
uk: Неможливо виконати контакт інструменту по кількох осях

source: No axis selected for tool touch-off
uk: Не вибрано жодної осі для контакту інструмента

source: Error Message
uk: Повідомлення про помилку

source: Tool editor error - is the %s editor available?
uk: Помилка редактора інструментів – чи доступний редактор %s?

source: Message
uk: Повідомлення

source: Tool %(t)s %(l)s
uk: Інструмент %(t)s %(l)s

source: %4.2f mm/min
uk: %4.2f мм/хв

source: %(n)s View -%(v)s %(t)s
uk: %(n)s Перегляд -%(v)s %(t)s

source: mm
uk: мм

source: Postgui filename: {}
uk: Ім'я файлу Postgui: {}

source: Data Entry
uk: Введення даних

source: <b>Calculator Entry</b>
uk: <b>Вхід у калькулятор</b>

source: test
uk: тест

source: Program Restart
uk: Перезапуск програми

source: Highlighting the run-at-line with the up / down buttons or entering the line directly.
uk: Виділення рядка за допомогою кнопки вгору/вниз або введення рядка безпосередньо.

source: Line Up
uk: Лінія Вгору

source: Line Down
uk: Лінія вниз

source: G-code
uk: G-код

source: <b>Active Codes</b>
uk: <b>Активні коди</b>

source: Flood
uk: Повінь

source: At Speed
uk: На швидкості

source: Jog mode
uk: Режим права

source: <b>Status</b>
uk: <b>Статус</b>

source: Search Text:
uk: Пошук Текст:

source: Replace Text:
uk: Замінити Текст:

source: Replace All
uk: Замінити Усі

source: Ignore Case
uk: Ігнорувати Реєстр

source: <b>Mode</b>
uk: <b>Режим</b>

source: Main Level
uk: Головний рівень

source: Themes
uk: Теми

source: Relative Text Color
uk: Відносний колір тексту

source: DTG Text Color
uk: Колір тексту DTG

source: Warning Audio
uk: Звукове попередження

source: Alert Audio
uk: Звукове сповіщення

source: Grid Size
uk: Розмір сітки

source: Starting RPM
uk: Початок RPM

source: Metric
uk: Метрика

source: Display Aux Screen
uk: Дисплей Допоміжний екран

source: Diameter Mode
uk: Діаметр Режим

source: Show Offsets
uk: Показати Зміщення

source: Show DTG
uk: Показати DTG

source: Gscreen Fullscreen
uk: Gscreen Повноекранний режим

source: On M7 Use Aux Coolant
uk: На M7 Використовуйте Допоміжну охолоджувальну рідину

source: On M8 Use Aux Coolant
uk: На M8 Використовуйте Допоміжну охолоджувальну рідину

source: Hide Pointer
uk: Приховати вказівник

source: Desktop Notification
uk: Сповіщення для робочого столу

source: Debug
uk: Налагодження

source: Alarm History
uk: Історія тривог

source: Launch Halshow
uk: Запуск Halshow

source: Calibration
uk: Калібрування

source: Halmeter
uk: Півметра

source: LinuxCNC Status
uk: LinuxCNC Статус

source: Halscope
uk: Галскоп

source: Tooleditor
uk: Редактор інструментів

source: Offset Page
uk: Зсув Сторінка

source: Unhome All
uk: Недодому Усі

source: Unhome Axis
uk: Недодомовна вісь

source: Toggle Readout
uk: Перемикач Зчитування

source: Jogging Mode
uk: Режим бігу

source: coordinate System
uk: Система координат

source: Index Tool
uk: Індекс Інструмент

source: Spindle Controls
uk: Шпиндель Елементи керування

source: Open
uk: Відкрити

source: Block Delete
uk: Блокувати Видалити

source: Optional Stop
uk: Необов'язково Зупинити

source: Full View
uk: Повний перегляд

source: Next Tab
uk: Далі Вкладка

source: Feed Override
uk: Перевизначення стрічки

source: Spindle Override
uk: Перевизначення шпинделя

source: Rapid Override
uk: Швидке перевизначення

source: Jog Speed
uk: Швидкість бігу

source: Jog Increments
uk: Пробіжка Збільшення

source: Adjust Rotary
uk: Регулювання Поворотний

source: Change View
uk: Змінити Переглянути

source: Pan Vertical
uk: Панорамування Вертикальне

source: Pan Horizontal
uk: Панорамування Горизонтальне

source: Rotate Horiontal
uk: Поворот Горизонтально

source: Rotate Vertical
uk: Повернути Вертикальний

source: Search Bwd
uk: Пошук Bwd

source: Search Fwd
uk: Пошук Переслати

source: Undo
uk: Відмінити

source: Redo
uk: Повторити

source: Reload Program
uk: Перезавантажити Програму

source: Replace Text
uk: Замінити текст

source: Clear status
uk: Очистити статус

source: calc
uk: калькуляція

source: Zero Origin
uk: Нульове походження
