Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: %d: duplicate O-word label - already defined in line %d: '%s'
uk: %d: дублікат мітки O-слова - вже визначено в рядку %d: '%s'

source: %d: undefined O-word label: '%s'
uk: %d: невизначена мітка слова на літеру О: '%s'

source: %d: no matching 'if' label: '%s' (found '%s' in line %d)
uk: %d: немає відповідної мітки 'if': '%s' (знайдено '%s' у рядку %d)

source: %d: no matching label: '%s' (found '%s' in line %d): '%s'
uk: %d: немає відповідної мітки: '%s' (знайдено '%s' у рядку %d): '%s'

source: %d: no matching while/do label: '%s' (found '%s' in line %d)
uk: %d: немає відповідної мітки while/do: '%s' (знайдено '%s' у рядку %d)

source: %d: no matching label: '%s' (found '%s' in line %d)
uk: %d: немає відповідної мітки: '%s' (знайдено '%s' у рядку %d)

source: Named parameter #<%s> not defined
uk: Іменований параметр #<%s> не визначено

source: can't open INI file '%s'
uk: Не вдається відкрити INI-файл '%s'

source: Named INI parameter #<%s> not found in INI file '%s': error=0x%x
uk: Іменований параметр INI #<%s> не знайдено у файлі INI '%s': помилка=0x%x

source: Internal error: Could not assign #<%s>
uk: Внутрішня помилка: Не вдалося призначити #<%s>

source: Cannot assign to read-only parameter #<%s>
uk: Неможливо призначити параметру лише для читання #<%s>

source: BUG: lookup_named_param(%s): unhandled index=%fn
uk: ПОМИЛКА: lookup_named_param(%s): необроблений індекс=%fn

source: Queue is not empty after tool change
uk: Черга не порожня після зміни інструменту

source: Unable to open parameter file: '%s'
uk: Не вдалося відкрити файл параметрів: '%s'

source: Parameter file name is missing
uk: Відсутнє ім'я файлу параметрів

source: A file is already open
uk: Файл вже відкрито

source: All axes missing with g52 or g92
uk: Всі осі відсутні при g52 або g92

source: All axes missing with motion code
uk: Усі осі відсутні в коді руху

source: Arc radius too small to reach end point
uk: Радіус дуги занадто малий для досягнення кінцевої точки

source: Argument to acos out of range
uk: Аргумент для acos поза діапазоном

source: Argument to asin out of range
uk: Аргумент до asin поза межами діапазону

source: Attempt to divide by zero
uk: Спроба поділити на нуль

source: Attempt to raise negative to non integer power
uk: Спроба піднесення від'ємного числа до нецілого степеня

source: Bad format unsigned integer
uk: Неправильний формат беззнакового цілого числа

source: Bad number format
uk: Неправильний формат числа

source: Bug bad g code modal group 0
uk: Помилка, поганий код G, модальна група 0

source: Bug code not g0 or g1
uk: Код помилки не g0 або g1

source: Bug code not g17 g18 or g19
uk: Код помилки не g17, g18 або g19

source: Bug code not g20 or g21
uk: Код помилки не g20 чи g21

source: Bug code not g28 or g30
uk: Код помилки не g28 або g30

source: Bug code not g2 or g3
uk: Код помилки не g2 або g3

source: Bug code not g4 g10 g28 g30 g52 g53 or g92 series
uk: Код помилки не g4 g10 g28 g30 g52 g53 або серія g92

source: Bug code not g61 g61.1 or g64
uk: Код помилки не g61, g61.1 або g64

source: Bug code not g90 or g91
uk: Код помилки не g90 або g91

source: Bug code not g98 or g99
uk: Код помилки не g98 або g99

source: Bug code not in g52 or g92 series
uk: Код помилки відсутній у серії g52 або g92

source: Bug code not in range g54 to g593
uk: Код помилки не входить до діапазону від g54 до g593

source: Bug code not m0 m1 m2 m30 m60 m99
uk: Код помилки не m0 m1 m2 m30 m60 m99

source: Bug distance mode not g90 or g91
uk: Режим дистанції до помилок не g90 чи g91

source: Bug function should not have been called
uk: Функцію помилки не слід було викликати

source: Bug in tool radius comp
uk: Помилка в компіляції радіуса інструменту

source: Bug plane not xy yz or xz
uk: Площина комах не xy yz або xz

source: Bug side not right or left
uk: Сторона з комахами не права чи ліва

source: Bug unknown motion code
uk: Код руху невідомої помилки

source: Bug unknown operation
uk: Помилка невідомої операції

source: Cannot change axis offsets with cutter radius comp
uk: Неможливо змінити зміщення осей за допомогою компенсації радіуса різця

source: Cannot create backup file
uk: Не вдається створити резервний файл

source: Cannot do g1 with zero feed rate
uk: Неможливо виконати g1 з нульовою швидкістю подачі

source: Cannot do zero repeats of cycle
uk: Неможливо виконати нульове повторення циклу

source: Cannot make arc with zero feed rate
uk: Неможливо створити дугу з нульовою швидкістю подачі

source: Cannot open backup file
uk: Не вдається відкрити файл резервної копії

source: Cannot open variable file
uk: Не вдається відкрити файл змінних

source: Cannot probe with cutter radius comp on
uk: Не вдається виконати вимірювання з увімкненою компенсацією радіуса різця

source: Cannot probe with zero feed rate
uk: Неможливо вимірювати з нульовою швидкістю подачі

source: Cannot put a b in canned cycle
uk: Неможливо помістити b у стандартний цикл

source: Cannot put a c in canned cycle
uk: Неможливо помістити літеру "c" у стандартний цикл

source: Cannot put an a in canned cycle
uk: Не можна помістити a у стандартний цикл

source: Cannot turn cutter radius comp on when on
uk: Неможливо ввімкнути компенсацію радіуса різця, коли вона увімкнена

source: Cannot use axis values with g80
uk: Неможливо використовувати значення осей з g80

source: Cannot use axis values without a g code that uses them
uk: Неможливо використовувати значення осей без G-коду, який їх використовує

source: Cannot use g28 or g30 with cutter radius comp
uk: Не можна використовувати g28 або g30 з компенсацією радіуса різця

source: Cannot use g53 incremental
uk: Неможливо використовувати інкрементальний g53

source: Cannot use g53 with cutter radius comp
uk: Неможливо використовувати g53 з компенсацією радіуса різця

source: Cannot use two g codes that both use axis values
uk: Не можна використовувати два G-коди, які обидва використовують значення осей

source: Command too long
uk: Команда занадто довга

source: Current point same as end point of arc
uk: Поточна точка така ж, як кінцева точка дуги

source: Dwell time missing with g4
uk: Відсутній час затримки з g4

source: Dwell time p word missing with g82
uk: Відсутнє слово p з часом затримки у g82

source: Dwell time p word missing with g86
uk: Відсутнє слово p з часом затримки у g86

source: Dwell time p word missing with g88
uk: Відсутнє слово p з часом затримки у g88

source: Dwell time p word missing with g89
uk: Відсутнє слово p з часом затримки у g89

source: Equal sign missing in parameter setting
uk: Знак рівності відсутній у налаштуванні параметра

source: F word missing with inverse time arc move
uk: Відсутнє слово на F у зворотному часовому дузі

source: F word missing with inverse time g1 move
uk: Відсутнє слово F з оберненим часом руху g1

source: File ended with no percent sign (%%)
uk: Файл закінчився без знака відсотка (%%)

source: File ended with no percent sign (%%) or program end (M2)
uk: Файл закінчився без знака відсотка (%%) або кінця програми (M2)

source: File name too long
uk: Ім'я файлу занадто довге

source: G-code out of range
uk: G-код поза діапазоном

source: I word given for arc in yz plane
uk: I слово, дане для дуги в площині yz

source: I word missing with g87
uk: Відсутнє слово I у g87

source: J word given for arc in xz plane
uk: J-слово, задане для дуги в площині xz

source: J word missing with g87
uk: Відсутнє слово на J у g87

source: K word given for arc in xy plane
uk: Слово на K, дане для дуги в площині xy

source: K word missing with g87
uk: Відсутнє слово на K у g87

source: Left bracket missing after slash with atan
uk: Ліва дужка відсутня після скісної риски з atan

source: Left bracket missing after unary operation name
uk: Відсутня ліва дужка після назви унарної операції

source: M-code greater than 199: M%d
uk: M-код більше 199: M%d

source: Mixed radius ijk format for arc
uk: Формат ijk зі змішаним радіусом для дуги

source: Multiple spindle choice ($) words on one line
uk: Кілька слів вибору веретена ($) в одному рядку

source: Multiple a words on one line
uk: Кілька слів типу A в одному рядку

source: Multiple b words on one line
uk: Кілька слів на букву "b" в одному рядку

source: Multiple c words on one line
uk: Кілька слів на C в одному рядку

source: Multiple d words on one line
uk: Кілька слів на букву "d" в одному рядку

source: Multiple f words on one line
uk: Кілька слів на букву "f" в одному рядку

source: Multiple h words on one line
uk: Кілька слів на букву "h" в одному рядку

source: Multiple i words on one line
uk: Кілька слів з індексом "i" в одному рядку

source: Multiple j words on one line
uk: Кілька слів на j в одному рядку

source: Multiple k words on one line
uk: Кілька k слів в одному рядку

source: Multiple l words on one line
uk: Кілька слів на l в одному рядку

source: Multiple p words on one line
uk: Кілька слів на p в одному рядку

source: Multiple q words on one line
uk: Кілька q слів в одному рядку

source: Multiple r words on one line
uk: Кілька слів на R в одному рядку

source: Multiple s words on one line
uk: Кілька слів на s в одному рядку

source: Multiple t words on one line
uk: Кілька слів на літеру «t» в одному рядку

source: Multiple x words on one line
uk: Кілька слів x в одному рядку

source: Multiple y words on one line
uk: Кілька слів на літеру "y" в одному рядку

source: Multiple z words on one line
uk: Кілька слів на букву Z в одному рядку

source: Must use g0 or g1 with g53
uk: Потрібно використовувати g0 або g1 з g53

source: Negative argument to sqrt
uk: Негативний аргумент функції sqrt

source: Negative d word tool radius index used
uk: Використаний від'ємний індекс радіуса інструмента d-слова

source: Negative f word used
uk: Використано слово з негативною формулою f

source: Negative g code used
uk: Використано негативний g-код

source: Negative h word used
uk: Використано слово з негативною буквою «h»

source: Negative l word used
uk: Використано слово з негативною l

source: Negative m code used
uk: Використано негативний m-код

source: Negative or zero q value used
uk: Використано від'ємне або нульове значення q

source: Negative p word used
uk: Використано слово з негативною "p"

source: Negative spindle speed used
uk: Використана негативна швидкість шпинделя

source: Negative tool id (tool not found)
uk: Негативний ідентифікатор інструменту (інструмент не знайдено)

source: Nested comment found
uk: Знайдено вкладений коментар

source: No characters found in reading real value
uk: При зчитуванні реального значення не знайдено жодних символів

source: Non integer value for integer
uk: Нецілочисельне значення для цілого числа

source: Null missing after newline
uk: Відсутній нуль після нового рядка

source: Parameter file out of order
uk: Файл параметрів не в порядку

source: Parameter number out of range
uk: Номер параметра поза діапазоном

source: Parameter is readonly
uk: Параметр доступний лише для читання

source: Q word missing with g83
uk: Відсутнє слово Q у g83

source: Queue is not empty after probing
uk: Черга не порожня після зондування

source: R clearance plane unspecified in cycle
uk: Площина зазору R не визначена в циклі

source: R i j k words all missing for arc
uk: Усі слова R i j k відсутні для слова arc

source: R less than x in cycle in yz plane
uk: R менше за x у циклі на площині yz

source: R less than y in cycle in xz plane
uk: R менше за y в циклі в площині xz

source: R less than z in cycle in xy plane
uk: R менше за z у циклі в площині xy

source: R word with no g code that uses it
uk: Слово на R без коду G, яке його використовує

source: Slash missing after first atan argument
uk: Відсутня скісну риску після першого аргументу atan

source: Spindle not turning clockwise in g84
uk: Шпиндель не обертається за годинниковою стрілкою в g84

source: Spindle not turning in g86
uk: Шпиндель не обертається в g86

source: Spindle not turning in g87
uk: Шпиндель не обертається в g87

source: Spindle not turning in g88
uk: Шпиндель не обертається в g88

source: Sscanf failed
uk: Помилка сканування Sscanf

source: Start point too close to probe point
uk: Початкова точка занадто близько до точки зонда

source: Too many m codes on line
uk: Забагато m-кодів онлайн

source: Pocket max too large
uk: Кишеньковий максимум занадто великий

source: Tool radius not less than arc radius with comp
uk: Радіус інструмента не менше радіуса дуги з компенсацією

source: Two g codes used from same modal group
uk: Два g-коди, що використовуються з однієї модальної групи

source: Two m codes used from same modal group
uk: Два m-коди, що використовуються з однієї модальної групи

source: Unable to open file <%s>
uk: Не вдалося відкрити файл <%s>

source: Unclosed comment found
uk: Знайдено незакритий коментар

source: Unclosed expression
uk: Незакритий вираз

source: Unknown g code used
uk: Використано невідомий g-код

source: Unknown m code used: M%d
uk: Використано невідомий m-код: M%d

source: Unknown operation
uk: Невідома операція

source: Unknown operation name starting with a
uk: Невідома назва операції, що починається з a

source: Unknown operation name starting with m
uk: Невідома назва операції, що починається на літеру m

source: Unknown operation name starting with o
uk: Невідома назва операції, що починається на літеру "o"

source: Unknown operation name starting with x
uk: Невідома назва операції, що починається з x

source: Unknown word starting with a
uk: Невідоме слово, що починається на літеру "a"

source: Unknown word starting with c
uk: Невідоме слово, що починається на літеру c

source: Unknown word starting with e
uk: Невідоме слово, що починається на літеру "е"

source: Unknown word starting with f
uk: Невідоме слово, що починається на літеру f

source: Unknown word starting with l
uk: Невідоме слово, що починається на літеру л

source: Unknown word starting with r
uk: Невідоме слово, що починається на літеру «р»

source: Unknown word starting with s
uk: Невідоме слово, що починається на літеру «с»

source: Unknown word starting with t
uk: Невідоме слово, що починається на літеру «т»

source: Unknown word where unary operation could be
uk: Невідоме слово, де може бути унарна операція

source: X and y words missing for arc in xy plane
uk: Бракує слів X та Y для дуги в площині xy

source: X and z words missing for arc in xz plane
uk: Бракує слів X та z для дуги в площині xz

source: X value unspecified in yz plane canned cycle
uk: Значення X не визначено у постійному циклі площини yz

source: Y and z words missing for arc in yz plane
uk: Бракує слів Y та z для дуги в площині yz

source: Y value unspecified in xz plane canned cycle
uk: Значення Y не визначено у постійному циклі площини xz

source: Z value unspecified in xy plane canned cycle
uk: Значення Z не визначено у стандартному циклі площини xy

source: Zero or negative argument to ln
uk: Нульовий або від'ємний аргумент для ln

source: Zero radius arc
uk: Дуга нульового радіуса

source: K word missing with g33/g33.1
uk: Відсутнє слово на K з g33/g33.1

source: F word used with a g33/g33.1
uk: Слово на літеру F, що використовується з g33/g33.1

source: Unknown operation name starting with e
uk: Невідома назва операції, що починається на літеру "e"

source: Unknown operation name starting with n
uk: Невідома назва операції, що починається на літеру «n»

source: Unknown operation name starting with g
uk: Невідома назва операції, що починається на літеру g

source: Unknown operation name starting with l
uk: Невідома назва операції, що починається на літеру l

source: Too many subroutine parameters
uk: Забагато параметрів підпрограми

source: Too many subroutine levels
uk: Занадто багато рівнів підпрограм

source: Bug: call stack underrun
uk: Помилка: недоповнення стеку викликів

source: Unknown control command in o word
uk: Невідома керуюча команда в слові типу "o"

source: Too many oword labels
uk: Забагато міток oword

source: Unknown oword number
uk: Невідомий номер oword

source: Nested subroutine definition
uk: Визначення вкладеної підпрограми

source: Not in subroutine definition
uk: Не у визначенні підпрограми

source: File not open
uk: Файл не відкривається

source: cannot reopen file %s - removed or renamed? (%s)
uk: Не вдається відкрити файл %s – видалено чи перейменовано? (%s)

source: Need tool prepared -Txx- for toolchange
uk: Потрібен інструмент, підготовлений -Txx- для зміни інструменту

source: Cannot change planes with cutter radius compensation on
uk: Неможливо змінити площини, якщо ввімкнено компенсацію радіуса різця

source: Cutter radius compensation allowed only in XY, XZ planes
uk: Компенсація радіуса різця дозволена лише в площинах XY, XZ

source: P word missing with G76
uk: Відсутнє слово на P у G76

source: I J or K words missing with G76
uk: Відсутні слова на I J або K у G76

source: Cannot move rotary axes with G76
uk: Неможливо перемістити обертальні осі за допомогою G76

source: Multiple e words on one line
uk: Кілька слів на e в одному рядку

source: Named parameter not terminated
uk: Іменований параметр не завершено

source: Out of memory
uk: Не вистачає пам'яті

source: S word missing with G96
uk: Відсутнє слово на S у G96

source: Queue is not empty after external input
uk: Черга не порожня після зовнішнього введення

source: Can't select analog input with wait type != immediate return
uk: Неможливо вибрати аналоговий вхід з типом очікування != негайне повернення

source: Zero timeout with wait type != immediate return
uk: Нульовий тайм-аут з типом очікування != негайне повернення

source: Invalid to select both a digital and an analog input with M66
uk: Недійсний вибір одночасно цифрового та аналогового входу за допомогою M66

source: Need to have either a valid P or a valid E word with M66
uk: Потрібно мати дійсне слово на літеру P або на літеру E з M66

source: Q word missing with g73
uk: Відсутнє слово Q у g73

source: Digital input selected out of bounds
uk: Цифровий вхід вибрано поза межами дозволеного

source: Analog input selected out of bounds
uk: Аналоговий вхід вибрано поза межами допустимого діапазону

source: W value unspecified in UV plane canned cycle
uk: Значення W не визначено в постійному циклі площини UV

source: U value unspecified in VW plane canned cycle
uk: Значення U не визначено в циклі фіксації літака VW

source: V value unspecified in UW plane canned cycle
uk: Значення V не визначено у постійному циклі площини UW

source: R less than W in cycle in UV plane
uk: R менше, ніж W в циклі в УФ-площині

source: R less than U in cycle in VW plane
uk: R менше, ніж U в циклі в площині VW

source: R less than V in cycle in UW plane
uk: R менше ніж V у циклі в площині UW

source: ERROR: '%s' is not a valid probe type
uk: ПОМИЛКА: '%s' не є дійсним типом зонда

source: ERROR: no pin/signal/parameter name
uk: ПОМИЛКА: немає назви виводу/сигналу/параметра

source: ERROR: -s option requires a probe type and a pin/signal/parameter name
uk: ПОМИЛКА: Для опції -s потрібен тип зонда та назва виводу/сигналу/параметра

source: Hal Meter
uk: Метр Хал

source: _Select
uk: _Виберіть

source: E_xit
uk: _Вихід

source: Select Item to Probe
uk: Виберіть елемент для дослідження

source: _Pins
uk: _Піни

source: _Signals
uk: _Сигнали

source: Para_meters
uk: _Параметри

source: _Close
uk: _Закрити

source: Usage: halscope [-h] [-i infile] [-o outfile] [num_samples]
uk: Використання: halscope [-h] [-i infile] [-o outfile] [num_samples]

source: Overwrite loaded log file data?
uk: Переписати дані завантаженого файлу журнала?

source: Open Log File:
uk: Відкрити файл журналу:

source: _Cancel
uk: _Скасувати

source: _Open
uk: _Відкрити

source: Open Configuration File:
uk: Відкрити файл конфігурації:

source: Save Configuration File:
uk: Зберегти файл конфігурації:

source: _Save
uk: _Зберегти

source: _Open Configuration...
uk: _Відкрити конфігурацію...

source: _Save Configuration...
uk: _Зберегти конфігурацію...

source: O_pen Log File
uk: _Відкрити файл журналу

source: S_ave Log File
uk: _Зберегти файл журналу

source: _Quit
uk: _Вийти

source: _About Halscope
uk: _Про Halscope

source: _File
uk: _Файл

source: _Help
uk: _Допомога

source: HAL Oscilloscope
uk: Осцилограф HAL

source: Horizontal
uk: Горизонтальний

source: Selected Channel
uk: Вибраний канал

source: Run Mode
uk: Режим роботи

source: Trigger
uk: Тригер

source: Vertical
uk: Вертикальний

source: Stop
uk: Стій

source: Normal
uk: Звичайний

source: Single
uk: Одинарний

source: Roll
uk: Рулон

source: Zoom
uk: Зум

source: Pos
uk: Поз

source: ----- Samples at ---- kHz
uk: ----- Зразки на ---- kHz

source: Realtime component not loaded
uk: Компонент реального часу не завантажено

source: HALSCOPE uses a realtime component called scope_rt' to sample signals for display. It is not currently loaded and attempting to load it automatically failed. More information may be available in the terminal where halscope was started. Please do one of the following: Load the component (using 'halcmd loadrt scope_rt'), then click 'OK' or Click 'Quit' to exit HALSCOPE
uk: HALSCOPE використовує компонент реального часу під назвою scope_rt' для вибірки сигналів для відображення. Наразі він не завантажений, а спроба його автоматичного завантаження завершилася невдачею. Більше інформації можна отримати в терміналі, де було запущено halscope. Виконайте одну з наступних дій: Завантажте компонент (за допомогою команди 'halcmd loadrt scope_rt'), а потім натисніть 'OK' або Натисніть 'Quit', щоб вийти з HALSCOPE

source: OK
uk: Гаразд

source: Quit
uk: Вийти

source: Realtime function not linked
uk: Функція реального часу не пов'язана

source: The HALSCOPE realtime sampling function must be called from a HAL thread in to determine the sampling rate. Please do one of the following: Select a thread name and multiplier then click 'OK' or Click 'Quit' to exit HALSCOPE
uk: Функція вибірки в реальному часі HALSCOPE повинна бути викликана з потоку HAL, щоб визначити частоту вибірки. Виконайте одну з наступних дій: Виберіть ім'я потоку та множник, а потім натисніть «OK» або Натисніть «Вийти», щоб вийти з HALSCOPE

source: Select Sample Rate
uk: Виберіть частоту дискретизації

source: Select a thread name and multiplier then click 'OK' or Click 'Quit' to exit HALSCOPE
uk: Виберіть назву потоку та множник, а потім натисніть «ОК» або натисніть «Вийти», щоб вийти з HALSCOPE

source: _OK
uk: _Гаразд

source: Thread:
uk: Нитка:

source: Sample Period:
uk: Період вибірки:

source: Sample Rate:
uk: Частота дискретизації:

source: Thread
uk: Нитка

source: Period
uk: Період

source: Multiplier:
uk: Множник:

source: Samples (16 channels):
uk: Зразків (16 каналів):

source: Current: %d samples (%d per channel)
uk: Поточно: %d зразків (%d на канал)

source: Sample count changed
uk: Кількість вибірок змінилася

source: The new sample count (%d) will take effect the next time halscope is started. The setting has been saved to the configuration file.
uk: Нова кількість вибірок (%d) вступить в дію при наступному запуску халскопа. Це налаштування було збережено у конфігураційний файл.

source: Realtime thread(s) not running
uk: Потоки в реальному часі не працюють

source: HALSCOPE uses code in a realtime HAL thread to sample signals for display. The HAL thread(s) are not running. Threads are usually started by the application you are attempting to run, or you can use the 'halcmd start' command. Please do one of the following: Start the threads, then click 'OK' or Click 'Quit' to exit HALSCOPE
uk: HALSCOPE використовує код у потоці HAL у режимі реального часу для вибірки сигналів для відображення. Потоки HAL не працюють. Потоки зазвичай запускаються програмою, яку ви намагаєтеся запустити, або ви можете використовувати команду «halcmd start». Виконайте одну з наступних дій: Запустіть потоки, а потім натисніть «OK» або Натисніть «Quit», щоб вийти з HALSCOPE

source: No channels selected
uk: Не вибрано каналів
