Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: SETUP
uk: НАЛАШТУВАТИ

source: RESET
uk: СКИДАТИ

source: CANCEL
uk: СКАСУВАТИ

source: AXIS
uk: ВІСЬ

source: OFFSET
uk: ЗМІЩЕННЯ

source: ANGLE
uk: КУТ

source: DIRECTION
uk: НАПРЯМОК

source: SIZE :
uk: РОЗМІР :

source: LinuxCNC Errors
uk: Помилки LinuxCNC

source: LinuxCNC terminated with an error. When reporting problems, please create a report file and include in your message.
uk: Робота LinuxCNC завершилася з помилкою. Під час повідомлення про проблеми, будь ласка, створіть файл звіту та додайте його до свого повідомлення.

source: Create Report File
uk: Створити файл звіту

source: Close
uk: Закрити

source: Set Run Mark
uk: Встановити позначку пробігу

source: Set run mark at line %s?
uk: Встановити позначку пробігу на лінії %s?

source: untitled
uk: без назви

source: Load Parameter File
uk: Завантаження файлу параметрів

source: LinuxCNC Diagnostics
uk: Діагностика LinuxCNC

source: Task
uk: Завдання

source: Heartbeat:
uk: Серцебиття:

source: Command:
uk: Команда:

source: Command #:
uk: Команд #:

source: Status:
uk: Статус:

source: Motion
uk: Рух

source: About TkLinuxCNC
uk: Про TkLinuxCNC

source: TkLinuxcnc Tcl/Tk GUI for LinuxCNC GPL Version 2 (2012)
uk: TkLinuxcnc Tcl/Tk GUI для LinuxCNC GPL версія 2 (2012)

source: Set Tool Offset
uk: Встановити зміщення інструмента

source: Tool:
uk: Інструмент:

source: All files
uk: Усі файли

source: Text files
uk: Текстові файли

source: NC files
uk: Файли NC

source: continuous
uk: безперервний

source: Edit...
uk: Редагувати...

source: Tool Table Editor...
uk: Редактор таблиці інструментів...

source: Reload Tool Table
uk: Перезавантажити таблицю інструментів

source: Offsets and Variables...
uk: Зміщення та змінні...

source: Diagnostics...
uk: Діагностика...

source: Backplot...
uk: Задній план...

source: Calibration...
uk: Калібрування...

source: Testing...
uk: Тестування...

source: Debug...
uk: Налагодження...

source: Font...
uk: Шрифт...

source: Units
uk: Одиниці

source: auto
uk: авто

source: inches
uk: дюйми

source: mm
uk: мм

source: cm
uk: см

source: Utilities
uk: Комунальні послуги

source: Set Coordinates
uk: Встановити координати

source: HAL Show
uk: Шоу HAL

source: HAL Config
uk: Конфігурація HAL

source: Help...
uk: Допомога...

source: Balloon help
uk: Допомога з повітряними кульками

source: Estop on
uk: Зупиніться там, де

source: Estop off
uk: Зупиніться

source: Machine on
uk: Машина ввімкнена

source: Machine off
uk: Машина вимкнена

source: Manual
uk: Ручний

source: Mist on
uk: Туман на

source: Mist off
uk: Зніміть туман

source: Flood on
uk: Повінь увімкнена

source: Flood off
uk: Потоп відключено

source: Spindle forward
uk: Шпиндель вперед

source: Spindle reverse
uk: Реверс шпинделя

source: Spindle off
uk: Шпиндель вимкнено

source: Brake on
uk: Гальмо увімкнено

source: Brake off
uk: Гальмо зняти

source: ABORT
uk: ПЕРЕРВАТИ

source: Offset:
uk: Зсув:

source: Work Offsets:
uk: Робочі зміщення:

source: override limits
uk: перевизначення обмежень

source: relative
uk: родич

source: machine
uk: машина

source: actual
uk: фактичний

source: commanded
uk: наказав

source: joint
uk: суглоб

source: world
uk: світ

source: home
uk: головна сторінка

source: Set axis value:
uk: Встановити значення осі:

source: Set Jog Speed
uk: Встановлення швидкості штовхання

source: Set jog speed:
uk: Встановлення швидкості штовхання:

source: Set Feed Override
uk: Встановити перевизначення подачі

source: Set feed override:
uk: Встановити перевизначення каналу:

source: Set Spindle Override
uk: Встановити корекцію шпинделя

source: Set spindle speed override:
uk: Встановлення корекції швидкості шпинделя:

source: Linear Jog Speed
uk: Лінійна швидкість штовхання

source: Angular Jog Speed (deg)/min:
uk: Кутова швидкість ривка (град)/хв:

source: Feed Override:
uk: Перевизначення каналу:

source: Spindle speed Override:
uk: Коригування швидкості шпинделя:

source: Program:
uk: Програма:

source: - Status:
uk: - Статус:

source: Run
uk: Запуск

source: Pause
uk: Пауза

source: Resume
uk: Продовжити

source: Step
uk: Крок

source: Verify
uk: Перевірити

source: Optional Stop
uk: Додаткова зупинка

source: Set Font
uk: Встановити шрифт

source: Font
uk: Шрифт

source: Size
uk: Розмір

source: Style
uk: Стиль

source: MANUAL
uk: РУЧНИЙ

source: ESTOP
uk: ЕСТІЙ

source: ON
uk: УМІВК

source: ESTOP RESET
uk: ЕСТОП СКИДАТИ

source: AUTO
uk: АВТО

source: MIST ON
uk: ТУМАН УВІМКНЕНО

source: MIST OFF
uk: ВИМКНЕНО

source: MIST ?
uk: ТУМАН ?

source: FLOOD ON
uk: ПОВІННЯ УВІМК

source: FLOOD OFF
uk: ПОВІННЯ ВИМК

source: FLOOD ?
uk: ПОВІНЬ ?

source: SPINDLE FORWARD
uk: ШПИНДЕЛЬ ВПЕРЕД

source: SPINDLE REVERSE
uk: ЗВОРОТ ШПИНДЕЛЯ

source: SPINDLE OFF
uk: ШПИНДЕЛЬ ВИМК

source: SPINDLE INCREASE
uk: ЗБІЛЬШЕННЯ ШПИНДЕЛЯ

source: SPINDLE DECREASE
uk: ЗМЕНШЕННЯ ШПИНДЕЛЯ

source: SPINDLE ?
uk: ШПИНДЕЛЬ ?

source: BRAKE ON
uk: ГАЛЬМО УВІМКНЕНО

source: BRAKE OFF
uk: ЗАГАЛЬМУВАТИ

source: BRAKE ?
uk: ГАЛЬМО ?

source: LinuxCNC Set Coordinate
uk: Встановити координати LinuxCNC

source: Coordinate System Control Window
uk: Вікно керування системою координат

source: Axis
uk: Вісь

source: Var #
uk: Наш #

source: Offset Value
uk: Значення зміщення

source: What to Teach
uk: Чого навчати

source: Teach
uk: Навчати

source: Set Old
uk: Встановити старе

source: Set Zero
uk: Встановити нуль

source: Write
uk: Написати

source: Need non-null file name
uk: Потрібна ненульова назва файлу

source: Disallowed use of ngcgui generated file as Subfile
uk: Заборонено використовувати згенерований ngcgui файл як підфайл

source: marked (not_a_subfile) Not intended for use as a subfile
uk: позначено (not_a_subfile) Не призначено для використання як підфайл

source: bogus
uk: фальшивий

source: can not include subroutines within ngcgui subfile
uk: не можна включати підпрограми в підфайл ngcgui

source: Multiple subroutines in file not allowed
uk: Кілька підпрограм у файлі не дозволено

source: sub label
uk: підмітка

source: does not match subroutine file name
uk: не відповідає назві файлу підпрограми

source: ignoring M2 after endsub
uk: ігноруючи M2 після кінцевого підзаголовка

source: file contains lines after subend
uk: файл містить рядки після підзаголовка

source: file contains lines before sub
uk: файл містить рядки перед підрядком

source: endsub label
uk: мітка кінцевого підпрограми

source: out of sequence positional parameter
uk: позиційний параметр поза послідовністю

source: expected
uk: очікуваний

source: no 'sub' found in file
uk: у файлі не знайдено "sub"

source: no 'endsub' found in file
uk: у файлі не знайдено 'endsub'

source: Cannot find gcmc executable
uk: Не вдається знайти виконуваний файл gcmc

source: Please Install in path
uk: Будь ласка, встановіть у шлях

source: not embedded, deriving outdir from:
uk: не вбудований, походить від outdir:

source: Choose Files
uk: Вибрати файли

source: Controls
uk: Елементи керування

source: Preamble
uk: Преамбула

source: Subfile
uk: Підфайл

source: Postamble
uk: Постамбула

source: Retain values on Subfile read
uk: Зберігати значення під час читання підфайлу

source: Expand subroutine
uk: Розгорнути підпрограму

source: Autosend
uk: Автоматичне надсилання

source: Verbose ngcfile
uk: Детальний ngcfile

source: Create Feature
uk: Створити об'єкт

source: Finalize
uk: Фіналізувати

source: Reread
uk: Перечитати

source: Restart
uk: Перезавантажити

source: SendFileToAxis
uk: НадіслатиФайлДоОсі

source: Unrecoverable problem
uk: Невиправна проблема

source: Postamble file
uk: Вкладки постамбле

source: Subroutine file
uk: Файл підпрограми

source: Positional Parameters
uk: Позиційні параметри

source: No Subfile specified
uk: Підфайл не вказано

source: No parameters yet
uk: Поки що немає параметрів

source: Missing value for parm
uk: Відсутнє значення для параметра

source: Output file
uk: Вихідний файл

source: Multiple Tabs with Features
uk: Кілька вкладок з функціями

source: Finalize all Tabs?
uk: Закрити всі вкладки?

source: Order
uk: Замовлення

source: No, just this page
uk: Ні, лише ця сторінка

source: Axis is not responding
uk: Axis не відповідає

source: Error:
uk: Помилка:

source: Autosend disabled, Ctrl-A toggles autosend
uk: Автоматичне надсилання вимкнено, Ctrl-A вмикає автоматичне надсилання

source: File saving enabled -- Finalize to save
uk: Збереження файлу ввімкнено -- Завершіть для збереження

source: Require .ngc suffix for filename
uk: Вимагати суфікс .ngc для імені файлу

source: Disallowed overwrite of
uk: Перезапис заборонено

source: FEATURE
uk: ОСОБЛИВІСТЬ

source: feature line added
uk: додано лінію об'єкта

source: remaining_features line added
uk: додано рядок remaining_features

source: line added
uk: додано рядок

source: activated
uk: активовано

source: restores
uk: відновлює

source: NOTREACHED mode
uk: Режим НЕДОСЯГНУТО

source: Positional parameters for
uk: Позиційні параметри для

source: expanded file
uk: розгорнутий файл

source: call subroutine file
uk: файлу підпрограми виклику

source: Enter parms for 1st feature
uk: Введіть параметри для 1-ї функції

source: New Outfile
uk: Новий вихідний файл

source: Ready to make New Outfile
uk: Готовий створити новий вихідний файл

source: Enter parms for feature
uk: Введіть параметри для функції

source: feature
uk: особливість

source: Create Next
uk: Створити далі

source: Created feature
uk: Створено об'єкт

source: option
uk: опція

source: Missing parameters
uk: Відсутні параметри

source: Parse Error
uk: Помилка синтаксичного аналізу

source: Null Preamble
uk: Нульова преамбула

source: Read Preamble
uk: Прочитайте преамбулу

source: Preamble Error
uk: Помилка преамбули

source: Null Postamble
uk: Нульова публікація

source: Read Postamble
uk: Читати постамбулу

source: Postamble Error
uk: Помилка публікації

source: Read Subfile
uk: Читання підфайлу

source: Write Error
uk: Помилка запису

source: Outfile set
uk: Набір вихідних файлів

source: Finished
uk: Завершено

source: Canceled
uk: Скасовано

source: Sent
uk: Надіслано

source: SendFileToAxis failed
uk: Не вдалося виконати команду SendFileToAxis

source: Ctrl-k for Key bindings
uk: Ctrl-k для комбінацій клавіш

source: Expand sub
uk: Розгорнути підпункт

source: Retain values
uk: Зберегти значення

source: Verbose
uk: Багатослівний

source: Finalize Canceled
uk: Фіналізувати Скасовано

source: Dismiss
uk: Відхилити

source: ngcgui Error
uk: Помилка ngcgui

source: Declining support for tk send bug in ngcgui
uk: Зменшення підтримки помилки tk send в ngcgui

source: You should upgrade linuxcnc to >= linuxcnc2.5
uk: Вам слід оновити linuxcnc до версії >= linuxcnc2.5

source: pre2.4_send_file_to_axis:error
uk: pre2.4_send_file_to_axis:помилка

source: OFF
uk: ВИМК

source: Toggle autosend
uk: Увімкнути/вимкнути автоматичне надсилання

source: Clear entries
uk: Очистити записи

source: Set entries to default values
uk: Встановити значення за замовчуванням для записів

source: Open editor specified by
uk: Відкрити редактор, визначений

source: on last outfile
uk: на останньому вихідному файлі

source: toggle expand subroutines
uk: перемикання розгортання підпрограм

source: Create feature
uk: Створити об'єкт

source: Finalize (AUTO send is
uk: Фіналізувати (АВТОМАТИЧНЕ надсилання

source: Show key bindings
uk: Показати комбінації клавіш

source: Restart (cancel pending)
uk: Перезапустити (очікується скасування)

source: (re)Read Preamble
uk: (Пере)читайте преамбулу

source: (re)Read Postamble
uk: (Перечитати) Пошта

source: (re)Read Subfile
uk: (Повторне) прочитання підфайлу

source: toggle retain values
uk: перемикання збереження значень

source: toggle output file verbosity
uk: перемикання деталізації вихідного файлу

source: Show status
uk: Показати статус

source: Show full status (debug info)
uk: Показати повний стан (інформація про налагодження)

source: on current subfile
uk: на поточному підфайлі

source: on current preamble
uk: щодо поточної преамбули

source: Escape Return to Preview page
uk: Вийти Повернутися на сторінку попереднього перегляду

source: Editing requires setting for environmental variable VISUAL
uk: Редагування вимагає налаштування змінної середовища VISUAL

source: Trying gedit
uk: Спроба gedit

source: No file available for editing yet
uk: Файлів для редагування поки що немає

source: No file available for editing
uk: Немає файлів для редагування

source: Status items
uk: Елементи стану

source: All-page opt items
uk: Елементи опції для всієї сторінки

source: any-items
uk: будь-які елементи

source: Set defaults
uk: Встановити значення за замовчуванням

source: not writable
uk: не можна записувати

source: new
uk: новий

source: Open a new Subfile
uk: Відкрити новий підфайл

source: remove
uk: вилучити

source: move
uk: рухатися

source: Custom
uk: Спеціальні

source: Problem creating page
uk: Проблема зі створенням сторінки

source: entrykeybindings not available
uk: комбінації клавіш введення недоступні

source: Found multiple matches for
uk: Знайдено кілька збігів для

source: using path
uk: використовуючи шлях

source: Warning
uk: Попередження

source: File absolute path specifier conflicts with searchpath result
uk: Специфікатор абсолютного шляху до файлу конфліктує з результатом пошуку шляху

source: Absolute Specifier
uk: Абсолютний специфікатор

source: Using Search Result
uk: Використання результатів пошуку

source: File not in Search Path
uk: Файлу немає в шляху пошуку

source: Must be in search path
uk: Має бути в шляху пошуку

source: (File found -- not in search path)
uk: (Файл знайдено -- його немає в шляху пошуку)

source: Current directory
uk: Поточний каталог

source: Search path
uk: Шлях пошуку

source: Check setting for
uk: Перевірте налаштування для

source: in ini file
uk: у цьому файлі

source: (Restart required after fixing ini file)
uk: (Після виправлення ini-файлу потрібен перезапуск)

source: Try to Continue
uk: Спробуйте продовжити

source: Ngcgui Configuration File Not Found
uk: Файл конфігурації Ngcgui не знайдено

source: ini file
uk: ini файл

source: not found
uk: не знайдено

source: found truetype-tracer v4 -OK
uk: знайдено truetype-tracer v4 -OK

source: Note truetype-tracer v4 is required
uk: Зверніть увагу, що потрібен truetype-tracer версії 4

source: Note: truetype-tracer v4 is required
uk: Примітка: потрібен truetype-tracer версії 4

source: ngcgui_app.tcl must be loaded before
uk: Файл ngcgui_app.tcl має бути завантажений перед

source: Create a subroutine file from truetype-tracer (V4 reqd)
uk: Створити файл підпрограми з truetype-tracer (вимога V4)

source: problem with
uk: проблема з

source: No entry for
uk: Вхід заборонено для

source: wrong version of truetype-tracer
uk: неправильна версія truetype-tracer

source: not writable, using
uk: не можна записувати, використовуючи

source: and setting expandsub
uk: та налаштування expandsub

source: Text
uk: Текст

source: Linescale
uk: Лінійна шкала

source: none
uk: нічого

source: Subdiv
uk: Підрозділ

source: default
uk: за замовчуванням

source: Mode
uk: Режим

source: normal
uk: нормальний

source: date
uk: дата

source: fontname
uk: назва шрифту

source: Switches
uk: Перемикачі

source: Unicode
uk: Юнікод

source: Allow Rotation
uk: Дозволити обертання

source: Make ngcgui-compatible subfile and new tab page
uk: Зробити підфайл та сторінку нової вкладки сумісними з ngcgui

source: Null text
uk: Нульовий текст

source: Using truetype-tracer default font
uk: Використання шрифту truetype-tracer за замовчуванням

source: no such file
uk: такого файлу немає

source: file not readable
uk: файл не читається

source: Creating new tab page
uk: Створення нової вкладки

source: requires command inifindall from axis.py (LinuxCNC 2.5) or
uk: потрібна команда inifindall з axis.py (LinuxCNC 2.5) або

source: not readable
uk: нечитабельно

source: Unexpected: multiple startups for ngcgui
uk: Несподіване: кілька стартапів для ngcgui

source: for LinuxCNC 2.5.xxx, Do not include tkapp.py in the ini file
uk: для LinuxCNC 2.5.xxx, не включайте tkapp.py до ini-файлу

source: LinuxCNC version
uk: Версія для LinuxCNC

source: Note: Ignoring duplicate column name: %s
uk: Примітка: Ігнорування дубліката назви стовпця: %s

source: Unknown column: %s
uk: Невідомий стовпець: %s

source: NEW
uk: НОВИЙ

source: Problem
uk: Проблема

source: Bad Entry
uk: Неправильний запис

source: (must be a number)
uk: (має бути числом)

source: filename: <%s> not readable
uk: ім'я файлу: <%s> не читається

source: filename: <%s> not writable
uk: ім'я файлу: <%s> недоступне для запису

source: directory: <%s> not writable
uk: каталог: <%s> недоступний для запису

source: Current file:
uk: Поточний файл:

source: Tooledit already running
uk: Tooledit вже запущено

source: Skipping linenumber %d for tag %s, value <%s> is not a number
uk: Пропуск рядка номер %d для тегу %s, значення <%s> не є числом

source: Skipping linenumber %d for tag %s, expected integer not <%s>
uk: Пропускається рядок номер %d для тегу %s, очікуване ціле число не <%s>

source: At linenumber %d, Unknown tag <%s>
uk: У рядку номер %d, невідомий тег <%s>

source: %s: Column sorting not available with tcl_version==%s
uk: %s: Сортування стовпців недоступне з tcl_version==%s

source: tool
uk: інструмент

source: poc
uk: поз

source: diam
uk: мовч

source: front
uk: передня частина

source: back
uk: назад

source: orien
uk: схід

source: comment
uk: коментар

source: Del
uk: Дел

source: ReLoadTable
uk: Перезавантажити таблицю

source: SaveFile
uk: ЗберегтиФайл

source: ReRead
uk: Перечитати

source: AddTool
uk: Додати інструмент

source: Opened %s
uk: Відкрито %s

source: Created %s
uk: Створено %s

source: File updated
uk: Файл оновлено

source: File modified
uk: Файл змінено

source: File check errors
uk: Помилки перевірки файлів

source: File checked
uk: Файл перевірено

source: File items deleted
uk: Елементи файлу видалено

source: Bogus lines in file ignored
uk: Фальшиві рядки у файлі ігноруються

source: File errors -- Check Entries
uk: Помилки файлу -- Перевірити записи

source: Warning: File changed by another process
uk: Попередження: Файл змінено іншим процесом

source: Warning: File deleted by another process
uk: Попередження: Файл видалено іншим процесом

source: Added Tool
uk: Доданий інструмент

source: Sorted by %s, increasing
uk: Відсортовано за %s, у порядку зростання

source: Sorted by %s, decreasing
uk: Відсортовано за %s, у порядку спадання

source: Added
uk: Додано

source: Tool %s, Column %s, parameter %s is not a number
uk: Інструмент %s, колонка %s, параметр %s не є числом

source: Tool %s, parameter %s must be nonnegative integer
uk: Інструмент %s, параметр %s має бути невід'ємним цілим числом

source: Tool %s: <Orientation> must be 0..9 integer
uk: Інструмент %s: <Орієнтація> має бути цілим числом 0..9

source: Tool %s: <%s> must be between -360 and 360
uk: Інструмент %s: <%s> має бути між -360 та 360

source: Pocket <%s> specified multiple times
uk: Кишеня <%s> вказана кілька разів

source: Tool <%s> specified multiple times
uk: Інструмент <%s> вказано кілька разів

source: File Modified
uk: Файл змінено

source: Save Modifications to File?
uk: Зберегти зміни у файл?

source: Only these columns are currently used: %s
uk: Наразі використовуються лише ці стовпці: %s

source: Limit display to these columns by specifying
uk: Обмежте відображення цими стовпцями, вказавши

source: Format for ini file is
uk: Формат ini-файлу з

source: For standalone use, invoke as
uk: Для автономного використання викликати як

source: Created by %s
uk: Створено користувачем %s

source: Saved geometry (updated on program termination)
uk: Збережена геометрія (оновлюється після завершення програми)

source: %s: Axis inifile specifies multiple inifile items for: [EMCIO]TOOL_TABLE
uk: %s: INI-файл осі визначає кілька елементів INI-файлу для: [EMCIO]TOOL_TABLE

source: %s: Using: %s
uk: %s: Використовується: %s

source: differs from the the ini specified file: %s
uk: відрізняється від зазначеного INI-файлу: %s

source: Axis is Running
uk: Вісь працює

source: Must be On and Idle to reload tool table
uk: Для перезавантаження таблиці інструментів має бути увімкнено та в режимі очікування

source: Usage
uk: Використання

source: filename
uk: ім'я файлу

source: Allowed column_ names are: %s
uk: Дозволені назви стовпців: %s

source: Missing filename
uk: Відсутнє ім'я файлу

source: Do you really want to close LinuxCNC?
uk: Ви справді хочете закрити LinuxCNC?

source: Confirm Close
uk: Підтвердити закриття

source: Emergency stop
uk: Аварійна зупинка

source: Turn machine on
uk: Увімкніть машину

source: Activate first axis
uk: Активувати першу вісь

source: Activate second axis
uk: Активувати другу вісь

source: Activate third axis
uk: Активувати третю вісь

source: Activate fourth axis
uk: Активувати четверту вісь

source: Activate first through ninth joint
uk: Активізуйте перший-дев'ятий суглоби

source: if joints radiobuttons visible
uk: якщо видно радіокнопки суглобів

source: Set Feed Override from 0% to 100%
uk: Встановити перевизначення подачі від 0% до 100%

source: if axes radiobuttons visible
uk: якщо радіокнопки осей видимі

source: , and .
uk: , і .

source: Select jog speed
uk: Виберіть швидкість штовхання

source: < and >
uk: < і >

source: Select angular jog speed
uk: Виберіть кутову швидкість поштовхового переміщення

source: Select jog increment
uk: Виберіть крок поштовху

source: Continuous jog
uk: Безперервний біг підтюпцем

source: Home
uk: Головна сторінка

source: Send active joint home
uk: Надіслати активний суглоб у головному сторінки

source: Home all joints
uk: Головна сторінка всі суглоби

source: Zero G54 offset for active axis
uk: Нульове зміщення G54 для активної осі

source: End
uk: Кінець

source: Set G54 offset for active axis
uk: Встановити зміщення G54 для активної осі

source: Set tool offset for loaded tool
uk: Встановлення зміщення інструменту для завантаженого інструменту

source: Jog active axis or joint
uk: Поштовховий рух активної осі або з'єднання

source: Select Max velocity
uk: Виберіть максимальну швидкість

source: Jog first axis or joint
uk: Поштовховий рух першої осі або суглоб

source: Jog second axis or joint
uk: Поштовховий рух другої осі або суглоб

source: Jog third axis or joint
uk: Поштовховий рух третьої осі або суглоб

source: Shift+above jogs
uk: Shift+вище пробіжок

source: Jog at traverse speed
uk: Поштовховий хід зі швидкістю переміщення

source: Jog fourth axis or joint
uk: Поворот четвертої осі або суглоб

source: Toggle between Drag and Rotate mode
uk: Перемикання між режимами перетягування та обертання

source: Left Button
uk: Ліва кнопка

source: Pan, rotate or select line
uk: Панорамування, поворот або вибір лінії

source: Shift+Left Button
uk: Shift+Ліва кнопка

source: Rotate or pan
uk: Поворот або панорамування

source: Right Button
uk: Права кнопка

source: Zoom view
uk: Збільшений вигляд

source: Wheel Button
uk: Кнопка колеса

source: Rotate view
uk: Повернути вигляд

source: Rotate Wheel
uk: Повернути колесо

source: Ctrl+Left Button
uk: Ctrl+Ліва кнопка

source: Manual control
uk: Ручне керування

source: Code entry (MDI)
uk: Введення коду (MDI)

source: Clear MDI history
uk: Очистити історію MDI

source: Copy selected MDI history elements
uk: Копіювати вибрані елементи історії MDI

source: to clipboard
uk: у буфер обміну

source: Paste clipboard to MDI history
uk: Вставити буфер обміну в історію MDI

source: Override Limits
uk: Замінити обмеження

source: Open program
uk: Відкрита програма

source: Reload program
uk: Програма перезавантаження

source: Save G-code as
uk: Зберегти G-код як

source: Run program
uk: Запустити програму

source: Step program
uk: Програма кроків

source: Pause program
uk: Призупинити програму

source: Resume program
uk: Програма резюме

source: Stop running program, or
uk: Зупинити роботу програми, або
