Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: Start
uk: Старт

source: Base Information
uk: Базова інформація

source: Parallel Port 1
uk: Паралельний порт 1

source: Parallel Port 2
uk: Паралельний порт 2

source: Options
uk: Опції

source: HALUI
uk: ПРИЄДНАТИСЯ

source: User Buttons
uk: Кнопки користувача

source: Axis X
uk: Вісь X

source: Axis Y
uk: Вісь Y

source: Axis Z
uk: Вісь Z

source: Axis U
uk: Вісь U

source: Axis V
uk: Вісь V

source: Axis A
uk: Вісь A

source: Spindle
uk: Шпиндель

source: Almost Done
uk: Майже готово

source: Sherline
uk: Шерлайн

source: Xylotex 8S-3
uk: Ксилотекс 8S-3

source: Parker-Compumotor oem750
uk: Parker-Комп'ютерний двигун oem750

source: JVL-SMD41 or 42
uk: JVL-SMD41 або 42

source: X Step
uk: Крок X

source: X Direction
uk: Напрямок X

source: Y Step
uk: Крок Y

source: Y Direction
uk: Напрямок Y

source: Z Step
uk: Крок Z

source: Z Direction
uk: Напрямок Z

source: A Step
uk: Крок А

source: A Direction
uk: Напрямок А

source: U Step
uk: Крок U

source: U Direction
uk: Напрямок U

source: V Step
uk: Крок V

source: V Direction
uk: Напрямок V

source: Tandem X Step
uk: Тандемний X-кроковий

source: Tandem X Direction
uk: Тандемний напрямок X

source: Tandem Y Step
uk: Тандемний Y-подібний крок

source: Tandem Y Direction
uk: Тандемний напрямок Y

source: Spindle ON
uk: Шпиндель умівк

source: Spindle PWM
uk: Шпиндель PWM

source: Spindle Brake
uk: Гальмо шпинделя

source: Coolant Mist
uk: Туман охолоджувальної рідини

source: Coolant Flood
uk: Потік охолоджувальної рідини

source: ESTOP Out
uk: ЕСТОП Вихід

source: Amplifier Enable
uk: Увімкнення підсилювача

source: Charge Pump
uk: Зарядний насос

source: Digital out 0
uk: Цифровий вихід 0

source: Digital out 1
uk: Цифровий вихід 1

source: Digital out 2
uk: Цифровий вихід 2

source: Digital out 3
uk: Цифровий вихід 3

source: Plasma Torch On
uk: Плазмовий пальник увімкнено

source: Plasma Ohmic Enable
uk: Увімкнення омічного плазмового струму

source: Plasma Scribe Arm
uk: Плазмова розмічувальна рука

source: Plasma Scribe On
uk: Плазмове маркування увімкнено

source: Plasma Laser On
uk: Плазмовий лазер увімкнено

source: Unused
uk: Невикористаний

source: ESTOP In
uk: ЕСТОП У

source: Probe In
uk: Зонд у

source: Spindle Index
uk: Індекс шпинделя

source: Spindle Phase A
uk: Фаза шпинделя A

source: Spindle Phase B
uk: Фаза шпинделя B

source: Home X
uk: Головна сторінка X

source: Home Y
uk: Головна сторінка Y

source: Home Z
uk: Головна сторінка Z

source: Home A
uk: Головна сторінка A

source: Home U
uk: Головна сторінка U

source: Home V
uk: Головна сторінка V

source: Home Tandem X
uk: Домашній тандем X

source: Home Tandem Y
uk: Домашній тандем Y

source: Minimum Limit + Home X
uk: Мінімальний ліміт + Домашній X

source: Minimum Limit + Home Y
uk: Мінімальний ліміт + Домашня Y

source: Minimum Limit + Home Z
uk: Мінімальний ліміт + Домашня Z

source: Minimum Limit + Home A
uk: Мінімальний ліміт + Домашня А

source: Minimum Limit + Home U
uk: Мінімальний ліміт + Домашній U

source: Minimum Limit + Home V
uk: Мінімальний ліміт + Домашній V

source: Minimum Limit + Home Tandem X
uk: Мінімальний ліміт + Домашній тандем X

source: Minimum Limit + Home Tandem Y
uk: Мінімальний ліміт + Домашній тандем Y

source: Maximum Limit + Home X
uk: Максимальний ліміт + Домашній X

source: Maximum Limit + Home Y
uk: Максимальний ліміт + Домашня Y

source: Maximum Limit + Home Z
uk: Максимальний ліміт + Домашня Z

source: Maximum Limit + Home A
uk: Максимальний ліміт + Домашня гра А

source: Maximum Limit + Home U
uk: Максимальний ліміт + Домашній U

source: Maximum Limit + Home V
uk: Максимальний ліміт + Домашня V

source: Maximum Limit + Home Tandem X
uk: Максимальний ліміт + Домашній тандем X

source: Maximum Limit + Home Tandem Y
uk: Максимальний ліміт + Домашній тандем Y

source: Both Limit + Home X
uk: Обидва ліміти + Домашній X

source: Both Limit + Home Y
uk: Обидва ліміти + Домашня Y

source: Both Limit + Home Z
uk: Обидва ліміти + Домашня Z

source: Both Limit + Home A
uk: Обидва ліміти + Домашня А

source: Both Limit + Home U
uk: Обидва ліміти + Домашній U

source: Both Limit + Home V
uk: Обидва ліміти + Домашня V

source: Both Limit + Home Tandem X
uk: Обидва ліміти + Домашній тандем X

source: Both Limit + Home Tandem Y
uk: Обидва ліміти + Домашній тандем Y

source: Minimum Limit X
uk: Мінімальний ліміт X

source: Minimum Limit Y
uk: Мінімальна ліміт Y

source: Minimum Limit Z
uk: Мінімальна ліміт Z

source: Minimum Limit A
uk: Мінімальна ліміт А

source: Minimum Limit U
uk: Мінімальна ліміт U

source: Minimum Limit V
uk: Мінімальна ліміт V

source: Minimum Limit Tandem X
uk: Мінімальний ліміт Тандем X

source: Minimum Limit Tandem Y
uk: Мінімальна ліміт Тандем Y

source: Maximum Limit X
uk: Максимальна ліміт X

source: Maximum Limit Y
uk: Максимальна ліміт Y

source: Maximum Limit Z
uk: Максимальна ліміт Z

source: Maximum Limit A
uk: Максимальна ліміт А

source: Maximum Limit U
uk: Максимальна ліміт U

source: Maximum Limit V
uk: Максимальна ліміт V

source: Maximum Limit Tandem X
uk: Максимальна ліміт Тандем X

source: Maximum Limit Tandem Y
uk: Максимальна ліміт Тандем Y

source: Both Limit X
uk: Обидві ліміт X

source: Both Limit Y
uk: Обидві ліміт Y

source: Both Limit Z
uk: Обидві ліміт Z

source: Both Limit A
uk: Обидва ліміт А

source: Both Limit U
uk: Обидві ліміт U

source: Both Limit V
uk: Обидві ліміт V

source: Both Limit Tandem X
uk: Обидва ліміт Тандемн X

source: Both Limit Tandem Y
uk: Обидва ліміт Тандемн Y

source: All limits
uk: Усі ліміти

source: All home
uk: Всі домашні

source: All limits + homes
uk: Усі ліміти + будинки

source: Digital in 0
uk: Цифровий формат у 0

source: Digital in 1
uk: Цифровий в 1

source: Digital in 2
uk: Цифровий у 2

source: Digital in 3
uk: Цифровий формат у 3

source: Plasma Arc Voltage
uk: Напруга плазмової дуги

source: Plasma Arc OK
uk: Плазмова дуга в порядку

source: Plasma Float Switch
uk: Плазмовий поплавковий вимикач

source: Plasma Breakaway
uk: Плазмовий відрив

source: Plasma Ohmic Contact
uk: Плазмовий омічний контакт

source: Plasma Move Up
uk: Плазмовий рух вгору

source: Plasma Move Down
uk: Плазма рухається вниз

source: Forward
uk: Вперед

source: Done
uk: Готово

source: OK to replace existing custom ladder program? Existing Custom.clp will be renamed custom_backup.clp. Any existing file named -custom_backup.clp- will be lost.
uk: Можна замінити існуючу користувацьку програму сходів? Існуючий файл Custom.clp буде перейменовано на custom_backup.clp. Будь-який існуючий файл з назвою -custom_backup.clp- буде втрачено.

source: You edited a ladder program and have selected a different program to copy to your configuration file. The edited program will be lost. Are you sure?
uk: Ви відредагували програму релейної логіки та вибрали іншу програму для копіювання до файлу конфігурації. Відредаговану програму буде втрачено. Ви впевнені?

source: You need to designate an E-stop input pin in the Parallel Port Setup page for this program.
uk: Для цієї програми потрібно призначити вхідний контакт аварійної зупинки на сторінці налаштування паралельного порту.

source: OK to replace existing custom pyvcp panel file ? Existing custompanel.xml will be renamed custompanel_backup.xml. Any existing file named custompanel_backup.xml will be lost.
uk: Чи можна замінити існуючий файл користувацької панелі pyvcp? Існуючий файл custompanel.xml буде перейменовано на custompanel_backup.xml. Будь-який існуючий файл з назвою custompanel_backup.xml буде втрачено.

source: Quit Stepconf and discard changes?
uk: Вийти з Stepconf та скасувати зміни?

source: The configuration has been built and saved. Do you want to quit?
uk: Конфігурацію зібрано та збережено. Ви хочете вийти?

source: You are using a simulated-realtime version of LinuxCNC, so testing / tuning of hardware is unavailable.
uk: Ви використовуєте версію LinuxCNC у режимі реального часу з імітацією, тому тестування/налаштування обладнання недоступне.

source: You are using a realtime version of LinuxCNC but didn't load a realtime kernel so testing / tuning of hardware is unavailable. This is possibly because you updated the OS and it doesn't automatically load the RTAI kernel anymore. You are using the {} kernel. You need to use kernel:
uk: Ви використовуєте версію LinuxCNC для роботи в режимі реального часу, але не завантажили ядро для роботи в режимі реального часу, тому тестування/налаштування апаратного забезпечення недоступне. Можливо, це сталося через те, що ви оновили ОС, і вона більше не завантажує ядро RTAI автоматично. Ви використовуєте ядро {}. Вам потрібно використовувати ядро:

source: my-mill
uk: мій млин

source: File %r was modified since it was written by stepconf
uk: Файл %r було змінено з моменту його створення stepconf

source: Saving this configuration file will discard configuration changes made outside stepconf.
uk: Збереження цього файлу конфігурації призведе до скасування змін конфігурації, внесених поза межами stepconf.

source: Continue?
uk: Продовжити?

source: launch %s
uk: запуск %s

source: Desktop Launcher for LinuxCNC config made by Stepconf
uk: Запуск робочого столу для конфігурації LinuxCNC, створеної Stepconf

source: Loading configuration error: {}
uk: Помилка завантаження конфігурації: {}

source: Other
uk: Інше

source: %s Axis Test
uk: %s Тест осі

source: mm / s
uk: мм/с

source: mm / s²
uk: мм / с²

source: in / s
uk: в/с

source: in / s²
uk: в / с²

source: LinuxCNC 'stepconf' configuration files
uk: Файли конфігурації LinuxCNC 'stepconf'

source: Modify Existing Configuration
uk: Змінити існуючу конфігурацію

source: degree / rev
uk: градус / обертів

source: Steps / deg
uk: Кроки / ти

source: mm / rev
uk: мм / оберт

source: Steps / mm
uk: Кроки / мм

source: rev / in
uk: об / в

source: Steps / in
uk: Кроки / дюйми

source: # Generated by stepconf 1.1 at %s
uk: # Згенеровано stepconf 1.1 о %s

source: # If you make changes to this file, they will be
uk: # Якщо ви внесете зміни до цього файлу, вони будуть

source: # overwritten when you run stepconf again
uk: # перезаписується при повторному запуску stepconf

source: # add halui MDI commands here (max 64)
uk: # додати сюди команди halui MDI (максимум 64)

source: # **** Setup for external estop ladder program -START ****
uk: # **** Налаштування зовнішньої програми estop-рейдингу -ПУСК ****

source: # **** Setup for external estop ladder program -END ****
uk: # **** Налаштування зовнішньої програми estop-рейдингу -КІНЕЦЬ ****

source: # Load Classicladder with Modbus master included (GUI must run for Modbus)
uk: # Завантаження Classicladder з включеним Modbus master (графічний інтерфейс має бути запущений для Modbus)

source: # Load Classicladder without GUI (can reload LADDER GUI in AXIS GUI
uk: # Завантаження Classicladder без графічного інтерфейсу (можна перезавантажити графічний інтерфейс LADDER у графічному інтерфейсі AXIS

source: Include your PyVCP panel here.
uk: Додайте сюди свою панель PyVCP.

source: # These files are loaded post GUI, in the order they appear
uk: # Ці файли завантажуються після графічного інтерфейсу в порядку їх появи

source: # **** Setup of spindle speed display using pyvcp -START ****
uk: # **** Налаштування відображення швидкості шпинделя за допомогою pyvcp -START ****

source: # **** Use ACTUAL spindle velocity from spindle encoder
uk: # **** Використовуйте ДІЙСНУ швидкість шпинделя з датчика шпинделя

source: # **** spindle-velocity-feedback-rps bounces around so we filter it with lowpass
uk: # **** spindle-velocity-feedback-rpm відскакує, тому ми фільтруємо його низькочастотним засобом

source: # **** spindle-velocity-feedback-rps is signed so we use absolute component to remove sign
uk: # **** spindle-velocity-feedback-rps має знак, тому ми використовуємо абсолютну складову для видалення знака

source: # **** ACTUAL velocity is in RPS not RPM so we scale it.
uk: # **** ДІЙСНА швидкість вказана в обертах за секунду, а не в хвилинах за хвилину, тому ми її масштабуємо.

source: # **** set up spindle at speed indicator ****
uk: # **** налаштування шпинделя на індикатор швидкості ****

source: # **** Use COMMANDED spindle velocity from LinuxCNC because no spindle encoder was specified
uk: # **** Використовувати ЗАВАНТАЖЕНУ швидкість шпинделя з LinuxCNC, оскільки не було вказано енкодер шпинделя

source: # Include your %s HAL commands here
uk: # Додайте сюди ваші %s HAL-команди

source: # This file will not be overwritten when you run stepconf again
uk: # Цей файл не буде перезаписано під час повторного запуску stepconf

source: # This file sets up simulated limits/home/spindle encoder hardware.
uk: # Цей файл налаштовує імітацію обмежень/дому/апаратури шпиндельного енкодера.

source: # This is a generated file do not edit.
uk: # Це згенерований файл, не редагуйте.

source: # Include your custom HAL commands here
uk: # Додайте сюди власні команди HAL

source: # The following variables are available for fine tuning some parameters.
uk: # Для точного налаштування деяких параметрів доступні наступні змінні.

source: # To use any of these, uncomment the required setp line and set an appropriate value.
uk: # Щоб скористатися будь-яким із них, розкоментуйте потрібний рядок setp та встановіть відповідне значення.

source: # Dampen excessive noise on the arc voltage input
uk: # Зменшення надмірного шуму на вході дугової напруги

source: # default = 0 (volts)
uk: # за замовчуванням = 0 (вольт)

source: # The time delay from losing the arc ok signal until QtPlasmaC reacts to the arc loss.
uk: # Часова затримка від втрати сигналу «дуга в порядку» до реакції QtPlasmaC на втрату дуги.

source: # default = 0.0 (seconds)
uk: # за замовчуванням = 0.0 (секунди)

source: # For mode 0 Arc-OK only, the number of consecutive readings within the threshold that are required to set the Arc-OK signal.
uk: # Тільки для режиму 0 Arc-OK, кількість послідовних показників у межах порогового значення, необхідних для встановлення сигналу Arc-OK.

source: # default = 6
uk: # за замовчуванням = 6

source: # For mode 0 Arc-OK only, the maximum voltage deviation that is allowed for a valid voltage to set the Arc OK signal.
uk: # Тільки для режиму 0 Arc-OK, максимальне відхилення напруги, дозволене для дійсної напруги для встановлення сигналу Arc OK.

source: # default = 10 (volts)
uk: # за замовчуванням = 10 (вольт)

source: # The voltage above and below 0V that will display as 0V. Prevents small fluctuations from flickering the voltage display.
uk: # Напруга вище та нижче 0 В, яка відображатиметься як 0 В. Запобігає мерехтінню дисплея напруги, спричиненому невеликими коливаннями.

source: # The distance (in millimeters) away from the Z MAX_LIMIT that QtPlasmaC will allow the Z axis to travel while under machine control.
uk: # Відстань (у міліметрах) від Z MAX_LIMIT, на якій QtPlasmaC дозволить переміщення осі Z під керуванням машини.

source: # default = 5 (mm)
uk: # за замовчуванням = 5 (мм)

source: # The required number of consecutive times that the threshold has been exceeded before applying the void lock to the THC.
uk: # Необхідна кількість послідовних перевищень порогу перед застосуванням блокування порожнечі до THC.

source: # default = 2
uk: # за замовчуванням = 2

source: # Include your custom_postgui HAL commands here
uk: # Додайте сюди ваші команди HAL custom_postgui

source: Mach configuration files
uk: Файли конфігурації Mach

source: mm/s
uk: мм/с

source: Jog:
uk: Так:

source: Test Area:
uk: Тестова зона:

source: mm/s^2
uk: мм/с^2

source: Acceleration:
uk: Прискорення:

source: Stepconf -Stepper Configuration Wizard
uk: Майстер налаштування Stepconf - Stepper

source: label
uk: етикетка

source: Back
uk: Назад

source: This program creates configuration files (INI and HAL) for "step and direction" milling machines and lathes connected to the PC parallel port. Stepconf requires a minimum 800 X 600 display resolution.
uk: Ця програма створює файли конфігурації (INI та HAL) для фрезерних та токарних верстатів з покроковим керуванням, підключених до паралельного порту ПК. Для Stepconf потрібна мінімальна роздільна здатність дисплея 800 X 600.

source: Page 1
uk: Сторінка 1

source: XZ (Lathe)
uk: XZ (Токарний верстат)

source: XYUV (Foam)
uk: XYUV (Піна)

source: XY(special)
uk: XY(спеціальний)

source: Step _Time:
uk: Крок _Час:

source: Step _Space:
uk: Крок _Простір:

source: Direction _Hold:
uk: Напрямок _Утримувати:

source: _Direction Setup:
uk: _Налаштування напрямку:

source: Driver Timing Settings
uk: Налаштування синхронізації драйвера

source: _Test Base Period Jitter
uk: _Тестова база Період тремтіння

source: D_river type:
uk: Тип драйвер:

source: One Parport
uk: Один Паркпорт

source: Two Parports
uk: Два парки

source: Three Parports
uk: Три парки

source: Min Base Period:
uk: Мій базовий період:

source: Max step rate:
uk: Максимальна кількість кроків:

source: Machine _Name:
uk: Назва_машини:

source: Configuration directory:
uk: Каталог конфігурації:

source: _Axis configuration:
uk: _Конфігурація осі:

source: Reset Default machine _units:
uk: Скинути значення одиниць машини за замовчуванням:

source: Driver characteristics: (Multiply by 1000 for times specified in µs or microseconds)
uk: Характеристики драйвера: (Помножте на 1000 для часу, зазначеного в мкс або мікросекундах)

source: Base Period Maximum _Jitter:
uk: Максимальне коливання базового періоду:

source: Create a new configuration
uk: Створити нову конфігурацію

source: Do you wish to:
uk: Ви бажаєте:

source: Modify a configuration already created with this program
uk: Змінити конфігурацію, вже створену за допомогою цієї програми

source: Import a Mach file
uk: Імпорт файлу Mach

source: Create a desktop _shortcut (symlink) to configuration files
uk: Створіть ярлик (символічне посилання) на файли конфігурації на робочому столі

source: Create a desktop _launcher to start LinuxCNC with this configuration
uk: Створіть _launcher на робочому столі для запуску LinuxCNC з цією конфігурацією

source: Create simulated hardware configuration
uk: Створення імітації конфігурації обладнання

source: If you have made modifications to this configuration outside this program, they will be lost when you select "Modify a configuration"
uk: Якщо ви внесли зміни до цієї конфігурації поза цією програмою, вони будуть втрачені після вибору опції «Змінити конфігурацію»

source: Xylotex
uk: Ксилотекс

source: TB6560 3 axes
uk: TB6560 3 осі

source: TB6560 4 axes
uk: TB6560 4 осі

source: Pin _1:
uk: Закріпити _1:

source: Pin _2:
uk: Закріпити _2:

source: Pin _4:
uk: Закріпити _4:

source: Pin _3:
uk: Закріпити _3:

source: Pin _5:
uk: Закріпити _5:

source: Pin _6:
uk: Закріпити _6:

source: Pin _7:
uk: Закріпити _7:

source: Pin _8:
uk: Закріпити _8:

source: Pin _9:
uk: Закріпити _9:

source: _Pin 14:
uk: _Закріпити 14:

source: P_in 16:
uk: Закріпити 16:

source: Pi_n 17:
uk: Закріпити 17:

source: Outputs (PC to Mill):
uk: Виходи (з ПК на фрезерний стан):

source: Invert
uk: Інвертувати

source: Pin 1_0:
uk: Закріпити 1_0:

source: Pin 1_1:
uk: Закріпити 1_1:

source: Pin 1_2:
uk: Закріпити 1_2:

source: Pin 1_3:
uk: Закріпити 1_3:

source: Pin 1_5:
uk: Закріпити 1_5:

source: Inputs (Mill to PC):
uk: Входи (від фрезера до ПК):

source: Parport _Base Address:
uk: Базова адреса Parport:

source: Output pinout presets:
uk: Попередні налаштування виводів:

source: Out
uk: Вихід

source: In
uk: У

source: Enter 0 Hz for "PDM" mode
uk: Введіть 0 Гц для режиму "PDM"

source: PWM _Rate:
uk: PWM _Оцінка:

source: _Speed 1:
uk: _Швидкість 1:

source: S_peed 2:
uk: Швидкість 2:

source: Calibration:
uk: Калібрування:

source: _Cycles per revolution:
uk: Цикли за оберт:

source: Speed display filter gain:
uk: Підсилення фільтра відображення швидкості:

source: Use spindle-at-speed:
uk: Використовуйте шпиндель зі швидкістю:

source: Scale %
uk: Масштаб %

source: Axis
uk: Вісь

source: Gmoccapy
uk: Гмокапі

source: Qtdragon
uk: Ктдрагон

source: Screen:
uk: Екран:

source: Screen Aspect:
uk: Співвідношення сторін екрана:

source: Estop Button:
uk: Кнопка «Стоп»:

source: Hidden
uk: Прихований

source: Button
uk: Кнопка

source: Indicator
uk: Індикатор

source: Bottom
uk: Вниз

source: Top
uk: Верх

source: Powermax Port:
uk: Порт Powermax:

source: Mode:
uk: Режим:

source: DRO Position:
uk: Посада DRO:

source: Flash Error Message:
uk: Повідомлення про помилку спалаху:

source: Hide Start Button:
uk: Приховати кнопку «Пуск»:

source: Hide Pause Button:
uk: Приховати кнопку паузи:

source: Hide Stop Button:
uk: Приховати кнопку «Стоп»:

source: _Onscreen prompt for manual tool change
uk: _Екранна підказка для ручної зміни інструменту

source: Include custom PyVCP GUI panel
uk: Включити власну панель графічного інтерфейсу PyVCP

source: Blank program
uk: Пуста програма

source: Spindle speed display
uk: Відображення швидкості шпинделя

source: Existing custom program
uk: Існуюча користувацька програма

source: Include connections to HAL
uk: Включити підключення до HAL

source: _Display sample panel
uk: _Відображення зразка панелі

source: Set pyVCP options
uk: Встановлення параметрів pyVCP

source: Include _Classicladder PLC
uk: Включити ПЛК _Classicladder

source: Number of digital in pins:
uk: Кількість цифрових входів:

source: Number of digital out pins:
uk: Кількість цифрових вихідних контактів:

source: Number of analog (s32) in pins:
uk: Кількість аналогових (s32) виводів:

source: Number of analog (s32) out pins:
uk: Кількість аналогових вихідних контактів (s32):

source: Number of analog (float) in pins:
uk: Кількість аналогових (float) виводів:

source: Number of analog (float) out pins:
uk: Кількість аналогових (плаваючих) вихідних контактів:

source: setup number of external pins
uk: налаштувати кількість зовнішніх контактів

source: Include Modbus master support
uk: Включити підтримку головного Modbus

source: Blank ladder program
uk: Програма пустих сходів

source: Estop ladder program
uk: Програма «Зупинити сходи»

source: Serial Modbus program
uk: Програма послідовного Modbus

source: Edit ladder program
uk: Редагувати програму сходів

source: Set Ladder Options
uk: Встановлення параметрів сходів

source: Include Halui user interface component
uk: Включити компонент інтерфейсу користувача Halui

source: Insert here some commands to put after MDI_COMMAND
uk: Вставте тут кілька команд, які слід розмістити після MDI_COMMAND

source: ADD
uk: ДОДАТИ

source: DELETE
uk: ВИДАЛИТИ

source: Move UP
uk: Перемістити ВГОРУ

source: Move Down
uk: Перемістити вниз

source: NAME
uk: ІМ'Я

source: CODE
uk: КОД

source: 2 (W1 down)
uk: 2 (W1 вниз)

source: 2 (W1 up)
uk: 2 (W1 вгору)

source: Full Scale Freq (kHz)
uk: Повна шкала частоти (кГц)

source: F Jumper
uk: Джемпер F

source: Divider Ratio or Series Resistance
uk: Коефіцієнт дільника або послідовний опір

source: 0V Freq (kHz)
uk: Частота 0 В (кГц)

source: Model
uk: Модель

source: THCAD For Arc Voltage
uk: THCAD для напруги дуги

source: Same
uk: Те саме

source: Opposite
uk: Навпроти

source: T_est this axis
uk: Перевірте цю вісь

source: _Motor steps per revolution:
uk: _Кроки двигуна за оберт:

source: _Driver Microstepping:
uk: _Мікрокрокове керування драйвером:

source: _Pulley teeth (Motor:Leadscrew):
uk: Зубці шківа (двигун: ходовий гвинт):

source: _Leadscrew Pitch:
uk: Крок ходового гвинта:

source: Maximum _Velocity:
uk: Максимальна швидкість:

source: Maximum _Acceleration:
uk: Максимальне _прискорення:

source: _Home location:
uk: Домашнє місцезнаходження:

source: Tab_le travel:
uk: Подорожі таблиці:

source: Home _Switch location:
uk: Розташування домашнього перемикача:

source: Home Sear_ch velocity:
uk: Швидкість пошуку на головній сторінці:

source: Home La_tch direction:
uk: Напрямок головної засувки:

source: Time to accelerate to max speed:
uk: Час розгону до максимальної швидкості:
