Repository: LinuxCNC/linuxcnc
Catalog: src/po/*.po
Languages: uk

source: found free step=%d!!!
uk: знайдено вільний крок = %d!!!

source: found free transi=%d!!!
uk: знайдено вільних транзитів=%d!!!

source: found free comment=%d!!!
uk: знайдено безкоштовний коментар=%d!!!

source: Do link : transi=%d (top=%d), step=%d
uk: Виконати посилання: transi=%d (top=%d), step=%d

source: There is already a step to deactivate for this transition (clicked on top part)...
uk: Для цього переходу вже є крок для деактивації (натиснуто у верхній частині)...

source: There is already a step to activate for this transition (clicked on bottom part)...
uk: Для цього переходу вже є крок для активації (натиснуто в нижній частині)...

source: Not selected first and last transitions to be joined !!??
uk: Не вибрано перший та останній переходи для об'єднання!!??

source: Unknown element type for Ele1
uk: Невідомий тип елемента для Ele1

source: First and last steps selected are not on the same line !!??
uk: Перший та останній вибрані кроки не знаходяться на одному рядку!!??

source: First and last transitions selected are not on the same line !!??
uk: Перший та останній вибрані переходи не знаходяться на одному рядку!!??

source: Unknown element type for Ele2
uk: Невідомий тип елемента для Ele2

source: commonsearch: leftX=%d, rightX=%d, OffTransi=%d, StepsY=%d, TransiY=%d
uk: спільний пошук: leftX=%d, rightX=%d, OffTransi=%d, StepsY=%d, TransiY=%d

source: Error in selection or not possible...
uk: Помилка у виборі або неможливо...

source: DO ACT/DESACT STEPS x1=%d, x2=%d, y=%d
uk: ВИКОНАЙТЕ/УСУНЬТЕ КРОКИ x1=%d, x2=%d, y=%d

source: having num transi linked=%d for transi=%d
uk: маючи кількість транзитів, пов'язаних з %d, для транзитів = %d

source: ->storing num transi linked=%d for transi=%d
uk: ->зберігання кількості транзитів linked=%d для транзитів=%d

source: =>step to activ=%d, step to desactiv=%d
uk: =>крок до активації=%d, крок до деактивації=%d

source: Not found at least 2 transitions linked...
uk: Не знайдено щонайменше 2 пов'язаних переходів...

source: Sequential memory full for steps
uk: Послідовна пам'ять заповнена для кроків

source: There is already an element!
uk: Вже є елемент!

source: A step can't be placed on even lines
uk: Крок не можна розмістити на парних лініях

source: Sequential memory full for transition
uk: Послідовна пам'ять заповнена для переходу

source: A transition can't be placed on odd lines
uk: Перехід не можна розміщувати на непарних рядках

source: nbr clicks=1!!! (posi=%s), wait next point to link...
uk: кількість кліків=1!!! (позиція=%s), чекати наступної точки для зв'язку...

source: top
uk: верх

source: bottom
uk: вниз

source: Now select the transition.
uk: Тепер виберіть перехід.

source: Now select the step that will be deactivated by this transition.
uk: Тепер виберіть крок, який буде деактивовано цим переходом.

source: Now select the step that will be activated by this transition.
uk: Тепер виберіть крок, який буде активовано цим переходом.

source: You haven't selected a step or a transition to link!!!
uk: Ви не вибрали крок або перехід для посилання!!!

source: You haven't selected a transition and then the step to link!!!
uk: Ви не вибрали перехід, а потім крок для зв'язування!!!

source: Sequential memory full for comments
uk: Послідовна пам'ять заповнена для коментарів

source: There is already an element on 4 horizontal blocks required!
uk: Вже є елемент на 4 горизонтальних блоках, потрібно!

source: Not enough room on the right here...
uk: Тут праворуч місця замало...

source: Properties
uk: Властивості

source: Apply
uk: Застосувати

source: Error blank symbol name
uk: Назва пустого символу помилки

source: Error unknown symbol name
uk: Назва невідомого символу помилки

source: out of bounds variable number
uk: номер змінної поза межами

source: None -Internal Memory
uk: Немає - Внутрішня пам'ять

source: None -Internal Error Status
uk: Немає - Стан внутрішньої помилки

source: None
uk: Немає

source: error
uk: помилка

source: no signal connected
uk: немає підключеного сигналу

source: Conv. HAL signal ERROR
uk: ПОМИЛКА сигналу HAL перетворення

source: No expression
uk: Без виразу обличчя

source: %s (for %s) Exprsn~ %s
uk: %s (для %s) Вираз~ %s

source: first var. expression error
uk: помилка виразу першої змінної

source: Old Timer
uk: Старий Таймер

source: New Timer
uk: Новий таймер

source: One-shot
uk: Одноразовий

source: Counter
uk: Лічильник

source: Error Flag Bit
uk: Біт прапорця помилки

source: Cannot auto assign symbol names-wrong variable name
uk: Неможливо автоматично призначити назви символів – неправильна назва змінної

source: Rung version not supported...
uk: Версія Rung не підтримується...

source: Loading file : %s
uk: Завантаження файлу: %s

source: - ok.
uk: - добре.

source: - not found.
uk: - не знайдено.

source: Saving file : %s
uk: Збереження файлу: %s

source: - failed.
uk: - невдало.

source: Used=%d
uk: Використано=%d

source: !!!Error in ConvBaseInMilliSecsToInt()
uk: !!!Помилка в ConvBaseInMilliSecsToInt()

source: !!! Error loading parameter base in %s
uk: !!! Помилка завантаження бази параметрів у %s

source: Timer => Base = %d , Preset = %d
uk: Таймер => Базовий = %d, Попередньо встановлено = %d

source: - result=%d
uk: - результат=%d

source: Monostable => Base = %d , Preset = %d
uk: Моностабільний => Базовий = %d, Попередньо встановлений = %d

source: Sections file version not supported...
uk: Версія файлу розділів не підтримується...

source: Section %d => Name=%s, Language=%d, SRnbr=%d, FirstRung=%d, LastRung=%d, SequentialPage=%d
uk: Розділ %d => Ім'я=%s, Мова=%d, SRnbr=%d, FirstRung=%d, LastRung=%d, SequentialPage=%d

source: Symbols file version not supported...
uk: Версія файлу символів не підтримується...

source: Symbol: %s - %s - %s
uk: Символ: %s - %s - %s

source: ERROR with path directory given for project !!!
uk: ПОМИЛКА зі шляхом, вказаним для каталогу проекту !!!

source: Save project '%s' from tmp dir=%s
uk: Зберегти проект '%s' з тимчасової папки dir=%s

source: Sequential version not supported...
uk: Послідовна версія не підтримується...

source: Main
uk: Головне

source: Sequential
uk: Послідовний

source: Ladder
uk: Драбина

source: This section name already exists or is incorrect !!!
uk: Ця назва розділу вже існує або неправильна !!!

source: This sub-routine number for calls is already defined !!!
uk: Цей номер підпрограми для викликів вже визначено !!!

source: Failed to add a new section. Full?
uk: Не вдалося додати новий розділ. Повний?

source: Not possible when program running...
uk: Неможливо під час роботи програми...

source: Add a new section...
uk: Додати новий розділ...

source: Modify current section
uk: Змінити поточний розділ

source: Do you really want to delete the section ?
uk: Ви справді хочете видалити цей розділ?

source: You can not delete the last section...
uk: Ви не можете видалити останній розділ...

source: This section is already executed the first !
uk: Цей розділ вже виконано першим!

source: This section is already executed the latest !
uk: Цей розділ вже виконано в останню чергу!

source: Language
uk: Мова

source: Main/Sub-Routine
uk: Основна/Підпрограма

source: Name
uk: Ім'я

source: Sections Manager
uk: Менеджер розділів

source: ERROR CLASSICLADDER- MODBUS-EXCEPTION RECEIVED:%X (Excep=%X)
uk: ПОМИЛКА CLASSICLADDER – ОТРИМАНО ВИМКНЕННЯ MODBUS: %X (Виняток=%X)

source: ERROR CLASSICLADDER- MODBUS -Function code received from slave was not the same as requested!
uk: ПОМИЛКА CLASSICLADDER- MODBUS - Код функції, отриманий від підлеглого пристрою, не збігався із запитуваним!

source: INFO CLASSICLADDER- MODBUS -Echo back from slave #%s is correct (data=257).
uk: INFO CLASSICLADDER- MODBUS -Відлуння від підлеглого пристрою #%s правильне (дані=257).

source: INFO CLASSICLADDER- MODBUS function code not recognized
uk: INFO CLASSICLADDER – код функції MODBUS не розпізнано

source: INFO CLASSICLADDER- MODBUS Length we should receive=%d (+3)
uk: INFO CLASSICLADDER- MODBUS Довжина, яку ми повинні отримати = %d (+3)

source: INFO CLASSICLADDER- Modbus I/O to send (Hex): Length=%d bytes ->
uk: INFO CLASSICLADDER- Введення/виведення Modbus для надсилання (шістнадцяткове значення): Довжина=%d байтів ->

source: Slave: %X
uk: Раб: %X

source: Function: %X Data:
uk: Функція: %X Дані:

source: INFO CLASSICLADDER- Modbus I/O received (Hex): Length=%d bytes <-
uk: INFO CLASSICLADDER- Отримано введення/виведення Modbus (шістнадцяткове значення): Довжина = %d байтів <-

source: Function: %X Data:
uk: Функція: %X Дані:

source: ERROR CLASSICLADDER- MODBUS-INCORRECT RESPONSE RECEIVED FROM SLAVE!!!
uk: ПОМИЛКА CLASSICLADDER- MODBUS - ОТРИМАНО НЕПРАВИЛЬНУ ВІДПОВІДЬ ВІД ПІДРЯДЖЕНОГО ПРИСТРОЮ!!!

source: ERROR CLASSICLADDER- MODBUS-LOW LEVEL ERROR IN RESPONSE!!!
uk: ПОМИЛКА CLASSICLADDER- MODBUS - ПОМИЛКА НИЗЬКОГО РІВНЯ У ВІДПОВІДІ!!!

source: Serial speed value %d not found for serial
uk: Значення швидкості серійного порту %d не знайдено для серійного порту

source: Failed to open serial port %s...
uk: Не вдалося відкрити послідовний порт %s...

source: Set RTS=%d
uk: Набір RTS=%d

source: Serial writing...
uk: Серійне написання...

source: Writing done!
uk: Писати завершено!

source: Serial config...
uk: Послідовна конфігурація...

source: select() for serial reading...
uk: select() для послідовного читання...

source: Serial reading...
uk: Серійне зчитування...

source: %d chars found
uk: Знайдено %d символів

source: Serial flush all!
uk: Серійний промивка всього!

source: ERROR CLASSICLADDER- Failed to create thread I/O Modbus master...
uk: ПОМИЛКА CLASSICLADDER- Не вдалося створити головний пристрій Modbus вводу/виводу потоку...

source: INFO CLASSICLADDER---I/O Modbus master Data bits %i Stop bits %i Parity %i
uk: INFO CLASSICLADDER---Вхід/вихід головний Modbus Біти даних %i Стоп-біти %i Парність %i

source: INFO CLASSICLADDER---I/O Modbus master (%s) init ok !
uk: INFO CLASSICLADDER---Ініціалізація головного пристрою Modbus вводу/виводу (%s) пройшла успішно!

source: Serial
uk: Серійний

source: Init socket for I/O module (%d)...
uk: Ініціальний сокет для модуля вводу/виводу (%d)...

source: Failed to open I/O socket master...
uk: Не вдалося відкрити головний сокет вводу/виводу...

source: Connecting I/O module...
uk: Підключення модуля вводу/виводу...

source: Not able to retrieve IP address in Modbus table, huhh?!!!
uk: Не можу отримати IP-адресу в таблиці Modbus, га?!!!

source: Failed to connect to I/O module
uk: Не вдалося підключитися до модуля вводу/виводу

source: Too much IP connections under run...
uk: Занадто багато IP-з'єднань задіяно...

source: INFO CLASSICLADDER- Sending frame to I/O module...
uk: INFO CLASSICLADDER- Надсилання кадру до модуля вводу/виводу...

source: ERROR CLASSICLADDER- FAILED TO SEND ON SOCKET !!!(LgtSend=%d)
uk: ПОМИЛКА CLASSICLADDER- НЕ МОЖНА НАДІСЛАТИ НА СОКЕТ!!! (LgtSend=%d)

source: INFO CLASSICLADDER- waiting for slave response...
uk: INFO CLASSICLADDER- чекаю на відповідь раба...

source: INFO CLASSICLADDER---I/O Modbus master closed!
uk: INFO CLASSICLADDER---Головний пристрій вводу/виводу Modbus закрито!

source: INFO CLASSICLADDER- after transmit delay now...%i milliseconds
uk: INFO CLASSICLADDER – після затримки передачі тепер...%i мілісекунд

source: ERROR CLASSICLADDER- MODBUS NO RESPONSE (Errs=%d/%d) !?
uk: ПОМИЛКА CLASSICLADDER- MODBUS НЕМАЄ ВІДПОВІДІ (Errs=%d/%d) !?

source: INFO CLASSICLADDER--- INIT SOCKET!!!
uk: ІНФОРМАЦІЯ ПРО КЛАСИЧНИЙ ДОБІР --- ІНІЦІАЛЬНИЙ РОЗЕТ!!!

source: ERROR CLASSICLADDER--- Failed to open socket server...
uk: ПОМИЛКА CLASSICLADDER--- Не вдалося відкрити сокет-сервер...

source: ERROR CLASSICLADDER--- Failed to bind socket server...(error=%s)
uk: ПОМИЛКА CLASSICLADDER--- Не вдалося прив'язати сокет-сервер...(помилка=%s)

source: ERROR CLASSICLADDER--- Failed to listen socket server...(error=%s)
uk: ПОМИЛКА CLASSICLADDER--- Не вдалося прослухати сокет-сервер...(помилка=%s)

source: ERROR CLASSICLADDER--- Failed to create thread socket server...
uk: ПОМИЛКА CLASSICLADDER--- Не вдалося створити сервер сокетів потоків...

source: INFO CLASSICLADDER--- Server socket init ok (modbus - port %d)!
uk: INFO CLASSICLADDER--- Ініціалізація сокета сервера пройшла успішно (modbus - порт %d)!

source: INFO CLASSICLADDER--- MODBUS RESPONSE LGT=%d+%d !
uk: ІНФОРМАЦІЯ ПРО КЛАСИЧНУ ДИСКУ--- ВІДПОВІДЬ MODBUS LGT=%d+%d !

source: INFO MODBUS SERVER--- SOCKET WAITING...
uk: ІНФОРМАЦІЯ ПРО СЕРВЕР MODBUS --- ОЧІКУВАННЯ РОЗЕТКИ...

source: INFO MODBUS SERVER--- SOCKET CLIENT ACCEPTED...
uk: ІНФОРМАЦІЯ ПРО СЕРВЕР MODBUS --- КЛІЄНТ РОЗЕТУ ПРИЙНЯТО...

source: INFO MODBUS SERVER--- SOCKET RECEIVED=%d !
uk: ІНФОРМАЦІЯ ПРО СЕРВЕР MODBUS --- РОЗЕТ ОТРИМАНО=%d !

source: ERROR CLASSICLADDER--- Failed to recv socket server...(error=%s)
uk: ПОМИЛКА CLASSICLADDER--- Не вдалося отримати сокет-сервер...(помилка=%s)

source: INFO MODBUS SERVER--- CLOSE SOCK CLIENT.
uk: ІНФОРМАЦІЯ ПРО СЕРВЕР MODBUS --- ЗАКРИТИ SOCK-КЛІЄНТ.

source: INFO CLASSICLADDER--- Server socket closed!
uk: INFO CLASSICLADDER--- Сокет сервера закрито!

source: Bit Status Window
uk: Вікно стану біта

source: Offset for vars displayed below (press return to apply)
uk: Зсув для змінних, що відображаються нижче (натисніть Enter, щоб застосувати)

source: Watch Window
uk: Вікно спостереження

source: A variable name always start with '%' character !
uk: Ім'я змінної завжди починається з '%' character !

source: opened SYMBOLS window. Press again to close
uk: відкрите вікно СИМВОЛИ. Натисніть ще раз, щоб закрити

source: Symbols names
uk: Назви символів

source: Unknown symbol for variable name
uk: Невідомий символ для назви змінної

source: Unknown variable (number value out of bound)
uk: Невідома змінна (числове значення поза межами допустимого діапазону)

source: Unknown variable (missing '.' character before attribute)
uk: Невідома змінна (відсутній символ '.' перед атрибутом)

source: Unknown variable (unknown attribute)
uk: Невідома змінна (невідомий атрибут)

source: Unknown variable (on first character following %)
uk: Невідома змінна (на першому символі після %)

source: Unknown variable (global error)
uk: Невідома змінна (глобальна помилка)

source: LinuxCNC Calibration
uk: Калібрування LinuxCNC

source: Save To File
uk: Зберегти у файл

source: File
uk: Файл

source: Refresh
uk: Оновити

source: INI Name
uk: Назва INI

source: HAL's Value
uk: Значення HAL

source: Next Value
uk: Наступне значення

source: Test
uk: Тест

source: Not permitted to save here. You need to copy a configuration to your home directory and work there.
uk: Збереження тут заборонено. Вам потрібно скопіювати конфігурацію до вашого домашнього каталогу та працювати там.

source: can't save %s
uk: не вдається зберегти %s

source: LinuxCNC Debug
uk: Налагодження LinuxCNC

source: Invalid INI file entries
uk: Недійсні записи INI-файлу

source: Configuration information
uk: Інформація про конфігурацію

source: Use of defaults
uk: Використання значень за замовчуванням

source: Version information
uk: Інформація про версію

source: Command issuing
uk: Видача команди

source: IO points
uk: Очки вводу-виводу

source: Motion time
uk: Час руху

source: Interpreter
uk: Перекладач

source: Trajectory level
uk: Рівень траєкторії

source: Interpreter list
uk: Список перекладачів

source: Open...
uk: Відкрити...

source: Save As...
uk: Зберегти як...

source: Exit
uk: Вихід

source: Edit
uk: Редагувати

source: Cut
uk: Вирізати

source: Copy
uk: Копіювати

source: Paste
uk: Вставити

source: Select All
uk: Вибрати все

source: Help
uk: Допомога

source: About...
uk: Про...

source: Save and Reload
uk: Зберегти та перезавантажити

source: Find...
uk: Знайти...

source: Renumber File...
uk: Перенумерувати файл...

source: Settings
uk: Налаштування

source: No Numbering
uk: Без нумерації

source: Line Numbering...
uk: Нумерація рядків...

source: Scripts
uk: Скрипти

source: About TkEditor
uk: Про TkEditor

source: TkEditor Simple Tcl/Tk Text Editor GPL Version 2
uk: TkEditor Простий текстовий редактор Tcl/Tk GPL версія 2

source: Find
uk: Знайти

source: Find:
uk: Знайти:

source: Replace:
uk: Замінити:

source: Find All
uk: Знайти всі

source: Replace All
uk: Замінити все

source: Skip This
uk: Пропустити це

source: Replace This
uk: Замінити це

source: Clear
uk: Очистити

source: Set Line Numbering
uk: Встановити нумерацію рядків

source: Increment
uk: Приріст

source: One
uk: Один

source: Two
uk: Два

source: Five
uk: П'ять

source: Ten
uk: Десять

source: Space
uk: Космос

source: Single Space
uk: Одинарний простір

source: Double Space
uk: Подвійний пробіл

source: Tab Space
uk: Пробіл табуляції

source: Next Number:
uk: Наступний номер:

source: Renumber
uk: Перенумерувати

source: HAL Configuration
uk: Конфігурація HAL

source: Would you like to save your configuration before you exit?
uk: Бажаєте зберегти конфігурацію перед виходом?

source: Save All
uk: Зберегти все

source: Save Tune
uk: Зберегти мелодію

source: Save as Netlist
uk: Зберегти як список нетлів

source: Don't Save
uk: Не зберігати

source: Show
uk: Показати

source: Watch
uk: Дивитися

source: Save INI Tuning
uk: Зберегти налаштування INI

source: Save HAL Ini
uk: Зберегти HAL Ini

source: Save HAL Net
uk: Зберегти HAL Net

source: Save and Exit
uk: Зберегти та вийти

source: View
uk: Переглянути

source: Expand Tree
uk: Розгорнути дерево

source: Collapse Tree
uk: Згорнути дерево

source: Expand Pins
uk: Розгорнути піни

source: Expand Parameters
uk: Розгорнути параметри

source: Expand Signals
uk: Розгорнути сигнали

source: Erase Watch
uk: Стерти годинник

source: Enter HAL command :
uk: Введіть команду HAL:

source: Execute
uk: Виконати

source: Tune %d
uk: Налаштувати %d

source: The HAL parameter %s has changed. Really quit?
uk: Параметр HAL %s змінився. Дійсно вийти?

source: Select a node to show.
uk: Виберіть вузол для відображення.

source: <-- Select a Leaf. Click on its name.
uk: <-- Виберіть листок. Натисніть на його назву.

source: Click a highlighted entry where %s should go.
uk: Клацніть виділений запис, куди має поміститися %s.

source: Nothing to be done for parameters here. Try the tuning page
uk: Тут нічого не можна зробити з параметрами. Спробуйте сторінку налаштування

source: %s is not a leaf, try again
uk: %s не є листком, спробуйте ще раз

source: Copyright Raymond E Henry. 2006 License: GPL Version 2 Halconfig is an LinuxCNC configuration tool. It requires that you have started an instance of linuxcnc. This script carries no warranty or liability for its use to the extent allowed by law.
uk: Авторські права: Raymond E Henry. 2006 Ліцензія: GPL версія 2 Halconfig — це інструмент конфігурації LinuxCNC. Для його роботи необхідно запустити екземпляр linuxcnc. Цей скрипт не несе жодної гарантії або відповідальності за його використання в межах, дозволених законом.

source: Halshow
uk: Галшоу

source: SHOW
uk: ПОКАЗ

source: WATCH
uk: ДИВИТИСЯ

source: SETTINGS
uk: НАЛАШТУВАННЯ

source: Load Watch List
uk: Завантажити список спостереження

source: Save Watch List
uk: Зберегти список спостереження

source: Save Watch List (multiline)
uk: Зберегти список спостереження (багаторядковий)

source: Tree View
uk: Деревоподібний вигляд

source: Expand All
uk: Розгорнути все

source: Collapse All
uk: Згорнути все

source: Reload tree view
uk: Перезавантажити деревоподібний вигляд

source: Add pin
uk: Додати закріплення

source: Pin
uk: Закріпити

source: Add signal
uk: Додати сигнал

source: Signal
uk: Сигнал

source: Add parameter
uk: Додати параметр

source: Parameter
uk: Параметр

source: Reload Watch
uk: Перезавантажити годинник

source: Watchlist cleared
uk: Список спостереження очищено

source: Add to watch
uk: Додати до перегляду

source: added
uk: додано

source: Full path (regex)
uk: Повний шлях (регулярний вираз)

source: Filter tree
uk: Дерево фільтрів

source: HAL command :
uk: Команда HAL:

source: Update interval (in ms)
uk: Інтервал оновлення (у мс)

source: Column width for value in watch tab
uk: Ширина стовпця для значення на вкладці спостереження

source: Override format string (leave empty for default)
uk: Перевизначити рядок форматування (за замовчуванням залиште порожнім)

source: Float
uk: Поплавок

source: Integer
uk: Ціле число

source: Always on top (Note: May not working with all desktop environments)
uk: Завжди зверху (Примітка: Може працювати не з усіма середовищами робочого столу)

source: Remember watchlist
uk: Запам'ятати список спостереження

source: Settings stored in:
uk: Налаштування зберігаються в:

source: already in list
uk: вже у списку

source: Set to ..
uk: Встановлено на ..

source: Unlink pin
uk: Від’єднати закріплення

source: Show in Tree
uk: Показати в дереві

source: Remove
uk: Вилучити

source: Add as Pin(s)
uk: Додати як пін(и)

source: Add as Signal(s)
uk: Додати як сигнал(и)

source: Add as Param(s)
uk: Додати як параметр(и)

source: Add all sub-items to watch
uk: Додати всі підпункти для перегляду

source: Set
uk: Набір

source: User input
uk: Ввід користувача

source: Update interval for this session (ms)
uk: Інтервал оновлення для цього сеансу (мс)

source: Value out of range
uk: Значення поза діапазоном

source: removed from list
uk: вилучено зі списку

source: Load a watch list
uk: Завантажити список спостереження

source: loaded
uk: завантажений

source: saved backup for old watchlist in
uk: збережена резервна копія старого списку спостереження в

source: Save current watch list
uk: Зберегти поточний список спостереження

source: Commands may be tested here but they will NOT be saved
uk: Команди можна перевірити тут, але вони НЕ будуть збережені

source: Integer (disabled by "--iformat" argument)
uk: Ціле число (вимкнено аргументом "--iformat")

source: Float (disabled by "--fformat" argument)
uk: Число з плаваючою комою (вимкнено аргументом "--fformat")

source: "--noprefs" option set. Settings will not be saved!
uk: Встановлено параметр "--noprefs". Налаштування не будуть збережені!

source: Can't find the bwidget 1.7 package. There is a debian bwidget package; install it with sudo apt-get install bwidget.
uk: Не можу знайти пакет bwidget 1.7. Існує пакет bwidget для Debian; встановіть його за допомогою команди sudo apt-get install bwidget.

source: LinuxCNC Configuration Selector
uk: Вибір конфігурації LinuxCNC

source: No details available.
uk: Деталі недоступні.

source: Welcome to LinuxCNC. Select a machine configuration from the list on the left. Details about the selected configuration will appear in the display on the right. Click 'OK' to run the selected configuration
uk: Ласкаво просимо до LinuxCNC. Виберіть конфігурацію машини зі списку ліворуч. Детальна інформація про вибрану конфігурацію з'явиться на дисплеї праворуч. Натисніть «OK», щоб запустити вибрану конфігурацію

source: My Configurations
uk: Мої конфігурації

source: Sample Configurations
uk: Прості конфігурацій

source: ERROR: no configurations found in path '%s'
uk: ПОМИЛКА: у шляху '%s' не знайдено жодної конфігурації

source: Copy Configuration?
uk: Копіювати конфігурацію?

source: Would you like to copy the %s configuration to your home directory so you can customize it?
uk: Бажаєте скопіювати конфігурацію %s до вашого домашнього каталогу, щоб мати змогу налаштувати її?

source: Configuration Copied
uk: Конфігурацію скопійовано

source: The configuration file has been copied to %s. Next time, choose this location when starting LinuxCNC.
uk: Файл конфігурації скопійовано до %s. Наступного разу виберіть це місце під час запуску LinuxCNC.

source: Shortcut Created
uk: Ярлик створено

source: A shortcut to this configuration file has been created on your desktop. You can use it to automatically launch this configuration.
uk: Ярлик цього конфігураційного файлу створено на вашому робочому столі. Ви можете використовувати його для автоматичного запуску цієї конфігурації.

source: Create Desktop Shortcut
uk: Створити ярлик на робочому столі
