Repository: LinuxCNC/linuxcnc
Catalog: src/po/*_axis.po
Languages: es, pt_br

source: Emergency stop
es: Detener en Emergencia
pt_br: Parada de emergência

source: Turn machine on
es: Encender Maquina
pt_br: Partida

source: Activate first axis
es: Activar primer eje
pt_br: Ativa o primeiro eixo

source: Activate second axis
es: Activar segundo eje
pt_br: Ativa o segundo eixo

source: Activate third axis
es: Activar tercer eje
pt_br: Ativa o terceiro eixo

source: Activate fourth axis
es: Activar cuarto eje
pt_br: Ativa o quarto eixo

source: Activate fifth axis
es: Activar quinto eje
pt_br: Ativa o quinto eixo

source: Activate sixth axis
es: Activar sexto eje
pt_br: Ativa o sexto eixo

source: Set Feed Override from 0% to 100%
es: Control de avanze de 0% hasta 100%

source: , and .
es: , y .

source: Select jog speed
es: Elegir velocidad de avance

source: < and >
es: < y >

source: Select angular jog speed
es: Elegir velocidad angular

source: I, Shift-I
es: I, Ctrl-I

source: Select jog increment
es: Elegir incremento del avance
pt_br: Seleciona incremento de movimento

source: Continuous jog
es: Avance continuo
pt_br: Movimento contínuo

source: Home
es: Punto de referencia
pt_br: Posição de descanço

source: Send active axis home
es: Ejecutar Punto de referencia con eje activo
pt_br: Posiciona eixo ativo na posição de descanso

source: Ctrl-Home
es: Ctrl-Pos1

source: Home all axes
es: Restaurar todos los ejes

source: Shift-Home
es: Ctrl-Schift-Home

source: Zero G54 offset for active axis
es: Eliminar desplazamiento del punto de origen para el eje activo

source: End
es: Fin

source: Set G54 offset for active axis
es: Activar desplazamiento del punto de origen
pt_br: Ajuste offset G54 para o eixo ativo

source: Jog active axis
es: Correr eje activo

source: Left, Right
es: Izquierda, Derecha

source: Jog first axis
es: Correr primer eje
pt_br: Movimenta o primeiro eixo

source: Up, Down
es: Arriba, abajo

source: Jog second axis
es: Correr segundo eje
pt_br: Movimenta o segundo eixo

source: Pg Up, Pg Dn
es: Subir Pag., Bajar Pag.

source: Jog third axis
es: Correr tercer eje
pt_br: Movimenta o terceiro eixo

source: Jog fourth axis
es: Correr cuarto eje
pt_br: Movimenta o quarto eixo

source: Left Button
es: Boton izquierdo del raton
pt_br: Tecla Esquerda

source: Pan view or select line
es: Seleccionar linea o mover panorama
pt_br: Vista da bandeja ou seleciona linha

source: Shift+Left Button
es: Shift+Boton izquierdo del raton
pt_br: Tecla Shift+Left

source: Rotate view
es: Rotar perspectiva
pt_br: Gira o campo de visão

source: Right Button
es: Boton derecho del raton
pt_br: Tecla Direita

source: Zoom view
es: Acercar/Maximizar perspectiva
pt_br: Vista ampliada

source: Wheel Button
es: Rueda del Raton
pt_br: Botão scroll do mouse

source: Rotate Wheel
es: Girar rueda del Raton
pt_br: Gire o scroll do mouse

source: Control+Left Button
es: Ctrl+Boton izquierdo del raton

source: Manual control
es: Control manual
pt_br: Controle manual

source: Code entry (MDI)
es: Introducir tarea (MDI)
pt_br: Comando manual (MDI)

source: Control-M
es: Ctrl-M

source: Clear MDI history
es: Borrar historial MDI

source: Control-H
es: Ctrl-H

source: Copy selected MDI history elements
es: Copiar elementos seleccionados del historial MDI

source: to clipboard
es: al portapapeles

source: Control-Shift-H
es: Ctrl-Shift-H

source: Paste clipboard to MDI history
es: Pegar portapapeles en historial MDI

source: Override Limits
es: Exceder limites
pt_br: Ultrapassa o limite

source: Open program
es: Abrir programa
pt_br: Abre programa

source: Control-R
es: Ctrl-R

source: Reload program
es: Volver a cargar programa

source: Run program
es: Ejecutar Programa
pt_br: Roda o programa

source: Step program
es: Ejecutar programa por paso
pt_br: Roda um passo

source: Pause program
es: Pausar programa
pt_br: Pausa o programa

source: Resume program
es: Resumir programa
pt_br: Retoma o programa

source: Stop running program, or
es: Detener programa en proceso, o

source: stop loading program preview
es: Detener carga de vista preliminar del programa

source: Toggle mist
es: Neblina encender/apagar
pt_br: Sopro on/off

source: Toggle flood
es: Medio enfriador activar/desactivar
pt_br: Jorro de líquido on/off

source: Spindle brake off
es: Apagar freno de portabrocas
pt_br: Freio do mandril desativado

source: Spindle brake on
es: Encender freno del Portabrocas
pt_br: Freio do mandril ativado

source: Turn spindle clockwise
es: Girar portabrocas en sentido de las agujas del reloj
pt_br: Gira o mandril no sentido horário

source: Turn spindle more slowly
es: Girar Portabrocas mas despacio
pt_br: Gira o mandril mais devagar

source: Turn spindle more quickly
es: Girar Portabrocas mas rapido
pt_br: Gira o mandril mais rápido

source: Control-K
es: Ctrl-K

source: Clear live plot
es: Borrar barra de herramientas
pt_br: Apaga traçadado da ferramenta

source: Cycle among preset views
es: Cambiar perspectivas en ciclos
pt_br: Salta entre vistas pré-ajustadas

source: AXIS error
es: Error de Axis
pt_br: Erro do AXIS

source: No tool
es: Sin herramienta
pt_br: Sem ferramenta

source: Unknown tool %d
es: Herramienta desconocida %d
pt_br: Ferramenta desconhecida %d

source: Tool %d, offset %g, diameter %g
es: Herramienta %d, Mover Herramienta %g, Diametro %g
pt_br: Ferramenta %d, offset %g, diâmetro %g

source: Tool %d, zo %g, xo %g, dia %g
es: Herramienta %d, zo %g, xo %g, Diam. %g

source: Filtering...
es: Procesando...

source: Program_filter %r failed
es: Filtro_del Programa %r fallido
pt_br: Filtro de programa %r errado

source: Exit code %d
es: Terminar-instruccion %d
pt_br: Codigo saída %d

source: G-Code error in %s
es: Error de codigo-G en %s
pt_br: Erro no Código-G em %s

source: Near line %d of %s: %s
es: Acercar linea %d en %s: %s
pt_br: Próximo da linha %d de %s: %s

source: Cancel
es: Cancelar
pt_br: Cancela

source: Name:
es: Archivo:

source: Size:
es: Tama&#324;o:

source: Tool order:
es: Ordenar herramienta

source: Rapid distance:
es: Distancia en marcha rapida:

source: Feed distance:
es: Distancia:

source: Total distance:
es: Distancia total:

source: Run time:
es: Tiempo:

source: X bounds:
es: Area X:

source: Y bounds:
es: Area Y:

source: C bounds:
es: Area C:

source: %f to %f = %f %s
es: %f hasta %f = %f %s

source: G-Code Properties
es: Propiedades de codigo-G %s

source: All machinable files
es: Todos los Archivos ejecutables

source: rs274ngc files
es: rs274ngc-Archivos

source: All files
es: Todos los archivos

source: Program exceeds machine minimum on axis %s
es: El programa excedio el limite inferior en Eje %s
pt_br: O programa excede o limite inferior no eixo %s

source: Program exceeds machine maximum on axis %s
es: El Programa excedio el limite superior en Eje %s
pt_br: O programa excede o limite superior no eixo %s

source: Program exceeds machine limits
es: El programa excedio limite de la Maquina
pt_br: O programa excede os limites da máquina

source: Run Anyway
es: Ejecutar de todas formas
pt_br: Funcionamento de qualquer maneira

source: Touch Off
es: Regular Offset

source: Enter %s coordinate relative to workpiece:
es: Introducir %s-coordenada relativa a la pieza:

source: Continuous
es: Continuo
pt_br: Contínuo

source: Home All
es: Restaurar todos los ejes

source: Home all axes [Ctrl-Home]
es: Restaurar todos los ejes [Ctrl-Pos1]

source: Home All Axes
es: Restaurar todos los ejes

source: Home Axis _%s
es: Restaurar _%s-Eje

source: Error in ~/.axisrc
es: Error en ~/.axisrc

source: Insert tool %d and click continue when ready
es: Insertar pieza %d y clickear continuar

source: Remove the tool and click continue when ready
es: Remover pieza y clickear continuar

source: Tool change
es: Cambio de pieza

source: Continue
es: Continuar

source: AXIS Manual Toolchanger
es: Cambio manual de herramienta AXIS

source: This window is part of the AXIS manual toolchanger. It is safe to close or iconify this window, or it will close automatically after a few seconds.
es: Esta ventana es parte del " Cambiador manual de herramienta AXIS ". puede ser cerrada, minimizada o automaticamente se cerrara despues deunos segundos

source: %s: Image to gcode
es: %s: Transformar imagen a codigo-G

source: Image to gcode
es: Transformar imagen a codigo-G

source: Image size: %d x %d pixels Minimum pixel value: %d Maximum pixel value: %d
es: Tamanho de imagen: %d x %d Resolucion<br>Luminosidad minima:%d<br>Maxima Luminosidad: %d

source: Yes
es: Si

source: Rows
es: Filas

source: Columns
es: Columnas

source: Rows then Columns
es: Primero filas despues columnas

source: Positive
es: Positivo

source: Negative
es: Negativo

source: Alternating
es: Alternando

source: Up Milling
es: Fresar avanzando

source: Down Milling
es: Fresar hacia abajo

source: Ball End
es: Fresador esferico

source: Flat End
es: Fresador plano

source: 45 Degree
es: Fresador de 45°

source: 60 Degree
es: Fresador de 60°

source: None
es: Ninguno

source: Secondary
es: Secundario

source: Invert Image
es: Invertir Imagen

source: Normalize Image
es: Normalizar imagen

source: Pixel Size
es: Tamanho del Pixel

source: Depth (units)
es: Profundidad (Unidad)

source: Tolerance (units)
es: Tolerancia (Unidad)

source: Y step (pixels)
es: Y-Resolucion (Pixel)

source: Tool Diameter (units)
es: Diametro de pieza (Unidad)

source: Tool Type
es: Tipo de pieza

source: Feed Rate (units per minute)
es: Avance (Unidad por minuto)

source: Units
es: Unidad

source: Safety Height (units)
es: Altura de seguridad (Unidad)

source: Scan pattern
es: Escanear patrón

source: Scan direction
es: Escanear dirección

source: Lace bounding
es: Límite de cortador

source: Contact angle
es: Ángulo de contacto

source: Depth images
es: Archivos de imagenes

source: Task Issue
es: Tipo de Tarea

source: IO Points
es: Puntos IO

source: Motion Time
es: Tiempo de movimiento

source: Interpreter
es: Intérprete

source: Trajectory
es: Trajectoria

source: Interpreter List
es: Lista de intérprete

source: _Open...
es: _Abrir

source: _Reload
es: _recargar
pt_br: _Recarrega

source: _Properties...
es: _Propiedades

source: _Quit
es: _Terminar
pt_br: _Sair

source: Toggle _Emergency Stop
es: Boton de _emergencia activar/desactivar
pt_br: Botão _Parada de Emergência on/off

source: Toggle _Machine Power
es: _Maquina encender/apagar
pt_br: Botão _funcionamento da Máquina on/off

source: Set _next line
es: Insertar siguie_nte fila
pt_br: Seleciona a _proxima linha

source: _Run program
es: Ejecuta_r programa
pt_br: _Roda o programa

source: _Step
es: Pa_so
pt_br: _Passo

source: _Pause
es: _Pausa
pt_br: _Pausa

source: _Resume
es: _Resumir

source: S_top
es: De_tener
pt_br: _Parada

source: Reload tool ta_ble
es: Volver a vargar ta_bla de herramientas

source: Stop at M_1
es: Detener en M_1

source: Skip lines with '_/'
es: Saltar filas con '_/'

source: Clear MDI h_istory
es: Borrar historial de MD_I

source: Copy from MDI hist_ory
es: C_opiar de historial MDI

source: Paste to MDI histor_y
es: Pegar en historial MDI

source: _Calibration
es: _Calibración

source: Show _Hal Configuration
es: Mostrar configuracion _HAl

source: H_al Meter
es: H_AL-metro

source: Ha_l Scope
es: HA_L-escopio

source: Sho_w EMC Status
es: Estatus del EMC...

source: Set _Debug Level
es: Seleccionar nivel de _depuracion

source: Homin_g
es: Restaurar

source: _Top view
es: Perspectiva superior
pt_br: _Vista superior

source: _Rotated Top view
es: Perspectiva superior _rotada
pt_br: _Vista superior rotacionada

source: _Side view
es: Per_spectiva lateral
pt_br: _Vista lateral

source: _Front view
es: Perspectiva _frontal
pt_br: _Vista frontal

source: _Perspective view
es: Vista en _Perspectivas
pt_br: _Vista em perspectiva

source: Display _Inches
es: _Pulgadas
pt_br: Mostra medidas em_Polegadas

source: Display _MM
es: Mostrar _MM
pt_br: Mostra medidas em_mm

source: S_how program
es: Mostrar vista preliminar
pt_br: _Mostra o programa

source: Sho_w live plot
es: Mostrar barra de herramientas
pt_br: _Mostra o traçado em tempo real

source: Show too_l
es: _Mostrar herramienta
pt_br: Mostra _ferramenta

source: Show e_xtents
es: _Mostrar medidas
pt_br: Mostra _limites

source: Show machine sp_eed
es: Mostrar v_elocidad de maquina

source: Show _distance to go
es: Mostrar _distancia

source: _Clear live plot
es: Eliminar barra de herramienta

source: Show commanded position
es: Mostrar posicion
pt_br: Mostre a posição comandada

source: Show actual position
es: Mostrar posicion actual
pt_br: Mostre a posição atual

source: Show machine position
es: Mostrar posicion absoluta
pt_br: Mostre a posição da máquina

source: Show relative position
es: Mostrar posicion relativa
pt_br: Mostre a posição relativa

source: Joint mode
es: Modalidad-Joint

source: World mode
es: Modalidad-World

source: _About AXIS
es: Sobre AXIS
pt_br: _Sobre o Axis

source: Quick _Reference
es: _Referencia rapida
pt_br: Referência_rápida

source: _File
es: _Archivo
pt_br: _Arquivo

source: _Machine
es: _Máquina

source: _View
es: Perspectiva
pt_br: _Vista

source: _Help
es: Ayuda
pt_br: _Ajuda

source: Toggle Emergency Stop [F1]
es: Boton de Emergencia activar/desactivar [F1]
pt_br: Botão de Parada de Emergência [F1]

source: Toggle Machine power [F2]
es: Máquina encender/apagar [F2]

source: Open G-Code file [O]
es: Abrir archovo de codigo-G [O]
pt_br: Abre o arquivo Código-G [O]

source: Reopen current file [Control-R]
es: Volver a cargar archivo actual [Ctrl-R]
pt_br: Reabre o arquivo atual [Control-R]

source: Begin executing current file [R]
es: Ejecutar archivo actual [R]
pt_br: Inicia execução do arquivo atual [R]

source: Execute next line [T]
es: Ejecutar siguiente fila [T]
pt_br: Executa a próxima linna [T]

source: Pause [P] / resume [S] execution
es: Pausa [P] / resumir [S]
pt_br: Pausa [P] / retomada [S] execução

source: Stop program execution [ESC]
es: Detener Programa [ESC]
pt_br: Para a execução do programa [ESC]

source: Zoom in [+]
es: Ampliar [+]
pt_br: Aproxima a imagem [+]

source: Zoom out [-]
es: Disminuir [-]
pt_br: Afasta a imagem [-]

source: Top view
es: Perspectiva superior
pt_br: Vista superior

source: Rotated top view
es: Perspectiva superior rotada
pt_br: Rotaciona vista superior

source: Side view
es: Perspectiva lateral
pt_br: Vista lateral

source: Front view
es: Perspectiva frontal
pt_br: Vista frontal

source: Perspective view
es: Vista en perspectiva
pt_br: Vista em perspectiva

source: Clear live plot [Ctrl-K]
es: Eliminar barra de herramientas [Ctrl-K]
pt_br: Apaga o traçador em tempo real [Ctrl-K]

source: Manual Control [F3]
es: Control manual [F3]
pt_br: Controle manual [F3]

source: MDI [F5]
es: MDI

source: Axis:
es: Eje:
pt_br: Eixo:

source: Spindle:
es: Portabrocas:
pt_br: Mandril:

source: Stop
es: Detener
pt_br: Parada

source: Brake
es: Freno
pt_br: Freio

source: Coolant:
es: Enfriador:
pt_br: Refrigerante:

source: Mist
es: Neblina
pt_br: Sopro

source: Flood
es: Enfriador
pt_br: Jorro

source: History:
es: Historial:
pt_br: História:

source: MDI Command:
es: Comando MDI:
pt_br: Comando MDI:

source: Go
es: Ejecutar
pt_br: Partida

source: Active G-Codes:
es: Activar Codigo-G:
pt_br: Código-G ativo:

source: Jog Speed:
es: Velocidad:

source: Spindle Override:
es: Controlar portabrocas:

source: Feed Override:
es: Control de avanze

source: EMC2/AXIS version $version Copyright (C) 2004, 2005, 2006, 2007 Jeff Epler and Chris Radek. This is free software, and you are welcome to redistribute it under certain conditions. See the file COPYING, included with EMC2. Visit the EMC web site:
es: EMC2/AXIS Version $version Copyright (C) 2004, 2005, 2006, 2007 Jeff Epler and Chris Radek. This is free software, and you are welcome to redistribute it under certain conditions. See the file COPYING, included with AXIS. Deutsche Übersetzung: Alex Joni, Florian Hahn, Ingrid Kirst, Frank Jungclaus Besuchen Sie die AXIS Webseite:

source: EMC2/AXIS version $version Copyright (C) 2004, 2005, 2006, 2007 Jeff Epler and Chris Radek. Este es un software gratuito y ud esta invitado a distribuirlo bajo lascondiciones aceptadas. Vea el archivo COPYING; incluido en EMC2. Visita nuestra pagina de EMC:
es: AXIS Version $version Copyright (C) 2004, 2005, 2006 Jeff Epler and Chris Radek. Este es un software gratuito y ud esta invitado a distribuirlo bajo lascondiciones aceptadas. Vea el archivo COPYING; incluido en AXIS.

source: About AXIS
es: Sobre AXIS
pt_br: Sobre o AXIS

source: AXIS Quick Reference
es: Acceso directo a AXIS
pt_br: Referência do AXIS

source: AXIS (No file)
es: AXIS (Vacio)
pt_br: AXIS (Sem arquivo)

source: ESTOP
es: DETENER
pt_br: ESTOP IMEDIATO

source: OFF
es: APAGAR

source: ON
es: ENCENDER
pt_br: Ligado

source: Position:
es: Posicion:
pt_br: Posição:

source: Machine
es: Coordenada absoluta
pt_br: Máquina

source: Relative
es: relativo
pt_br: Relativa

source: Commanded
es: dirigido
pt_br: Comandada

source: Turn spindle counterclockwise [F10]
es: Portabrocas gira en sentido contrario de las agujas del reloj [F10]
pt_br: Gira o mandril no sentido anti-horário [F10]

source: Turn spindle clockwise [F9]
es: Portabrocas gira en sentido de las agujas del reloj [F9]
pt_br: Gira o mandril no sentido sentido horário [F9]

source: Stop spindle [F9/F10]
es: Detener Portabrocas [F9/F10]
pt_br: Para o mandril [F9/F10]

source: Turn spindle Faster [F12]
es: Aumentar revoluciones del Portabrocas [F12]
pt_br: Aumenta a velocidade do mandril [F12]

source: Turn spindle Slower [F11]
es: Disminuir revoluciones del Portabrocas [F11]
pt_br: Diminue a velocidade do mandril [F12]

source: Turn spindle brake on [Shift-B] or off [B]
es: Freno del portabrocas activar [Shift-B] o desactivar [B]
pt_br: Ativa [Shift-B] ou desativa [B] freio do mandril

source: Turn flood on or off [F8]
es: Medio enfriador encender/apagar [F8]
pt_br: Jorro ligado/desligado [F8]

source: Turn mist on or off [F7]
es: Neblina encender/apagar [F7]
pt_br: Sopro ligado/desligado [F7]

source: Send active axis home [Home]
es: Restaurar eje activo [HOME]
pt_br: Envia eixo ativo para posição de descanço

source: Set G54 offset for active axis [End]
es: Activar G54 para eje activo

source: Activate axis [X]
es: Activar eje [X]
pt_br: Ativa o eixo [X]

source: Activate axis [Y]
es: Activar eje [Y]
pt_br: Ativa o eixo [Y]

source: Activate axis [Z]
es: Activar eje [Z]
pt_br: Ativa o eixo [Z]

source: Activate axis [A]
es: Activar eje [A]
pt_br: Ativa o eixo [A]

source: Activate axis [4]
es: Activar eje [4]
pt_br: Ativa o eixo [4]

source: Activate axis [5]
es: Activar eje [5]
pt_br: Ativa o eixo [5]

source: Jog selected axis
es: Correr eje activo
pt_br: Movimenta o eixo selecionado

source: Temporarily allow jogging outside machine limits [L]
es: Permitir correr maquina temporalmente fuera de limitespredeterminados
pt_br: Temporariamente permite movimento além do limite da máquina

source: Stop program
pt_br: Para o programa

source: Turn spindle counterclockwise
pt_br: Gira o mandril no sentido anti-horário

source: {{rs274ngc files} {.ngc}} {{All files} *}
pt_br: {{rs274ngc files} {.ngc}} {{Todos os arquivos} *}

source: Show EMC Status
pt_br: Mostra o estado do EMC

source: _Open
pt_br: _Abre

source: _Copy
pt_br: _Cópia

source: C_lear live plot
pt_br: _Apaga traçador em tempo real

source: Re_sume
pt_br: _Retomada

source: Show _EMC Status
pt_br: Mostre o estado do EMC

source: _Edit
pt_br: _Modifica

source: _Program
pt_br: _Programa

source: Toggle machine power [F2]
pt_br: Botão de Partida da Máquina [F2]

source: Code Entry [F5]
pt_br: Código Manual

source: Feed Override (%):
pt_br: Velocidade de operação (%):

source: Actual
pt_br: Atual

source: Set G54 offset for active axis [Shift-Home]
pt_br: Determina offset G54 para o eixo ativo [Shift-Home]

source: Select jog ingrement
pt_br: Seleciona movimento por incremento
