Repository: LinuxCNC/linuxcnc
Catalog: lib/python/qtvcp/lib/NativeCAM-master/locale/*/LC_MESSAGES/nativecam.po
Languages: fr

source: Define orientation of centerline
fr: Définir orientation de l'axe central

source: Corner radius
fr: Rayon d'arrondi

source: Define radius
fr: Définir rayon

source: Wall thickness
fr: Épaisseur coque

source: Define if hollow
fr: Définir si cavité

source: <b>Create a Polygon with n edges</b>
fr: <b>Créer un polygone de N côtés</b>

source: Polygon center X
fr: Centre X du polygone

source: Polygon center Y
fr: Centre Y du polygone

source: Edges count
fr: Nombre côtés

source: Number of edges
fr: Nombre de côtés

source: <b>Add an arc to a polyline</b>&#10;Define I and J offsets, angle and direction
fr: <b>Ajouter un arc à une polyligne</b>&#10;Définir les décalages I et J, l'angle et la direction

source: Link
fr: Lien

source: Link style with previous item
fr: Style de liaison avec élément précédent

source: None=0:Rounded=1:Beveled=2:Inverted Round=3
fr: Aucun=0:Arrondi=1:Biseauté=2:Arrondi inversé=3

source: Select link type
fr: Choix du type de lien

source: Radius for rounded or distance from apex
fr: Rayon pour arrondi ou distance de l'apex pour chanfrein

source: Complement
fr: Complément

source: Reverse direction of tool path for rounded or inverted round
fr: Inverse la direction de l'outil pour les sommets

source: Tool engagement
fr: Engagement outil

source: Global=0:Specific=1
fr: Global=0:Spécifique=1

source: Tool engagement for this segment
fr: Engagement pour ce segment

source: Arc center
fr: Centre de l'arc

source: Using
fr: Utilisant

source: Offsets=6:Absolute position=7
fr: Décalage=6:Position absolue=7

source: Arc center option
fr: Option du centre de l'arc

source: I offset or cX
fr: Décalage I ou cX

source: Offset or absolute value
fr: Décalage ou valeur absolue

source: J offset or cY
fr: Décalage J ou cY

source: Angle where it ends
fr: Angle de la fin

source: Ending
fr: Fin

source: Angle option
fr: Option d'angle

source: Relative to start=0:Absolute to arc center=1
fr: Relatif au départ=0:Absolu au centre de l'arc=1

source: Angle relative to beginning of arc or absolute
fr: Angle relatif au début de l'arc ou absolu

source: Arc Mirrored
fr: Arc en miroir

source: <b>Add an mirrored arc to a polyline</b>&#10;Define mirror line, I and J offsets, angle and direction
fr: <b>Ajouter le miroir d'un arc à une polyligne</b>&#10;Définir la ligne de référence, les décalages I et J, l'angle de fin et la direction

source: Mirror line end
fr: Fin ligne réf.

source: Offsets=14:Absolute position=15
fr: Décalages=14:Position absolue=15

source: Show line
fr: Montrer la ligne

source: Arc Polar Ctr
fr: Arc Centre Polaire

source: <b>Add an arc to a polyline</b>&#10;Define center at polar position, angle where it ends and direction
fr: <b>Ajouter un arc à une polyligne</b>&#10;Définir le centre à une position polaire, l'angle de fin et la direction

source: Distance defines radius of arc
fr: La distance définit le rayon de l'arc

source: Angle from start point
fr: Angle de départ

source: Absolute=8:Relative to previous line or chord=9:Relative to previous arc center=10
fr: Absolu=8:Relatif à la ligne précédente ou corde=9:Relatif au centre de l'arc précédent=10

source: Angle relative to previous line or absolute
fr: Angle relatif à la ligne précédente ou absolu

source: <b>Add an arc to a polyline</b>&#10;Define destination, dir and arc height or radius
fr: <b>Ajouter un arc à une polyligne</b>&#10;Définir la destination, la direction,la hauteur de l'arc ou le rayon

source: Arc end coords
fr: Coords fin d'arc

source: Relative=4:Absolute=5
fr: Relatif=4:Absolu=5

source: Select Relative or Absolute
fr: Sélectionnez relatif ou absolu

source: Definition
fr: Définition

source: Define arc
fr: Définir l'arc

source: Radius=0:Arc height=1
fr: Rayon=0:Hauteur d'arc=1

source: Select value defined
fr: Sélectionnez définition de la valeur

source: Flip center
fr: Permuter centre

source: Center opposite side of chord
fr: Permuter le centre au côté opposé de la corde

source: <b>Add an arc to a polyline</b>&#10;Define polar destination, dir and arc height or radius
fr: <b>Ajouter un arc à une polyligne</b>&#10;Définir la destination polaire, la direction et la hauteur de l'arc ou la rayon

source: Arc end
fr: Fin de l'arc

source: Chord length
fr: Longueur corde

source: Center of arc will be calculated
fr: Le centre de l'arc sera calculé

source: <b>Duplicate and reverse polyline items</b>
fr: <b>Dupliquer et inverser des éléments d'une polyligne</b>

source: Mirror line
fr: Ligne référence

source: Connection
fr: Liaison

source: Line start
fr: Début de ligne

source: Line end
fr: Fin de ligne

source: Show mirror line
fr: Montrer ligne réf.

source: Straight line=1:Arc clockwise=2:Arc counter-clockwise=3
fr: Ligne droite=1:Arc horaire=2:Arc anti-horaire=3

source: Arc height
fr: Hauteur de l'arc

source: <b>Duplicate and reverse a polyline</b>
fr: <b>Dupliquer et inverser une polyligne</b>

source: Offsets, rotation
fr: Décalage, rotation

source: Mirror axis
fr: Axe de miroir

source: Offset X
fr: Décalage X

source: Offset Y
fr: Décalage Y

source: Axis
fr: Axe

source: Line or mirroring
fr: Miroir selon l'axe

source: Rotation center is origin
fr: Centre de rotation à l'origine

source: Tool compensation
fr: Comp. rayon outil

source: None=40:Left=41:Right=42
fr: Aucun=40:Gauche=41:Droite=42

source: Which side cutter will travel
fr: Quel côté l'outil se déplace

source: Designed=0:Reverse=1
fr: Selon conception=0:Inverse=1

source: Mill as designed or in reverse
fr: Fraisage selon conception ou inverse

source: Global tool engagement
fr: Engag. outil global

source: <b>Trace a line to a polar position</b>&#10;Relative with optional styled corner
fr: <b>Trace une ligne vers position polaire</b>&#10;Relative avec lien stylisé en option

source: Length
fr: Longueur

source: Length of line
fr: Longueur ligne

source: Absolute=2:Relative to previous line or chord=3:Relative to previous arc center=30
fr: Absolu=2:Relatif à la ligne précédente ou corde=3:Relatif au centre de l'arc précédent=30

source: Corner style to apply with previous item
fr: Style de lien à appliquer avec l'élément précédent

source: Repeated
fr: Répétition

source: <b>Repeat polyline items</b>
fr: <b>Répéter des éléments de polyligne</b>

source: Add polyline items to repeat
fr: Ajouter éléments de polyligne à répéter

source: Repeat
fr: Répéter

source: Number of repetition
fr: Nombre de répétitions

source: Disabling will disable ALL items in group
fr: Désactivera tous les éléments du groupe

source: <b>Create a line to X, Y</b>&#10;Absolute or Relative with optional styled corner
fr: <b>Créer une ligne jusqu'à X, Y</b>&#10;Point absolu ou relatif, avec style de lien

source: Relative=0:Absolute=1
fr: Relatif=0:Absolu=1

source: <b>Create a closed or open Polyline</b>&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Créer une polyligne fermée ou ouverte</b>&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: Origin
fr: Origine

source: Closing
fr: Fermeture

source: Origin X
fr: Origine X

source: Origin Y
fr: Origine Y

source: Offset origin
fr: Décalage origine

source: Rotation around offsets
fr: Rotation autour de point de décalage

source: Add polyline items here
fr: Ajouter éléments de polyligne ici

source: Closing item
fr: Élément fermeture

source: None=0:Straight line=1:Arc clockwise=2:Arc counter-clockwise=3
fr: Aucun=0:Ligne droite=1:Arc horaire=2:Arc anti-horaire=3

source: Closed or not and direction of closing line
fr: Ouvert ou fermé avec élément sélectionné

source: Arc definition
fr: Définition d'arc

source: Probe Grid
fr: Palper grille

source: <b>Probe Array of Points on stock and save to a file</b>
fr: <b>Sonde un ensemble de points sur la pièce et sauvegarde dans un fichier</b>

source: File name
fr: Nom de fichier

source: Enter file name to save to
fr: Entrer un nom de fichier pour les données

source: Probing and offsets
fr: Palpage, décalage

source: Master
fr: Maître

source: Master axis to follow
fr: Axe maître à suivre

source: Depth
fr: Profondeur

source: Maximum depth
fr: Prof. maximale

source: Reverse latch dir
fr: Inverser direction

source: <b>Probe Edges with touch-off options</b>&#10;When done, the probe will be above the edge
fr: <b>Sonde bordure avec option de mise à zéro</b>&#10;À la fin la sonde sera au-dessus du bord sondé

source: Select axis to find edge
fr: Sélection de l'axe à suivre

source: Ascending=1:Descending=-1
fr: Ascendant=1:Descendant=-1

source: Clear Z
fr: Dégagement Z

source: To raise above workpiece
fr: Au-dessus de la pièce

source: Touch off axis
fr: Calibrer axe

source: Set axis to 0
fr: Calibrer l'axe à 0

source: Probe Workpiece
fr: Palpage pièce

source: <b>Probe X and Y axis differently inside or outside with options for touch-off&#10;START WITH PROBE IN CENTER OF WORK PIECE</b>&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Sonde sur axes X ou Y à l'intérieur/extérieur avec options de calibrage&#10;DÉMARRER AU CENTRE DE LA PIÈCE</b>&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: Show entry lines
fr: Montrer lignes entrée

source: Double check
fr: Double vérification

source: Only if X is double checked
fr: Seulement si double vérification de l'axe X

source: Touching off
fr: Contact calibrage

source: Safe relative Z
fr: Dégag. relatif Z

source: Relative to start position
fr: Relatif à la hauteur départ

source: Calibration info
fr: Info de calibration

source: Show calibration helpful info
fr: Montrer info de calibration machine

source: Probe inside or outside
fr: Palpage intérieur ou extérieur

source: Inside=0:Outside=1
fr: Intérieur=0:Extérieur=1

source: Probe height
fr: Hauteur palpage

source: Touch off X,Y
fr: Calibrer X,Y

source: Set center to X0 and Y0
fr: Établir centre à X0 et Y0

source: <b>Create a Rectangle and align X and Y</b>&#10;Corners can be radiused or beveled
fr: <b>Créer un rectangle et aligner sur X et Y</b>&#10;les coins peuvent être arrondis ou biseautés

source: Usualy conventional has better finish
fr: Conventionnel pour meilleure finition

source: Reference coord
fr: Coordonnées de référence

source: Width
fr: Largeur

source: Positive value only
fr: Valeur positive seulement

source: Height
fr: Hauteur

source: Corners
fr: Sommets

source: Select corner type
fr: Sélectionnez type de sommets

source: Slot/oval 2 points
fr: Coulisse/Ovale

source: <b>Creates a Slot between two end points</b>
fr: <b>Créer une coulisse droite entre deux points</b>

source: Width of slot
fr: Largeur de coulisse

source: <b>Creates a Radial Slot</b>&#10;Define center, start and extend angle
fr: <b>Créer une coulisse en arc</b>&#10;Définir le centre, le début et l'étendue

source: Center of slot arc
fr: Centre de la coulisse

source: Ends style
fr: Style des bouts

source: Round=0:Converging=1
fr: Arrondi=0:Droit=1

source: Distance from center
fr: Distance du centre

source: Absolute angle
fr: Angle absolu

source: Slot/oval 1 point
fr: Coulisse/Ovale

source: <b>Creates a Slot from a single point</b>&#10;Reference point can be center of slot or of one end
fr: <b>Créer une coulisse depuis un seul point</b>&#10;la référence peut être le centre ou une extrémité

source: End=0:Center of slot=1
fr: Extrémité=0:Centre de la coulisse=1

source: X Center
fr: Centre X

source: Y center
fr: Centre Y

source: Direction of tool path
fr: Direction de l'outil

source: <b>Surface Finishing</b>
fr: <b>Finition de la surface</b>

source: Main axis
fr: Axe principal

source: Bidirectional=0:Unidirectional=2
fr: Bidirectionnel=0:Unidirectionnel=2

source: Defines quality of finish
fr: Définit la qualité de la finition

source: Entry mode
fr: Mode d'entrée

source: Arc=0:Straight=1
fr: Arc=0:Droit=1

source: Relative to start
fr: Relatif au début

source: Safety margin
fr: Marge sécuritaire

source: Distance past workpiece
fr: Distance dépassé la pièce

source: User defined=0:Surface=1
fr: Utilisateur=0:Surface=1

source: <b>Create internal or external threads</b>
fr: <b>Créer un filetage interne ou externe</b>

source: Center of helix
fr: Centre de l'hélice

source: Internal=2:External=3
fr: Interne=2:Externe=3

source: Select helix side
fr: Sélectionnez interne ou externe

source: Clockwise (RH)=3:Counter-clockwise (LH)=2
fr: Horaire (RH)=3:Anti-horaire (LH)=2

source: Rotation of start location
fr: Rotation du point de départ

source: Helix top
fr: Haut de l'hélice

source: User top
fr: Utilisateur

source: Helix bottom
fr: Bas de l'hélice

source: User bottom
fr: Utilisateur

source: Helix
fr: Hélice

source: Metric=0:Imperial=1
fr: Métrique=0:Impérial=1

source: Metric pitch is thread to thread, imperial is per inch
fr: Le pas métrique est d'un filet à l'autre, impérial est filets par pouce

source: Major diameter
fr: Diamètre nominal

source: Minor diameter
fr: Diamètre secondaire

source: Pitch
fr: Pas

source: Helix pitch
fr: Pas de l'hélice

source: Helix count
fr: Nb. d'hélice

source: Number of helix starts
fr: Nombre d'hélice

source: Tool Change
fr: Changer d'outil

source: <b>Change Tool and/or settings</b>&#10;Changes setting accordingly even if disabled&#10;<span style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Changer l'outil et/ou paramètres</b>&#10;les paramètres seront changés même si désactivé&#10;<span style='oblique'><b>Possible message dans le terminal</b></span>

source: Params will be set even if disabled
fr: Les paramètres sont modifiés même si désactivé

source: Tool and usage
fr: Outil et usage

source: Drill info
fr: Info sur foret

source: Feed and speed
fr: Alim., vit. broche

source: Milling penetration
fr: Pénétr., fraisage

source: Milling step over
fr: Step over

source: Step over for pocketing
fr: Enjambage(step over) pour pochette

source: Set these when usage is drilling
fr: Paramètres requis lors du forage

source: Select from tool table
fr: Sélectionnez de la table d'outils

source: Usage
fr: Utilisation

source: Roughing and finishing=0:Roughing=1:Finishing=2:Drilling=3:Threading=4
fr: Dégrossir et finition=0:Dégrossir=1:Finition=2:Forage=3:Filetage=4

source: Select usage for this tool
fr: Sélectionnez l'utilisation de cet outil

source: Select drill size
fr: Dimension foret

source: User defined=0:Fractional=1:Metric=2:Letter=3:Wire gauge=4:G-Code=5
fr: Utilisateur=0:Fractionnel=1:Métrique=2:Lettre=3:Wire gauge=4:G-Code=5

source: Select defined drill or enter size
fr: Sélection pré-défini ou utilisateur

source: User defined size
fr: Utilisateur

source: Wire gauge drill
fr: Foret de jauge filaire

source: Lettered drill
fr: Foret lettré

source: Fractional drill
fr: Foret fractionnel

source: Metric drill
fr: Foret métrique

source: Use length comp
fr: Comp. longueur

source: No=0:From tool table=1:Table and probe=2
fr: Non=0:Depuis la table=1:Table et palpage=2

source: Use G43 and probe if setup
fr: Utilise G43 et palpage si configuré

source: Use cooling
fr: Refroidissement

source: None=9:Flood=8:Mist=7
fr: Aucun=9:Flot=8:Brume=7

source: Use flood, mist or none
fr: Utiliser flot, brume ou aucun

source: Set spindle speed
fr: Vitesse broche

source: Point angle
fr: Angle de pointe

source: 118&#176; Medium hard material=118:135&#176; Hard material=135:90&#176; Plastic=90:60&#176; Plastic=60:Flat end=180
fr: 118&#176; pour matériel moyen dur=118:135&#176; pour matériel dur=135:90&#176; plastique=90:60&#176; plastique=60:Bout plat=180

source: Drill point angle
fr: Angle de la pointe

source: Start spindle
fr: Marche broche

source: No=0:Clockwise=3:Counter-clockwise=4
fr: Non=0:Horaire=3:Anti-horaire=4

source: Select drill rotation
fr: Choix de la rotation de broche

source: Feed at 100% engagement
fr: Alim. à 100% engagement

source: Vertical
fr: Verticale

source: Plunge or drill feed
fr: Alim. en plongée ou percage

source: Retract (R)
fr: Retrait (R)

source: Retract height
fr: Hauteur retrait

source: Manual=0:With Chip Breaking - G73=73:Standard - G81=81:Dwell at bottom - G82=82:Peck Drilling Cycle - G83=83
fr: Manuel=0:Brise copeaux - G73=73:Standard - G81=81:Arrêt temporisé - G82=82:Débourrage - G83=83

source: G73 requires Q>0 and R&#10;G81 requires R&#10;G82 requires R and P&#10;G83 requires Q>0 and R
fr: G73 requière Q>0 et R&#10;G81 requière R&#10;G82 requière R et P&#10;G83 requière Q>0 et R

source: Dwell in seconds
fr: Temporisation en secondes

source: Ramp down=0:Plunge=1
fr: Rampant=0:En plongée=1

source: How Z position is attained
fr: Comment atteindre position Z

source: Step down
fr: Pas vertical

source: Step down on each pass
fr: Pas vertical par cycle

source: Ramp down rate
fr: Taux de descente

source: Z versus XY move
fr: Mouvement vertical versus latéral

source: Expanding engagement
fr: Engagement pocket

source: Not to exceed for pocketing
fr: Ne pas dépasser pour pochette

source: Threading
fr: Filetage

source: Cutter engagement
fr: Engagement outil

source: Depth of cutter engagment in machine units per pass
fr: Profondeur d'engagement de l'outil par cycle

source: Cutter teeth
fr: Nombre dents

source: Number of cutter teeth
fr: Nombre de dents de l'outil

source: Lead-in clearance
fr: Pré-dégagement

source: Distance from face in machine units before engaging cutter
fr: Distance du matériel en unité machine avant l'engagement de l'outil

source: Inside=0:On the line=2:Outside=3
fr: Intérieur normal=0:Sans compensation=2:Extérieur=3

source: <b>Add cutting parameters</b>&#10;Changes setting accordingly even if disabled
fr: <b>Ajuster les paramètres de coupe</b>&#10;Changements même si désactivé

source: Cutting params will be set even if disabled
fr: Les paramètres de coupe seront changés même si désactivé

source: Cut
fr: Couper

source: Kerf width
fr: Largeur du trait

source: Select kerf width for compensation
fr: Choix de largeur de trait pour compensation

source: Start height
fr: Hauteur départ

source: Above surface
fr: Au-dessus de la surface

source: Normal feed
fr: Alim. normal

source: Vertical feed
fr: Alim. vertical

source: Rapid params
fr: Paramètres rapide

source: Above cut start
fr: Au-dessus début coupe

source: Lead in factor
fr: Facteur d'entrée

source: Times kerf
fr: Multiple du trait

source: Lead out factor
fr: Facteur sortie

source: Pierce delay
fr: Délai coupe

source: Wait after torch OK
fr: Délai après 'Torch OK'

source: Top=0:Bottom=1
fr: Haut=0:Bas=1

source: Cut width compensation
fr: Comp. rayon outil

source: Cut as designed or in reverse
fr: Couper selon conception ou à l'inverse

source: Kerf width compensation
fr: Comp. de largeur du trait

source: Which side torch will travel
fr: Quel côté la torche se déplace

source: <b>Create a Rectangular Array of items</b>
fr: <b>Créer un ensemble rectangulaire d'éléments</b>

source: X axis copies
fr: Copies axe X

source: Y axis copies
fr: Copies axe Y

source: Array rotation
fr: Rot. d'ensemble

source: Rotation of array
fr: Rotation de l'ensemble

source: X step
fr: Pas X

source: X items rotation
fr: Rotation élé. X

source: Relative to previous one
fr: Relatif au précédent

source: Y step
fr: Pas Y

source: Y items rotation
fr: Rotation élé. Y

source: NativeCAM for LinuxCNC
fr: NativeCAM pour LinuxCNC

source: A GUI to help create LinuxCNC NGC files.
fr: Interface graphique d'aide à la création de fichiers NGC

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. It is recommended you use the deb package
fr: Ce programme est distribué en souhaitant qu'il soit utile mais SANS AUCUNE GARANTIE, implicite ou autre, qu'il sera approprié pour l'usage désiré. Il est recommandé d'installer le package deb

source: Can not find file %(filename)s
fr: Fichier %(filename)s introuvable

source: Keeping modified local file %(filename)s
fr: Conserve le fichier local modifié %(filename)s

source: An updated system file is available: %(frompath)s YES -> Use new system file NO -> Keep local file Refresh -> Accept all new system files (don't ask again) Cancel -> Keep all local files (don't ask again)
fr: Une mise à jour du système est disponible: %(frompath)s Oui -> Utiliser le nouveau fichier Non -> Conserver le fichier local Actualiser -> Remplacer tous les fichiers sans autre confirmation Annuler -> Ne faire aucun remplacement pour cette version

source: NEW file version available
fr: Nouvelle version disponible

source: Ini file <%(inifilename)s> must have entry for [DISPLAY]NCAM_DIR
fr: Le fichier ini <%(inifilename)s> doit avoir une entrée pour [DISPLAY]NCAM_DIR

source: There is no PROGRAM_PREFIX in ini file Edit to add in DISPLAY section PROGRAM_PREFIX = abs or relative path to scripts directory i.e. PROGRAM_PREFIX = ./scripts or ~/ncam/scripts
fr: Il n'y a pas d'entrée PROGRAM_PREFIX dans le fichier ini Modifier pour l'ajouter dans la section [DISPLAY] PROGRAM_PREFIX = chemin absolu/relatif vers le rép. de scripts i.e. PROGRAM_PREFIX = ./scripts ou ~/ncam/scripts

source: Required lib missing: [RS274NGC]SUBROUTINE_PATH
fr: Librairie manquante: [RS274NGC]SUBROUTINE_PATH

source: The required NativeCAM lib directory : <%(lib)s> is not in [RS274NGC]SUBROUTINE_PATH: <%(path)s> Edit ini and correct
fr: La bibliothèque de NativeCAM : <%(lib)s> n'est pas dans [RS274NGC]SUBROUTINE_PATH: <%(path)s> Éditer le fichier ini pour corriger

source: Required NativeCAM lib %(err_details)s
fr: Librairie NativeCAM requise %(err_details)s

source: no description
fr: aucune description

source: Value can not be '0' for %(tooltip)s
fr: La valeur ne peut être '0' pour %(tooltip)s

source: Open
fr: Ouvrir

source: All files
fr: Tous les fichiers

source: unname
fr: sans-nom

source: Type not defined for %s
fr: Type non défini pour %s

source: Error with subprocess: returncode = %(errcode)s output = %(output)s e= %(e)s
fr: Erreur avec le sous-processus : code de retour = %(errcode)s sortie = %(output)s e= %(e)s

source: (*** GCode generated by NativeCAM for LinuxCNC ***)
fr: (*** GCode généré par NativeCAM pour LinuxCNC ***)

source: (*.ngc files are best viewed with Syntax Highlighting)
fr: (les fichiers *.ngc sont mieux compris avec la coloration syntaxique)

source: G21 (metric)
fr: G21 (métrique)

source: G20 (imperial/inches)
fr: G20 (impérial/pouces)

source: (optimization values)
fr: (valeurs d'optimisation)

source: (end defaults)
fr: (fin des valeurs paramétrées en préférence)

source: (This is a built-in safety to help avoid gouging into your work piece)
fr: (Ceci est une sécurité pour éviter le gougeage involontaire de votre pièce)

source: (sub definitions)
fr: (définitions de sous-programmes)

source: Open fails for ini file : %(inifilename)s %(detail)s
fr: Échec de l'ouverture du fichier ini : %(inifilename)s %(detail)s

source: DISPLAY can only be 'axis' or 'gmoccapy'
fr: DISPLAY doit être 'axis' ou 'gmoccapy'

source: Using %s
fr: Utilisant %s

source: Using default %(mnu)s, no %(dir)s/menu-custom.xml found
fr: Utilise le standard %(mnu)s, pas de %(dir)s/menu-custom.xml existant

source: Standalone Directory : %(dir)s Continue?
fr: Répertoire pour mode autonome : %(dir)s Poursuivre ?

source: NativeCAM CREATE
fr: Création pour NativeCAM
