Repository: LinuxCNC/linuxcnc
Catalog: lib/python/qtvcp/lib/NativeCAM-master/locale/*/LC_MESSAGES/nativecam.po
Languages: fr

source: An updated system is available A new structure will replace the old one if you continue If you have modified files in cfg, lib or graphics sub-directories, you should chose CANCEL on the next screen and exit the application to copy those files in the newly created '%(dir)s' sub-directory. Other un-needed files will be transfered to '%(dir)s' automatically. It is up to you to delete them. Take time to read the README file in '%(dir)s'
fr: Une mise à jour du système est disponible Une nouvelle structure de fichier remplacera l'ancienne si vous continuez Si vous avez modifié des fichiers dans un des sous-répertoire cfg, lib ou graphics, choisissez ANNULER au prochain message et quitter aussitôt pour copier ces fichiers dans le nouveau sous-répertoire '%(dir)s'. Les autres fichiers obsolètes seront automatiquement transférés dans '%(dir)s'. Vous êtes libre de leur usage. Prenez aussi le temps de lire le fichier '%(dir)s/README'

source: Updated %(qty)3d files in %(dir)s
fr: %(qty)3d fichiers mis à jour dans %(dir)s

source: Created %(qty)3d files in %(dir)s
fr: %(qty)3d fichiers créés dans %(dir)s

source: Back...
fr: Retour...

source: Menu is old format, no toolbar defined. Update to new format
fr: Le format de menu est obsolète pas de définition de barre d'outil Mettre à jour au nouveau format

source: Name
fr: Nom

source: Value
fr: Valeur

source: _Projects
fr: _Projets

source: Open Example
fr: Ouvrir un projet exemple

source: Open Example Project
fr: Ouvrir un projet exemple

source: Save project as xml file
fr: Enregistrer le projet au format xml

source: Save as Default Template
fr: Enregistrer comme modèle par défaut

source: Save project as default template
fr: Enregistre comme modèle par défaut

source: Export gcode as RS274NGC
fr: Exporter en gcode RS274NGC

source: _Edit
fr: É_dition

source: Undo last operation
fr: Annuler la dernière opération

source: Cancel last Undo
fr: Annuler dernier Défaire

source: Cut selected subroutine to clipboard
fr: Couper le sous-programme vers le presse-papiers

source: Copy selected subroutine to clipboard
fr: Copier le sous-programme vers le presse-papiers

source: Paste from clipboard
fr: Coller depuis le presse-papiers

source: Add a subroutine
fr: Ajouter un sous-programme

source: Duplicate
fr: Dupliquer

source: Duplicate selected subroutine
fr: Dupliquer le sous-programme

source: Remove selected subroutine
fr: Supprimer le sous-programme

source: Add to Items
fr: Ajouter aux éléments

source: Remove from Items
fr: Retirer des éléments

source: Move up
fr: Monter

source: Move down
fr: Descendre

source: Save Values as Defaults
fr: Enregistrer les valeur comme défaut

source: Save Values of this Subroutine as Defaults
fr: Enregistrer les valeur de ce sous-programme comme défaut

source: Delete Custom Default Values
fr: Supprimer les valeurs personnalisées

source: Set Digits
fr: Décimales

source: _Add
fr: _Ajouter

source: Add a Prototype Subroutine
fr: Ajouter prototype de sous-programme

source: Add a Subroutine Definition File
fr: Ajouter une définition de sous-programme

source: Import a Project File
fr: Importer un projet

source: Import a Project Into the Current One
fr: Importer un projet dans celui en cours

source: _View
fr: _Affichage

source: Collapse All Other Nodes
fr: Réduire tous les autres noeuds

source: Save As Default Layout
fr: Enregistrer comme disposition par défaut

source: Single View
fr: Arborescence unique

source: Dual Views
fr: Arborescence double

source: Top / Bottom Layout
fr: Disposition haut / bas

source: Side By Side Layout
fr: Disposition côte à côte

source: Master Value Column Hidden
fr: Cacher la colonne 'Valeur'

source: In master treeview
fr: Dans l'arbre primaire

source: Sub-Groups In Master Tree
fr: Sous-groupe dans le Treeview maître

source: _Utilities
fr: _Utilitaires

source: Reload Tool Table
fr: Recharger la table d'outils

source: Edit Preferences
fr: Préférences

source: Auto-refresh
fr: Auto-rafraîchissement

source: Auto-refresh LinuxCNC
fr: Auto-rafraîchir

source: _Help
fr: A_ide

source: NativeCAM on YouTube
fr: NativeCAM sur YouTube

source: Translating NativeCAM
fr: Traduire NativeCAM

source: LinuxCNC web Site
fr: Site web LinuxCNC

source: LinuxCNC Forum
fr: Forum LinuxCNC

source: Hide Selected Field
fr: Cacher le champ sélectionné

source: Show All Fields
fr: Montrer tous les champs

source: Save Project as Current Work
fr: Enregistrer le projet comme travail en cours

source: Rename Subroutine
fr: Renommer le sous-programme

source: Group <-- --> Sub-group
fr: Groupe <-- --> Sous-groupe

source: Change to GCode
fr: Changer pour du g-code

source: Revert to original type
fr: Revenir au type original

source: Secondary treeview focused
fr: Arbre secondaire en focus

source: Primary treeview focused
fr: Arbre primaire en focus

source: (end sub definitions)
fr: (fin des définitions de sous-programmes)

source: Save as ngc...
fr: Enregistrer au format ngc...

source: Enter new name for
fr: Entrez un nouveau nom pour

source: '%(source_file)s' is not a valid cfg or xml file
fr: '%(source_file)s' n'est pas un fichier cfg ou xml valide

source: LinuxCNC not running Start LinuxCNC and activate Auto-refresh menu item
fr: LinuxCNC n'est pas démarré Démarrez LinuxCNC et activez le menu Auto-rafraîchir

source: Untitle.xml
fr: sansnom.xml

source: Previous work not saved as current work
fr: Aucun projet sauvegardé comme travail en cours

source: No default template saved
fr: Aucun modèle défini par défaut

source: Import project
fr: Importer un projet

source: NativeCAM projects
fr: Projets NativeCAM

source: Save project as...
fr: Enregistrer le projet sous...

source: Open project
fr: Ouvrir un projet

source: Open example project
fr: Ouvrir un projet exemple

source: NativeCAM example projects
fr: Projets exemples NativeCAM

source: Open a cfg file
fr: Ouvrir un fichier .cfg

source: Config files
fr: Fichiers de définition

source: Success in modifying inifile : %s
fr: Le fichier : %s a été modifié avec succès

source: Error modifying ini file %(err_details)s
fr: Erreur à la modification du fichier ini %(err_details)s

source: Expected file not found : %s
fr: Fichier requis non trouvé : %s
