Repository: LinuxCNC/linuxcnc
Catalog: lib/python/qtvcp/lib/NativeCAM-master/locale/*/LC_MESSAGES/nativecam.po
Languages: fr

source: Cancel add
fr: Annuler ajout

source: Add cfg file
fr: Ajouter un fichier sous-programme

source: Import XML file
fr: Importer un fichier XML

source: None
fr: Aucun

source: Beginning
fr: Début

source: Center
fr: Milieu

source: End
fr: Fin

source: Loop back
fr: Boucle retour

source: Spiral
fr: Spirale

source: G38.2 - toward workpiece, stop on contact, signal failure
fr: G38.2 - palpe vers la pièce, arrêt au contact, signale si erreur

source: G38.3 - toward workpiece, stop on contact
fr: G38.3 - palpe vers la pièce, arrêt au contact

source: G38.4 - away from workpiece, stop on loss of contact, signal failure
fr: G38.4 - palpe en quittant la pièce, arrêt sur perte de contact, signal si erreur

source: G38.5 - away from workpiece, stop on loss of contact
fr: G38.5 - palpe en quittant la pièce, arrêt sur perte de contact

source: Imperial
fr: Impérial

source: Metric
fr: Métrique

source: NativeCAM Preferences
fr: Préférences de NativeCAM

source: Auto-refresh time-out
fr: Délai d'auto-rafraîchissement

source: Default decimals
fr: Décimales par défaut

source: Delay on faster rpm
fr: Délai accélération broche

source: Spindle full speed delay
fr: Délai pour accélération de la broche

source: Units are auto-detected
fr: Unités auto-détectées

source: Initialization
fr: Initialisation

source: Post-amble
fr: Post-traitement

source: Coordinates for offsetting and rotation
fr: Coordonnées de décalage et rotation

source: Increase if gmoccapy auto-refresh is intermittent or some input windows do not show
fr: Augmenter si gmoccapy cause rafraîchissement intermittent ou que des fenêtres de saisie ne s'affiche pas

source: Gmoccapy input time-out delay
fr: Délai saisie pour gmoccapy

source: Spiral mode not supported yet
fr: Mode en spirale non-supporté

source: Pocket expanding mode
fr: Mode d'expansion de pochette

source: Autosave on closing
fr: Sauvegarde en fermeture

source: General
fr: Général

source: Window minimal width
fr: Largeur minimale de la fenêtre

source: Master treeview minimal width
fr: Largeur minimale du Treeview maître

source: Name column ellipsize
fr: Ellipse le nom

source: Restore treeview full state
fr: Rétablir l'état complet du treeview

source: Show bottom lines
fr: Montrer lignes basses

source: Show design lines
fr: Montrer résultat

source: Name column minimal width
fr: Largeur minimale de la colonne 'nom'

source: Primary treeview expanders visible
fr: Marque d'expansion tv primaire visible

source: Secondary treeview expanders visible
fr: Marque d'expansion tv secondaire visible

source: Display
fr: Affichage

source: Add menu
fr: Menu 'Ajouter'

source: Quick access toolbar
fr: Barre d'accès rapide

source: Add dialog
fr: Dialogue 'Ajouter'

source: Main toolbar
fr: Barre principale

source: Icons Size
fr: Taille des icônes

source: Cancel on focusing out
fr: Annuler sur perte de focus

source: This is the tool tip
fr: Ceci est l'indice pour la valeur

source: Virtual Keyboard
fr: Clavier virtuel

source: Tool engagement up to
fr: Engagement jusqu'à

source: Feed factor
fr: Facteur alimentation

source: Spindle speed factor
fr: Facteur vitesse broche

source: unspecified or 0
fr: non spécifié ou 0

source: Optimizing
fr: Optimisation

source: Function
fr: Fonction

source: If Latch Distance is greater than 0 then probe will go back and Latch in the same direction, else Latch will be done in opposite direction (stop on loss of contact).
fr: Si la distance d'enclanchement > 0, la sonde reculera et enclanchera dans la même direction, sinon ce sera fait au retour sur la perte de contact

source: Latch distance
fr: Distance enclanchement

source: Latch feed
fr: Vitesse d'enclanchement

source: Probe tip diameter
fr: Diamètre de la pointe de la sonde

source: Feed
fr: Alimentation

source: Probe safety margin
fr: Marge sécuritaire

source: Uses tool length compensation after probing
fr: Utilise compensation longueur d'outil après mesure

source: Probe tool length
fr: Mesure longueur d'outil

source: Probing
fr: Palpage

source: Center drill depth
fr: Profondeur de forage initial

source: Relative to drill start
fr: Relatif au début forage

source: Drilling
fr: Forage

source: Not supported yet
fr: Non-supporté encore

source: Lathe
fr: Tour

source: Test mode
fr: Mode test

source: Parameters
fr: Paramètres

source: Cutting Params
fr: Paramètres coupe

source: Set cutting parameters
fr: Paramètres de coupe

source: Threading Params
fr: Paramètres filetage

source: Set thread cutting params
fr: Paramètres filetage

source: Tool
fr: Outil

source: Change Tool
fr: Changer Outil

source: Change cutter
fr: Changer couteau

source: Cutting
fr: Coupe

source: Threads
fr: Filetage

source: Cut regular threads
fr: Filetage régulier

source: Cut face
fr: Couper face

source: Miscellaneous
fr: Divers

source: Insert a G Code File
fr: Insérer un fichier de g-code

source: Include a custom gcode file
fr: Insérer un fichier gcode personnalisé

source: Custom G Code
fr: G Code personnalisé

source: Write custom gcode
fr: Écrire code personnalisé

source: Change Units
fr: Changer d'unités

source: Change from inch to metric or inverse
fr: Changer de pouces à métrique ou inverse

source: Basic Shapes
fr: Formes de base

source: Create a rectangle with optional corner types
fr: Créer un rectangle avec options de sommets

source: Circle
fr: Cercle

source: Create a circle with optional D flat
fr: Créer un cercle avec option d'un plat

source: Circle From 2 Points
fr: Cercle par diamètre

source: Define ends of diameter
fr: Définir les extrémités du diamètre

source: Slot/Oval From 1 Point
fr: Coulisse/Ovale depuis 1 point

source: Define a point, angle and length
fr: Définir un point, un angle et la longueur

source: Slot/Oval From 2 Points
fr: Coulisse/Ovale depuis 2 points

source: Define center of ends
fr: Définir le centre des bouts

source: Radial Slot
fr: Coulisse arquée

source: Create a radial slot
fr: Créer une coulisse arquée

source: Create an ellipse
fr: Créer un ellipse

source: Polygon
fr: Polygone

source: Polygon of N edges
fr: Polygone de N côtés

source: Surface Finishing
fr: Finition surface

source: Uni or Bi-directional
fr: Uni/Bi directionnel

source: Advanced
fr: Avancés

source: Polyline
fr: Polyligne

source: Start
fr: Début

source: Starts a polyline
fr: Démarer polyligne

source: Line To
fr: Ligne vers

source: Relative or absolute position
fr: Position relative ou absolue

source: Line Polar
fr: Droite polaire

source: Define angle and length
fr: Définir l'angle et la longueur

source: Defined center by offsets or absolute position
fr: Définir centre par décalage ou position absolue

source: Arc Polar Center
fr: Arc Centre Polaire

source: Define center at angle and distance
fr: Définir le centre à un angle et distance

source: Arc To Coords
fr: Arc vers coords

source: Define end point, arc height or radius
fr: Définir destination, hauteur de l'arc ou le rayon

source: Arc To Polar
fr: Arc à Polaire

source: Arc Mirror End
fr: Arc en mirroir

source: Define I,J and mirror line
fr: Définir I,J et la ligne de référence

source: Repeat Items
fr: Répétition d'éléments

source: Repeat a group of polyline items
fr: Répéter des éléments de polyligne

source: Mirror Items
fr: Miroir d'éléments

source: Duplicate and reverse polyline items
fr: Dupliquer et inversser les éléments

source: Mirror Polyline
fr: Polyligne mirroir

source: Create a reversed polyline from previous one
fr: Créer une polyligne inversée de la précédente

source: Counterbore
fr: Contre-alésage

source: For Socket Head Cap Screw
fr: Pour vis à chapeau à tête creuse (SHCS)

source: Single Hole
fr: Trou unique

source: No slot
fr: Pas de coulisse

source: Slot From 1 Point
fr: Contre-alésage 1 point

source: Slot From 2 Points
fr: Contre-alésage 2 points

source: Define 2 points
fr: Définir deux points

source: Thread Milling
fr: Filetage

source: True thread mill needed
fr: Requière un outil spécial

source: Drill a single hole
fr: Forage unique

source: Array Of Holes
fr: Ensemble De Trous

source: Drill lines of holes
fr: Forer en ligne

source: Regular Circle
fr: Cercle régulier

source: Create a regular spaced holes circle
fr: Créer un cercle de trous régulier

source: Irregular Circle
fr: Cercle irrégulier

source: Create a hole circle of different angle spacing
fr: Créer un cercle de trous irrégulier

source: Group, Offset And Rotation
fr: Groupement, décalage et rotation

source: Standard Group
fr: Groupe standard

source: Group subroutines
fr: Groupement de sous-programme

source: Offset/Rotate
fr: Décalage/Rotation

source: Group subroutines, offset and rotate
fr: Groupement sous-programme, décalage et rotation

source: Radial Array
fr: Ensemble circulaire

source: Define diameter or distance between groups
fr: Définir le diamètre ou la distance entre les groupes

source: Rectangular Array
fr: Ensemble rectangulaire

source: Array of rows and columns
fr: Ensemble de rangs et colonnes

source: Index A Axis
fr: Jndexation axe A

source: Rotate A axis
fr: Tourner l'axe A

source: Select end mill or drill and set parameters
fr: Choix de fraise ou foret et établir paramètres

source: Probe Edges
fr: Palpage bordures

source: Find workpiece edges
fr: Trouver bordures de pièce

source: Probe Stock
fr: Palpage pièce

source: Find the center of a cube or cylinder
fr: Trouver le centre d'un cylindre ou cube

source: Probe Array
fr: Palpage grille

source: Probe a array of points and save to file
fr: Palpe un ensemble de points et sauvegarde dans un fichier

source: Raw Material
fr: Matériel de base

source: Show a temporary image of rough material
fr: Montre une image temporaire du matériel utilisé

source: Comment
fr: Commentaire

source: Add comments
fr: Ajouter notes

source: Temporarily change units
fr: Changement temporaire d'unités

source: Begin
fr: Départ

source: <b>Change Units for items only and revert back after</b>
fr: <b>Changer d'unités de mesure pour les éléments inclus et retour aux valeurs précédentes</b>

source: Active
fr: Actif

source: Disabling will NOT disable items
fr: Désactiver ne désactivera pas les éléments

source: Change for
fr: Changer pour

source: Radius and diameter
fr: Rayons, diamètres

source: Width, height, length
fr: Larg., haut., long.

source: Cut depth
fr: Prof. de coupe

source: Change units for cut depth
fr: Changer pour profondeur de coupe

source: Items
fr: Éléments

source: If active, these items will use alternate units
fr: Si actif, ces éléments utiliseront les unités alternatives

source: <b>Create a Radial Array of items</b>
fr: <b>Créer un ensemble radial d'éléments</b>

source: Disabling will disable ALL items
fr: Désactivera tous les éléments

source: Coords, size
fr: Coords, taille

source: Rotation and ends
fr: Rotation, étendue

source: Number of copies
fr: Nombre de copies

source: Array center
fr: Centre de l'ensemble

source: Dimension is
fr: Définir dimension

source: Radius=0:Diameter=1:Distance between groups=2
fr: Rayon=0:Diamètre=1:Distance entre les groupes=2

source: Select what dimension means
fr: Sélection définition de dimension

source: Size
fr: Taille

source: Diameter of array or distance between group of items
fr: Diamètre de l'ensemble ou distance entre les groupes d'éléments

source: Angle of the first item
fr: Angle du premier élément

source: Fill angle
fr: Angle d'étendue

source: Angle covered by items
fr: Étendue angulaire des éléments

source: Rotate items
fr: Tourner éléments

source: Rotate each group of items
fr: Tourner chaque groupe d'éléments

source: Items to copy
fr: Éléments à dupliquer

source: <b>Add a comment</b>
fr: <b>Ajouter une note</b>

source: Note
fr: Remarque

source: <b>Add gcode</b>&#10;lines will be parsed as usual so you can use &lt;eval>&lt;/eval>, '\n'
fr: <b>Ajouter gcode personnalisé</b>&#10;Les lignes seront traîtées normalement, yous pouvez utiliser &lt;eval>&lt;/eval>, '\n'

source: Disabling will exclude lines
fr: Désactivera les lignes de code personnalisé

source: Lines
fr: Lignes

source: Line 1
fr: Ligne 1

source: Gcode line
fr: Ligne de gcode

source: Line 2
fr: Ligne 2

source: Line 3
fr: Ligne 3

source: Line 4
fr: Ligne 4

source: Line 5
fr: Ligne 5

source: Line 6
fr: Ligne 6

source: Group Offset
fr: Décalage groupe

source: <b>Offset and/or Rotate a Group of items</b>
fr: <b>Décaler et/ou tourner un groupe d'éléments</b>

source: Items to group
fr: Éléments à grouper

source: Coords and rotation
fr: Coords et rotation

source: Rotation center
fr: Centre de rotation

source: Items offsets
fr: Décalage éléms

source: X offset
fr: Décalage X

source: Y offset
fr: Décalage Y

source: Rotate
fr: Tourner

source: Group
fr: Groupe

source: <b>Group items together</b>
fr: <b>Grouper des éléments</b>

source: Include Gcode
fr: Inclure du gcode

source: <b>Inserts a ngc file</b>
fr: <b>Insérer un fichier ngc</b>

source: Selected file
fr: Fichier sélectionné

source: Gcode file
fr: Fichier G-Code

source: G-Code file
fr: Fichier G-Code

source: Parameter 1
fr: Paramètre 1

source: Parameter 2
fr: Paramètre 2

source: Parameter 3
fr: Paramètre 3

source: Parameter 4
fr: Paramètre 4

source: Parameter 5
fr: Paramètre 5

source: Parameter 6
fr: Paramètre 6

source: Spindle speed
fr: Vitesse broche

source: Facing
fr: Finition face

source: Tool number
fr: Numéro d'outil

source: Additional Gcode
fr: GCode additionnel

source: SHCS CBore
fr: Contre-alésage

source: <b>Creates a counterbore for a socket head cap screw</b>&#10;Will mill the screw hole if tool is small enough&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Créer un contre-alésage</b>&#10;Usinera le trou de vis si l'outil est approprié&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: Show design
fr: Voir conception

source: Coords
fr: Coordonnées

source: Center of hole
fr: Centre du trou

source: Washer
fr: Rondelle

source: Only if used
fr: Seulement si utilisé

source: Select size
fr: Choix de vis

source: Fractional=1:Metric=2:Number=3
fr: Fractionnel=1:Métrique=2:Numéro=3

source: Select metric, fractional or numbered
fr: Sélectionnez métrique, impérial ou numéroté

source: Fractional
fr: Fractionnel

source: inch
fr: pouce

source: Numbered screw
fr: Vis numéroté

source: Counterbore depth
fr: Prof. contre-alésage

source: User defined=0:Head clears surface=1:Maximum depth=2
fr: Utilisateur=0:Tête à la surface=1:Profondeur maximum=2

source: Or head under surface or&#10;leave material equal to screw diameter
fr: Tête sous la surface ou&#10;laisser du matériel égal au diamètre de la vis

source: User defined depth
fr: Défini par l'utilisateur

source: Screw
fr: Vis

source: Diameter
fr: Diamètre

source: Diameter of washer used if any in usual units (specify a little larger to clear)
fr: Diamètre de rondelle si utilisée en unité machine (spécifier un peu plus grand)

source: Thickness
fr: Épaisseur

source: Thickness of washer used if any in usual units
fr: Épaisseur de la rondelle en unité machine

source: Milling
fr: Fraisage

source: Clockwise=2:Counter-Clockwise=3
fr: Horaire=2:Anti-Horaire=3

source: Direction of path
fr: Direction de la coupe

source: Cut start
fr: Début coupe

source: User defined=0:Surface=1:Half=2:One quarter=3:Three quarter=4:G-Code=5
fr: Utilisateur=0:Surface=1:Demi-profondeur=2:Un quart=3:Trois quart=4:G-Code=5

source: Pre or user defined
fr: Pré-défini ou utilisateur

source: Cut down to
fr: Prof. coupe

source: User defined=0:Through=1:Bottom=2:G-Code=3
fr: Utilisateur=0:A travers=1:Egal au bas=2:G-Code=3

source: Pre defined
fr: Pré-défini

source: SHCS CBore Radial
fr: Contre-alésage arquée

source: <b>Creates a counterbore arc for a socket head cap screw</b>&#10;Will mill the screw slot&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Créer un arc de contre-alésage</b>&#10;Usinera la coulisse de vis&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: Center of arc
fr: Centre de l'arc

source: Start, extend
fr: Début, étendue

source: Radius
fr: Rayon

source: Distance from X,Y
fr: Distance de X,Y

source: Start angle
fr: Angle début

source: Extend angle
fr: Étendue

source: Relative length of arc in degrees
fr: Longueur relative d'arc en degrés

source: User start
fr: Début utilisateur

source: SHCS CBore Slot
fr: Contre-alésage

source: <b>Creates a counterbore slot from a single point for a socket head cap screw</b>&#10;Will mill the screw slot&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Créer une coulisse de contre-alésage</b>&#10;Usinera la coulisse&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: Size, rotation
fr: Taille, rotation

source: X reference
fr: Référence X

source: Y reference
fr: Référence Y

source: X axis align
fr: Align. axe X

source: End=0:Center=1
fr: Extrémité=0:Centre=1

source: X,Y center of slot or left end
fr: Centre X,Y de la coulisse ou extrémité

source: Effective length
fr: Longueur utile

source: Length between center of arcs
fr: Longueur entre le centre des arcs

source: Angle rotated
fr: Angle de rotation

source: Diameter of washer used if any
fr: Diamètre de rondelle si utilisée

source: Thickness of washer used if any
fr: Épaisseur de la rondelle si utilisée

source: SHCS CBore Slot 2
fr: Contre-alésage

source: <b>Creates a counterbore slot from two points for a socket head cap screw</b>&#10;Will mill the screw slot&#10;<span foreground='blue' style='oblique'><b>Message possible in terminal window</b></span>
fr: <b>Créer une coulisse de contre-alésage</b>&#10;Usinera la coulisse&#10;<span foreground='blue' style='oblique'><b>Possible message dans le terminal</b></span>

source: First point
fr: Premier point

source: Second point
fr: Seconde extrémité

source: Circle 2 points
fr: Cercle par diamètre

source: <b>Create a Circle by defining ends of diameter</b>&#10;Points are the ends of the diameter and can add a flat
fr: <b>Créer un cercle en définissant les extrémités du diamètre</b>&#10;possible d'ajouter un plat

source: One end of the diameter
fr: Une extrémité du diamètre

source: Opposite end of the diameter
fr: Extrémité opposé du diamètre

source: D flat
fr: Plat en D

source: Remove
fr: Enlever

source: Height to remove from diameter
fr: Hauteur à enlever sur le diamètre

source: Rotation of flat
fr: Rotation du plat

source: Inside normal=0:Pocket=1:On the line=2:Outside=3
fr: Intérieur normal=0:Pochette=1:Sans compensation=2:Extérieur=3

source: Select tool path
fr: Sélectionnez chemin de l'outil

source: Arc lead-out
fr: Sortie avec arc

source: Not if on the line
fr: Pas sans compensation

source: User defined=0:Through=1:Bottom=2:Half=3:One quarter=4:Three quarter=5:G-Code=6
fr: Utilisateur=0:A travers=1:Egal au bas=2:Demi-profondeur=3:Un quart=4:Trois quart=5:G-Code=6

source: User depth
fr: Utilisateur

source: Finishing
fr: Finition

source: Finishing pass
fr: Passe de finition

source: None=0:Clockwise=2:Clockwise full depth=12:Counter-Clockwise=3:Counter-Clockwise full depth=13
fr: Aucun=0:Horaire=2:Horaire pleine profondeur=12:Anti-horaire=3:Anti-horaire pleine prof.=13

source: Conventional for better finish
fr: Conventionnel pour meilleure finition

source: Finishing cut
fr: Coupe finition

source: Last finishing cut
fr: Dernière coupe de finition

source: Circle by Center
fr: Cercle centré

source: <b>Create a Circle from it's center</b>&#10;Can add a flat
fr: <b>Créer un cercle en définissant le centre</b>&#10;possible d'ajouter un plat

source: Center of circle
fr: Centre du cercle

source: Left=0:Center=1:Right=2
fr: Gauche=0:Centre=1:Droite=2

source: Define X reference point
fr: Définir référence de X

source: Y axis align
fr: Align. axe Y

source: Top=0:Center=1:Bottom=2
fr: Haut=0:Centre=1:Bas=2

source: Define Y reference point
fr: Définir référence de Y

source: Drill Array
fr: Forage multiple

source: <b>Drill Lines of Holes</b>
fr: <b>Perçage de trous alignés</b>

source: Size and offsets
fr: Taille, décalage

source: Align axis
fr: Align. d'axe

source: X axis count
fr: Quantité axe X

source: Number of holes
fr: Nombre de trous

source: Y axis count
fr: Quantité axe Y

source: dX options
fr: Options dX

source: Between each hole=0:Overall=1
fr: Entre chaque trou=0:Hors-tout=1

source: Define dX
fr: Définir dX

source: dY options
fr: Options dY

source: Define dY
fr: Définir dY

source: Rotation of line
fr: Rotation de ligne

source: Drill start
fr: Début forage

source: Drill down to
fr: Prof. forage

source: User defined=0:Through=1:Center drill depth=2:Bottom=3:Half=4:One quarter=5:Three quarter=6:G-Code=7
fr: Utilisateur=0:A travers=1:Forage initial=2:Egal au bas=3:Demi-profondeur=4:Un quart=5:Trois quart=6:G-Code=7

source: Drill Irr Circle
fr: Forage irr circulaire

source: <b>Drill Irregular Circle</b>
fr: <b>Perçage en cercle irrégulier</b>

source: Count, positions
fr: Nombre, positions

source: Drilling params
fr: Params forage

source: Diameter of circle
fr: Diamètre du cercle

source: Drill center
fr: Forer le centre

source: Drill also at center
fr: Forer aussi le centre

source: Hole 1 At
fr: Trou #1

source: Hole 2 At
fr: Trou #2

source: Hole 3 At
fr: Trou #3

source: Hole 4 At
fr: Trou #4

source: Hole 5 At
fr: Trou #5

source: Hole 6 At
fr: Trou #6

source: Drill Circle
fr: Forage circulaire

source: <b>Drill a Regular Circle</b>
fr: <b>Perçage en cercle régulier</b>

source: Count, start, end
fr: Nombre, angle

source: Measure by
fr: Mesuré par

source: Diameter=1:Distance between holes=0
fr: Diamètre=1:Distance entre les trous=0

source: Select dimension option
fr: Sélectionnez option de dimension

source: Diameter or distance
fr: Diamètre ou distance

source: Angle of the first hole
fr: Angle du premier trou

source: Extend
fr: Étendue

source: Angle covered by holes
fr: Étendue angulaire des trous

source: Drill Single
fr: Forage unique

source: <b>Drill a Single hole</b>
fr: <b>Forage d'un trou unique</b>

source: X coordinate
fr: Coordonnée X

source: Y coordinate
fr: Coordonnée Y

source: <b>Create an Ellipse</b>
fr: <b>Créer un ellipse</b>

source: Center of ellipse
fr: Centre de l'ellipse

source: X Radius
fr: Rayon X

source: Radius in X axis
fr: Rayon de l'axe X

source: Y Radius
fr: Rayon Y

source: Radius in Y axis
fr: Rayon de l'axe Y

source: Control points
fr: Points de contrôle

source: Per quadrant, smoother with more
fr: Par quadrant, augmenter pour un meilleur lissé

source: A indexing
fr: Indexation de A

source: <b>Rotate A axis</b>
fr: <b>Rotation de l'axe A</b>

source: Number of steps
fr: Nombre d'arrêts

source: Angle covered by all items
fr: Angle de couverture

source: Workpiece
fr: Pièce

source: <b>Workpiece or Raw material used</b>
fr: <b>Pièce ou matériel brut</b>

source: Show workpiece
fr: Montrer la pièce

source: Milling params
fr: Fraisage

source: Define X reference
fr: Définir référence de X

source: Define Y reference
fr: Définir référence de Y

source: Z axis align
fr: Align. axe Z

source: Define Z reference
fr: Définir référence de Z

source: Height (Y)
fr: Hauteur (Y)

source: Y axis
fr: Axe Y

source: Width (X)
fr: Largeur (X)

source: X axis
fr: Axe X

source: Depth (Z)
fr: Profondeur (Z)

source: Z axis
fr: Axe Z

source: Z clear
fr: Dégag. vertical

source: Above surface or cut start
fr: Au-dessus début coupe

source: Rapid (Z)
fr: Dépl. rapide

source: Above Z clear
fr: Au-dessus dégagement vertical

source: Clear through
fr: À travers

source: Past bottom
fr: Sous le bas

source: Centerline align
fr: Align. axe central

source: X axis=0:Y axis=1:Z axis=2
fr: Axe X=0:Axe Y=1:Axe Z=2
