Repository: LinuxCNC/linuxcnc
Catalog: src/po/gmoccapy/*.po
Languages: bg, it, pt_br, uk

source: user mode selected
bg: избран потребителски режим
it: modalità utente selezionata
pt_br: Modo de usuário selecionado
uk: вибрано режим користувача

source: logo entry found = {0}
bg: намерен е запис на лого = {0}
it: logo trovato = {0}
pt_br: Entrada de logo encontrada = {0}
uk: знайдено запис логотипу = {0}

source: Logofile entry found, but could not be converted to path.
bg: Намерен е запис на логофайл, но той не може да бъде преобразуван в път.
it: Entrata Logfile trovata, ma non poteva essere convertita in percorso.
pt_br: A entrada Logofile foi encontrada, mas não pôde ser convertida em percurso.
uk: Запис у файлі логотипу знайдено, але його не вдалося перетворити на шлях.

source: The file path should not contain any spaces
bg: Пътят до файла не трябва да съдържа никакви интервали
it: Il percorso del file non deve contenere spazi
pt_br: O caminho do arquivo não deve conter espaços
uk: Шлях до файлу не повинен містити пробілів

source: Please check the console output.
bg: Моля, проверете конзолния изход.
it: Si prega di controllare l'uscita della console.
pt_br: Verifique a saída do console.
uk: Будь ласка, перевірте вивід консолі.

source: axis
bg: Ос
it: asse
pt_br: Eixo
uk: вісь

source: axes
bg: Оси
it: assi
pt_br: Eixos
uk: сокири

source: joint
bg: Става
it: giunto
pt_br: junta
uk: суглоб

source: joints
bg: Стави
it: giunti
pt_br: juntas
uk: суглоби

source: Press to home all {0}
bg: Натисни за нулиране на всички {0}
it: Premere per azzeramento assi {0}
pt_br: Pressione para referenciar todos os eixos {0}
uk: Натисніть, щоб перейти до головної сторінки {0}

source: Press to display previous homing button
bg: Натисни за да се покаже предипния бутон за нулиране
it: Premere per visualizzare il pulsante di azzeramento precedente
pt_br: Pressione para exibir o botão de referência anterior
uk: Натисніть, щоб відобразити попередню кнопку повернення додому

source: Press to home {0} {1}
bg: Натисни за нулиране {0} {1}
it: Premere per azzeramento assi {0}{1}
pt_br: Pressione para referenciar {0} {1}
uk: Натисніть на головну сторінку {0} {1}

source: Press to display next homing button
bg: Натисни за да се покаже следващия бутон за нулиране
it: Premere per visualizzare il pulsante di azzeramento successivo
pt_br: Pressione para exibir o próximo botão de referência
uk: Натисніть, щоб відобразити наступну кнопку самонаведення

source: Press to unhome all {0}
bg: Натиснете , за да отмените всички нулирания {0}
it: Premere per dis-azzeramento assi {0}
pt_br: Pressione para cancelar a referência de todos os eixos {0}
uk: Натисніть, щоб вивільнити всі {0}

source: Press to return to main button list
bg: Натисни за връщане към листа с главните бутони
it: Premere per tornare all'elenco dei pulsanti principali
pt_br: Voltar ao painel de botões principal
uk: Натисніть, щоб повернутися до головного списку кнопок

source: could not resolve the image path '{0}' given for button '{1}'
bg: не можа да се намери пътя към изображението '{0}', зададен за бутона '{1}'
pt_br: Não foi possível resolver o caminho da imagem '{0}' para o botão '{1}'
uk: не вдалося розпізнати шлях до зображення '{0}', вказаний для кнопки '{1}'

source: edit offsets
bg: Редактиране на офсетите
it: modifica compensazioni
pt_br: Editar offsets
uk: редагувати зміщення

source: Press to edit the offsets
bg: Натиснете , за да редактирате офсетите
it: Premere per modificare gli offset
pt_br: Pressione para editar os offsets
uk: Натисніть, щоб редагувати зміщення

source: Press to set touch off value for axis {0}
bg: Натиснете, за да зададете стойност на допир за ос {0}
it: Premere per impostare il valore di contatto per l'asse {0}
pt_br: Pressione para definir o valor de contato para o eixo {0}
uk: Натисніть, щоб встановити значення точки дотику для осі {0}

source: Press to reset all G92 offsets
bg: Натиснете , за да нулирате всички офсети на G92
it: Premere per ripristinare tutti gli offset G92
pt_br: Redefinir todos os offsets G92
uk: Натисніть, щоб скинути всі зміщення G92

source: Block Height
bg: Блок Височина
it: Blocco Altezza
pt_br: Bloco Altura
uk: Блок Висота

source: Press to enter new value for block height
bg: Натиснете , за да въведете нова стойност за височината на блока
it: Premere per inserire un nuovo valore per l'altezza del blocco
pt_br: Pressione para inserir um novo valor para a altura do bloco
uk: Натисніть, щоб ввести нове значення висоти блоку

source: set selected
bg: задаване на избран
it: set selezionato
pt_br: Definir Selecionado
uk: набір вибраний

source: Press to set the selected coordinate system to be the active one
bg: Натиснете , за да зададете активна по подразбиране координатна система
it: Premere per impostare il sistema di coordinate selezionato come attivo
pt_br: Ativar o sistema de coordenadas selecionado
uk: Натисніть, щоб встановити вибрану систему координат активною

source: No valid probe config in INI file. Tool measurement disabled.
bg: Няма валидна конфигурация на сондата в INI файла. Измерването на инструмента е деактивирано.
pt_br: Nenhuma configuração de sonda válida no arquivo INI. Medição da ferramenta desativada.
uk: У INI-файлі немає дійсної конфігурації зонда. Вимірювання інструменту вимкнено.

source: Found valid probe config in INI file. Will use auto tool measurement.
bg: Намерена е валидна конфигурация на сондата във файла INI. Ще използва автоматично измерване на инструмента.
it: Trovata valida sonda config nel file INI. Userà la misurazione automatica dell'utensile.
pt_br: Encontrada configuração de sonda válida no arquivo INI. Usará a medição automática da ferramenta.
uk: Знайдено дійсну конфігурацію зонда у файлі INI. Буде використано автоматичне вимірювання інструменту.

source: To many increments given in INI file for this screen. Only the first 10 will be reachable through this screen.
bg: Прекалено много стъпки са зададени в INI файла за този екран. Само първите 10 ще бъдат достъпни чрез този екран.
pt_br: Número máximo de incrementos fornecidos no arquivo INI para essa tela. Somente os primeiros 10 poderão ser acessados por meio dessa tela.
uk: Забагато кроків, заданих у INI-файлі для цього екрана. Через цей екран буде доступно лише перші 10.

source: Continuous
bg: Непрекъснат
it: Continuo
pt_br: Contínuo
uk: Безперервний

source: unknown jog command {0}
bg: непозната команда за движение {0}
it: comando sconosciuto jog {0}
pt_br: Comando de jog desconhecido {0}
uk: невідома команда поштовху {0}

source: Press to jog axis {0}
bg: Натиснете , за да се движите по оста {0}
it: Premere l'asse jog {0}
pt_br: Pressione para mover o eixo {0}
uk: Натисніть, щоб перемістити вісь {0}

source: Press to jog joint {0}
bg: Натиснете за движение на става {0}
it: Premere per ruotare {0}
pt_br: Pressione para mover a junta{0}
uk: Натисніть, щоб перемістити суглоб {0}

source: Press to display previous macro button
bg: Натиснете, за да покажете предишния макробутон
it: Premere per visualizzare il tasto macro precedente
pt_br: Pressione para exibir o botão de macro anterior
uk: Натисніть, щоб відобразити попередню кнопку макросу

source: Press to run macro {0}
bg: Натиснете , за да стартирате макрос {0}
it: Premere per eseguire macro {0}
pt_br: Pressione para executar a macro {0}
uk: Натисніть, щоб запустити макрос {0}

source: Press to display next macro button
bg: Натиснете, за да покажете следващия макробутон
it: Premere per visualizzare il prossimo pulsante macro
pt_br: Pressione para exibir o próximo botão de macro
uk: Натисніть, щоб відобразити наступну кнопку макросу

source: Press to display the virtual keyboard
bg: Натиснете , за да покажете виртуалната клавиатура
it: Premere per visualizzare la tastiera virtuale
pt_br: Pressione para exibir o teclado virtual
uk: Натисніть, щоб відобразити віртуальну клавіатуру

source: * GMOCCAPY ERROR *
bg: * GMOCCAPY ГРЕШКА *
it: * ERRORE DI GMOCCAPY *
pt_br: GMOCCAPY ERRO
uk: * ПОМИЛКА GMOCCAPY *

source: this is not a lathe, as a lathe must have at least
bg: Това не е струг, тъй като стругът трябва да има поне
it: questo non è un tornio, come un tornio deve avere almeno
pt_br: Isso não é um torno, pois um torno deve ter pelo menos
uk: це не токарний верстат, оскільки токарний верстат повинен мати щонайменше

source: an X and an Z axis
bg: ос X и Z
it: un asse X e un asse Z
pt_br: um eixo X e um eixo Z
uk: вісь X та Z

source: Wrong lathe configuration, we will leave here
bg: Грешна конфигурация на струга, ще напуснем тук
it: Configurazione del tornio sbagliata, lasciamo qui
pt_br: Configuração incorreta do torno, terminamos aqui
uk: Неправильна конфігурація токарного верстата, ми залишимося тут

source: Very critical situation
bg: Много критична ситуация
it: Situazione molto critica
pt_br: Situação muito crítica
uk: Дуже критична ситуація

source: this is not a usual config
bg: това не е обичайна конфигурация
it: questo non è un config solito
pt_br: Essa não é uma configuração comum
uk: це не звичайна конфігурація

source: we miss one of X , Y or Z axis
bg: пропускаме една от осите X , Y или Z
it: manca uno degli assi X, Y o Z
pt_br: Está faltando um dos eixos X, Y ou Z
uk: ми пропускаємо одну з осей X, Y або Z

source: We will use by axisletter ordered jog button
bg: Ще използваме заданието от axisletter jog бутон
it: Useremo pulsante jog ordinato per lettera asse
pt_br: Usaremos o botão de movimentação ordenado por letra de eixo
uk: Ми будемо використовувати кнопку поетапного джогу, упорядковану за віссю,

source: mm/min
bg: мм/мин
uk: мм/хв

source: inch/min
bg: инч/мин
it: pollici/min
pt_br: pol/min
uk: дюйм/хв

source: No embedded tabs configured or invalid configuration. No tabs will be added!
bg: Няма конфигурирани вградени бутони или конфигурацията е невалидна. Няма да бъдат добавени табове!
it: Nessuna scheda incorporata configurata o non valida. Nessuna scheda verrà aggiunta!
pt_br: Nenhuma guia incorporada configurada ou configuração inválida. Nenhuma guia é adicionada!
uk: Вбудовані вкладки не налаштовані або конфігурація недійсна. Вкладки не будуть додані!

source: ERROR, trying to initialize the user tabs or panels, check for typos
bg: Грешка, опитвам се да инициализирам потребителските табове или панели, проверете за печатни грешки
it: ERRORE, cercando di inizializzare le schede dell'utente o i pannelli, controlla i tipi
pt_br: ERRO, tentando inicializar as guias ou painéis do usuário, verifique se há erros de digitação
uk: ПОМИЛКА, спроба ініціалізувати вкладки або панелі користувача, перевірте наявність друкарських помилок

source: Did not find a toolfile file in [EMCIO] TOOL_TABLE
bg: Не е намерен файл с инструменти в [EMCIO] TOOL_TABLE
it: Non ho trovato un file di file di strumenti in [EMCIO] TOOL_TABLE
pt_br: Nenhum arquivo para gerenciamento de ferramentas especificado no arquivo INI em [EMCIO] TOOL_TABLE
uk: Не знайдено файл інструмента в [EMCIO] TOOL_TABLE

source: Enter value
bg: Въведете стойност
it: Inserisci il valore
pt_br: Inserir valor
uk: Введіть значення

source: Conversion error !
bg: Грешка при конвертиране!
it: Errore di conversione!
pt_br: Erro de conversão!
uk: Помилка конвертації!

source: Audio available!
bg: Налично аудио!
it: Audio disponibile!
pt_br: Áudio disponível!
uk: Аудіо доступне!

source: Audio enabled!
bg: Налично аудио!
it: Audio attivato!
pt_br: Áudio habilitado!
uk: Звук увімкнено!

source: Audio disabled!
bg: Забранено аудио!
it: Audio disabilitato!
pt_br: Áudio desabilitado!
uk: Звук вимкнено!

source: No audio available! PYGST library not installed? Is python-gstX.XX installed?
bg: Няма налично аудио! Библиотеката PYGST не е инсталирана? Инсталирана ли е библиотеката python-gstX.XX?
it: Nessun audio disponibile! Libreria PYGST non installata? Python-gstX.XX è installato?
pt_br: Não há áudio disponível! A biblioteca PYGST não está instalada? O python-gstX.XX está instalado?
uk: Аудіо недоступно! Бібліотека PYGST не встановлена? Чи встановлено python-gstX.XX?

source: Joint mode
bg: Става режим
it: Modo joint
pt_br: Junta modo
uk: Спільний режим

source: Virtual keyboard program found : <onboard>
bg: Намерена е програма за виртуална клавиатура : <onboard>
it: Programma di tastiera virtuale trovato: <onboard>
pt_br: Teclado virtual encontrado: <onboard>
uk: Знайдено програму для віртуальної клавіатури : <onboard>

source: No virtual keyboard installed, we checked for <onboard>. Try 'sudo apt-get install onboard'.
bg: Няма инсталирана виртуална клавиатура, проверихме за <onboard>. Опитайте със 'sudo apt-get install onboard'.
it: Nessuna tastiera virtuale installata, abbiamo controllato per <onboard>. Prova 'sudo apt-get install onboard'.
pt_br: Nenhum teclado virtual instalado, desmarcado em <onboard>. Tente 'sudo apt-get install onboard'.
uk: Віртуальна клавіатура не встановлена, ми перевірили наявність <onboard>. Спробуйте «sudo apt-get install onboard».

source: Error with launching virtual keyboard. Is onboard installed?Try sudo apt-get install onboard
bg: Грешка при стартирането на виртуалната клавиатура. Инсталирана ли е onboard?Опитайте sudo apt-get install onboard
it: Errore con il lancio della tastiera virtuale. È installata a bordo? Prova sudo apt-get install onboard
pt_br: Erro ao iniciar o teclado virtual na tela. O pacote "onboard" está instalado? Tente 'sudo apt-get install onboard'
uk: Помилка запуску віртуальної клавіатури. Чи встановлено вбудовану клавіатуру? Спробуйте sudo apt-get install onboard

source: interrupt running macro
bg: прекъсване на работещ макрос
it: interrompi la macro in esecuzione
pt_br: Interromper a execução da macro
uk: переривання виконання макросу

source: Did not find a parameter file in [RS274NGC] PARAMETER_FILE
bg: Не беше намерен файл с параметри в [RS274NGC] PARAMETER_FILE
it: Non ha trovato un file di parametri in [RS274NGC] PARAMETER_FILE
pt_br: Nenhum arquivo de parâmetro encontrado em [RS274NGC] PARAMETER_FILE
uk: Не знайдено файлу параметрів у [RS274NGC] PARAMETER_FILE

source: Select the file you want to be loaded at program start
bg: Изберете файла, който искате да бъде зареден при стартиране на програмата
it: Selezionare il file che si desidera caricare all'inizio del programma
pt_br: Selecione o arquivo que você deseja que seja carregado no início do programa
uk: Виберіть файл, який потрібно завантажити під час запуску програми

source: Message type {0} not supported
bg: Тип на съобщението {0} не се поддържа
it: Tipo di messaggio {0} non supportato
pt_br: O tipo de mensagem {0} não é compatível
uk: Тип повідомлення {0} не підтримується

source: Unknown error type and no error text given
bg: Неизвестен тип грешка и не е даден текст на грешката
it: Tipo di errore sconosciuto e nessun testo di errore dato
pt_br: Tipo de erro desconhecido e nenhum texto de erro especificado
uk: Невідомий тип помилки та не вказано текст помилки

source: Important Warning
bg: Важно предупреждение
it: Attenzione importante
pt_br: Aviso importante
uk: Важливе попередження

source: External ESTOP is set, could not change state!
bg: Външен ESTOP е зададен, състоянието не може да се промени!
it: ESTOP esterno è impostato, non posso cambiare stato!
pt_br: A parada de emergência externa está ativa, não foi possível alterar o status!
uk: Зовнішній ESTOP встановлено, не вдалося змінити стан!

source: Could not switch the machine on, is limit switch activated?
bg: Не може да включите машината, активиран ли е крайният изключвател?
it: Non è possibile accendere la macchina, è l'interruttore limite attivato?
pt_br: Não foi possível ligar a máquina. O interruptor de limite está ativado?
uk: Не вдалося увімкнути машину, чи спрацював кінцевий вимикач?

source: No file loaded
bg: Не е зареден никакъв файл
it: Nessun file caricato
pt_br: Nenhum arquivo carregado
uk: Файл не завантажено

source: It is not possible to change to MDI Mode at the moment
bg: В момента не е възможно да преминете към режим MDI
it: Non è possibile cambiare in modalità MDI al momento
pt_br: Não é possível mudar para o modo MDI no momento
uk: Наразі неможливо перейти в режим MDI

source: It is not possible to change to Auto Mode at the moment
bg: В момента не е възможно да се премине към автоматичен режим
it: Non è possibile cambiare in Modalità Auto al momento
pt_br: Não é possível mudar para o modo automático no momento
uk: Наразі неможливо перейти в автоматичний режим

source: Enter value:
bg: Въведете стойност:
it: Inserisci il valore:
pt_br: Insira o valor:
uk: Введіть значення:

source: This button will show or hide the keyboard
bg: Този бутон ще покаже или скрие клавиатурата
it: Questo pulsante mostrerà o nasconderà la tastiera
pt_br: Esse botão mostrará ou ocultará o teclado
uk: Ця кнопка покаже або приховає клавіатуру

source: Mode change is only allowed if the interpreter is idle!
bg: Промяна на режима е позволен само ако интерпретаторът е неактивен!
it: Il cambiamento di modalità è consentito solo se l'interprete è inattivo!
pt_br: A mudança de modo só é possível quando o programa interpretador está inativo!
uk: Зміна режиму дозволена лише тоді, коли інтерпретатор неактивний!

source: No tool description available
bg: Няма налично описание на инструмента
it: Nessuna descrizione dell'utensile disponibile
pt_br: Não há descrição de ferramenta disponível
uk: Опис інструменту недоступний

source: Halo, welcome to the test message {0}
bg: Здравей, добре дошъл в тестовото съобщение {0}
it: Halo, benvenuto al messaggio di prova {0}
pt_br: Olá, seja bem-vindo à mensagem de teste {0}
uk: Вітаю з тестовим повідомленням {0}

source: Hal Pin is low, Access denied
bg: Hal Pin е нисък, достъпът отказан
it: Hal Pin è basso, Accesso negato
pt_br: O pino Hal não está ativo, acesso negado
uk: Низький рівень PIN-коду Hal, доступ заборонено

source: wrong code entered, Access denied
bg: въведен грешен код, достъпът е отказан
it: inserito codice sbagliato, Accesso negato
pt_br: Código incorreto, acesso negado
uk: введено неправильний код, доступ заборонено

source: Just to warn you
bg: Само за да те предупредя
it: Solo per avvertirti
pt_br: Apenas um aviso
uk: Просто щоб попередити тебе

source: INFO:
bg: ИНФОРМАЦИЯ:
uk: ІНФОРМАЦІЯ:

source: Classicladder real-time component not detected
bg: Компонентът в реално време Classicladder не е открит
it: Componente Classicladder realtime non trovato
pt_br: O componente em tempo real Classicladder não foi encontrado
uk: Компонент Classicladder реального часу не виявлено

source: Do you really want to delete the MDI history?
bg: Наистина ли искате да изтриете MDI хронологията?
it: Vuoi davvero eliminare la storia MDI?
pt_br: Você realmente deseja excluir o histórico do MDI?
uk: Ви справді хочете видалити історію MDI?

source: This will not delete the MDI History file, but will
bg: Това няма да изтрие файла с историята на MDI, а ще
it: Questo non cancellerà il file MDI History, ma sarà
pt_br: Isso não excluirá o arquivo de histórico do MDI, mas
uk: Це не видалить файл історії MDI, але

source: delete the listbox entries for this session.
bg: изтрийте записите в списъка за тази сесия.
it: cancellare le voci della lista per questa sessione.
pt_br: Excluir as entradas da listbox para essa sessão.
uk: видалити записи списку для цього сеансу.

source: Attention!!
bg: Внимание!!
it: Attenzione!
pt_br: Atenção!!
uk: Увага!!

source: Exit and discard changes?
bg: Изход и отхвърляне на промените?
it: Uscire e eliminare le modifiche?
pt_br: Sair e descartar as alterações?
uk: Вийти та скасувати зміни?

source: Attention!
bg: Внимание!
it: Attenzione!
pt_br: Atenção!!
uk: Увага!

source: Enter value for diameter
bg: Въведете стойност за диаметър
it: Inserisci il valore per il diametro
pt_br: Digite o valor do diâmetro
uk: Введіть значення діаметра

source: Set diameter to:
bg: Задайте диаметър на:
it: Impostare il diametro a:
pt_br: Definir o diâmetro como:
uk: Встановити діаметр на:

source: Enter value for radius
bg: Въведете стойност за радиус
it: Inserisci il valore per il raggio
pt_br: Digite o valor do raio
uk: Введіть значення радіуса

source: Set radius to:
bg: Задайте радиус на:
it: Impostare il raggio a:
pt_br: Definir o raio como:
uk: Встановити радіус на:

source: Enter value for axis {0}
bg: Въведете стойност за ос {0}
it: Inserisci il valore per asse {0}
pt_br: Digite o valor do eixo {0}
uk: Введіть значення для осі {0}

source: Set axis {0} to:
bg: Задайте ос {0} на:
it: Impostare l'asse {0} a:
pt_br: Definir o eixo {0} como:
uk: Встановити вісь {0} на:

source: Conversion error in btn_set_value!
bg: Грешка при преобразуване в btn_set_value!
it: Errore di conversione in btn_set_value!
pt_br: Erro de conversão em btn_set_value!
uk: Помилка конвертації в btn_set_value!

source: Please enter only numerical values. Values have not been applied
bg: Моля, въведете само цифрови стойности. Стойностите не са приложени
it: Si prega di inserire solo valori numerici. I valori non sono stati applicati
pt_br: Insira apenas valores numéricos. Os valores não foram aplicados
uk: Будь ласка, вводьте лише числові значення. Значення не застосовано

source: You did not select a system to be changed to, so nothing will be changed
bg: Не сте избрали система, която да бъде променена, така че нищо няма да бъде променено
it: Non hai selezionato un sistema in cui essere cambiato, quindi nulla sarà cambiato
pt_br: Você não selecionou um sistema para o qual mudar, portanto, nada será alterado
uk: Ви не вибрали систему для зміни, тому нічого не зміниться

source: Important Warning!
bg: Важно предупреждение!
it: Attenzione importante!
pt_br: Aviso Importante!
uk: Важливе попередження!

source: Enter the block height
bg: Въведете височината на блока
it: Inserisci l'altezza del blocco
pt_br: Digite a altura do bloco
uk: Введіть висоту блоку

source: Block height measured from base table
bg: Височина на блока, измерена от основната маса
it: Altezza del blocco misurata dalla tavola di base
pt_br: Altura do bloco medida a partir da base da mesa
uk: Висота блоку, виміряна від базової таблиці

source: Conversion error in btn_block_height!
bg: Грешка при преобразуването в btn_block_height!
it: Errore di conversione in btn_block_height!
pt_br: Erro de conversão em btn_block_height!
uk: Помилка конвертації в btn_block_height!

source: Please enter only numerical values Values have not been applied
bg: Моля, въведете само цифрови стойности. Стойностите не са приложени
it: Si prega di inserire solo valori numerici I valori non sono stati applicati
pt_br: Digite apenas valores numéricos Os valores não foram aplicados
uk: Будь ласка, вводьте лише числові значення Значення не застосовано

source: Please remove the mounted tool and press OK when done
bg: Моля, премахнете монтирания инструмент и натиснете OK, когато сте готови
it: Si prega di rimuovere l'utensile montato e premere OK quando finito
pt_br: Remova a ferramenta e clique em OK
uk: Будь ласка, зніміть встановлений інструмент і натисніть OK після завершення

source: Please change to tool # {0:d} {1} then click OK.
bg: Моля, сменете инструмента # {0:d} {1} след което щракнете върху OK.
it: Si prega di cambiare l'utensile # {0:d} {1} quindi fare clic su OK.
pt_br: Por favor, mude para a ferramenta # {0:d} {1} e clique em OK.
uk: Будь ласка, змініть на інструмент # {0:d} {1} та натисніть кнопку «ОК».

source: Tool # {0:d} not in the tool table!
bg: Инструмент # {0:d} не е в таблицата с инструменти!
it: Utensile # {0:d} non nella tabella degli utensili!
pt_br: Ferramenta # {0:d} não está na tabela de ferramentas!
uk: Інструмент № {0:d} відсутній у таблиці інструментів!

source: Manual Tool change
bg: Ръчна смяна на инструмента
it: Cambio utensile Manuale
pt_br: Troca manual de ferramentas
uk: Ручна зміна інструменту

source: Tool Change has been aborted!
bg: Промяната на инструмента е прекратена!
it: Cambio Utensile è stato interrotto!
pt_br: Troca de ferramentas cancelada!
uk: Зміну інструменту перервано!
