Repository: LinuxCNC/linuxcnc
Catalog: src/po/gmoccapy/*.po
Languages: bg, it, pt_br, uk

source: The old tool will remain set!
bg: Старият инструмент ще остане настроен!
it: Il vecchio utensile rimarrà impostato!
pt_br: A ferramenta antiga permanecerá configurada!
uk: Старий інструмент залишиться налаштованим!

source: You are trying to delete the tool mounted in the spindle
bg: Опитвате се да изтриете инструмента, монтиран в шпиндела.
it: Stai cercando di eliminare l'utensile montato nel mandrino
pt_br: Você está tentando excluir a ferramenta montada no spindle
uk: Ви намагаєтеся видалити інструмент, встановлений у шпинделі

source: This is not allowed, please change tool prior to delete it
bg: Това не е разрешено, моля, променете инструмента, преди да го изтриете
it: Questo non è consentito, si prega di cambiare utensile prima di cancellarlo
pt_br: Isso não é permitido. Altere a ferramenta antes de excluí-la
uk: Це не дозволено, будь ласка, змініть інструмент, перш ніж видаляти його

source: Warning Tool can not be deleted!
bg: Предупреждение Инструментът не може да бъде изтрит!
it: Attenzione Utensile non può essere cancellato!
pt_br: Aviso: a ferramenta não pode ser excluída!
uk: Увага: Інструмент не можна видалити!

source: No or multiple tools selected in the tool table.
bg: Няма или са избрани няколко инструмента в таблицата с инструменти.
it: Nessuno o più utensili selezionati nella tabella degli utensili.
pt_br: Nenhuma ou várias ferramentas selecionadas na tabela de ferramentas.
uk: У таблиці інструментів не вибрано жодного інструменту або вибрано кілька інструментів.

source: Please select only one tool in the table!
bg: Моля, изберете само един инструмент в таблицата!
it: Si prega di selezionare un solo utensile nella tabella!
pt_br: Selecione apenas uma ferramenta na tabela!
uk: Будь ласка, виберіть лише один інструмент у таблиці!

source: Warning Tool Touch off not possible!
bg: Предупреждение Не е възможно мерене с докосване!
it: Attenzione Non è possibile Contatto Utensile!
pt_br: Aviso: Não é possível tocar na ferramenta!
uk: Попередження Інструмент Дотик неможливий!

source: You can not touch off a tool, which is not mounted in the spindle!
bg: Не можете да докосвате инструмент, който не е монтиран на шпиндела!
it: Non è possibile toccare un utensile che non è montato nel mandrino!
pt_br: Não é possível tocar em uma ferramenta que não esteja montada no spindle
uk: Не можна торкатися інструменту, який не встановлений у шпинделі!

source: Your selection has been reset to the tool in spindle.
bg: Изборът ви е нулиран към инструмента в шпиндела.
it: La tua selezione è stata ripristinata all'utensile nel mandrino.
pt_br: Sua seleção foi redefinida para a ferramenta no spindle.
uk: Ваш вибір скинуто до інструменту в шпинделі.

source: Tool touch off is not possible with cutter radius compensation switched on!
bg: докосването на инструмента не е възможно при включена компенсация на радиуса на фрезата!
it: Contatto utensile non è possibile con la compensazione raggio utensile attivo!
pt_br: O apalpamento da ferramenta não é possível quando a compensação do raio da ferramenta está ativada!
uk: Дотик інструмента неможливий, якщо ввімкнено компенсацію радіуса різця!

source: Please emit an G40 before tool touch off.
bg: Моля, изпълнете G40, преди инструментът да се докосне.
it: Si prega di emettere un G40 prima del contatto utensile.
pt_br: Por favor, emita um G40 antes do toque da ferramenta.
uk: Будь ласка, видайте код G40 перед дотиком інструменту.

source: Real big error!
bg: Наистина голяма грешка!
it: Un grandissimo errore!
pt_br: Um erro grave!
uk: Справді велика помилка!

source: You managed to come to a place that is not possible in on_btn_tool_touchoff
bg: Успяхте да стигнете до място, което не е възможно в on_btn_tool_touchoff
it: Sei riuscito a venire in un posto che non è possibile in on_btn_tool_touchoff
pt_br: Você conseguiu chegar a um lugar que não é possível em on_btn_tool_touchoff
uk: Вам вдалося потрапити туди, куди неможливо потрапити в on_btn_tool_touchoff

source: Enter value for axis {0} to set:
bg: Въведете стойност за оста {0}, която да зададете:
it: Inserisci il valore per impostare asse {0} :
pt_br: Digite o valor do eixo {0} a ser definido:
uk: Введіть значення для осі {0}, яке потрібно встановити:

source: Set parameter of tool {0:d} and axis {1} to:
bg: Задайте параметър на инструмента {0:d} и на оста {1} на:
it: Impostare il parametro dell'utensile {0:d} e l'asse {1} a:
pt_br: Defina o parâmetro da ferramenta {0:d} e do eixo {1} como:
uk: Встановіть параметр інструмента {0:d} та осі {1} на:

source: Conversion error because of wrong entry for touch off axis {0}
bg: Грешка при преобразуването поради неправилно въвеждане на данни за изключена ос на докосване {0}
it: Errore di conversione a causa del valore sbagliato per il contatto asse {0}
pt_br: Erro de conversão devido a entrada incorreta para apalpação de ferramenta para o eixo {0}
uk: Помилка конвертації через неправильне введення для осі дотику поза межами поля {0}

source: Enter the tool number as integer
bg: Въведете номера на инструмента като цяло число
it: Inserisci il numero dell'utensile come intero
pt_br: Digite o número da ferramenta como um número inteiro
uk: Введіть номер інструменту як ціле число

source: Select the tool to change
bg: Изберете инструмента за смяна
it: Selezionare l'utensile da cambiare
pt_br: Selecione a ferramenta a ser alterada
uk: Виберіть інструмент для зміни

source: Conversion error because of wrong entry for tool number.
bg: Грешка при преобразуването поради неправилно въвеждане на номера на инструмента.
it: Errore di conversione a causa della valore sbagliato per il numero utensile.
pt_br: Erro de conversão causado pela entrada incorreta do número da ferramenta.
uk: Помилка конвертації через неправильне введення номера інструменту.

source: Enter only integer numbers!
bg: Въведете само цели числа!
it: Inserisci solo numeri interi!
pt_br: Digite apenas números inteiros!
uk: Вводьте лише цілі числа!

source: Selected tool is already in spindle, no change needed.
bg: Избраният инструмент вече е в шпиндела, не е необходима промяна.
it: L'utensile selezionato è già sul mandrino, nessun cambiamento necessario.
pt_br: A ferramenta selecionada já está no spindle, não é necessária nenhuma alteração.
uk: Вибраний інструмент вже знаходиться в шпинделі, жодних змін не потрібно.

source: you selected no or more than one tool, the tool selection must be unique
bg: не сте избрали нито един инструмент или сте избрали повече от един инструмент, изборът на инструмент трябва да е уникален
it: hai selezionato nessuno o più di un utensile, la selezione degli utensili deve essere unica
pt_br: você não selecionou nenhuma ou mais de uma ferramenta, a seleção da ferramenta deve ser exclusiva
uk: якщо ви не вибрали жодного інструмента або вибрали більше одного, вибір інструмента має бути унікальним

source: Could not understand the entered tool number. Will not change anything!
bg: Въведеният номер на инструмента не можа да бъде разбран. Нищо няма да се промени!
it: Non riesco a capire il numero di utensile inserito. Non cambierà niente!
pt_br: Não foi possível entender o número de ferramenta inserido. Nenhuma modificação feita!
uk: Не вдалося розпізнати введений номер інструменту. Нічого не змінюватиметься!

source: World mode
bg: World режим
it: Modo globale
pt_br: Coordenadas modo
uk: Світовий режим

source: Axis jogging is only allowed in world mode, but you are in joint mode!
bg: Движението по оста е разрешено само в световен режим, но вие сте в съвместен режим!
it: Il jogging dell'asse è consentito solo in modalità macchina, ma siete in modalità joint!
pt_br: A movimentação de eixos só é permitida no modo de coordenadas, mas você está no modo de juntas!
uk: Переміщення по осі дозволено лише у світовому режимі, але ви перебуваєте у спільному режимі!

source: Enter System Unlock Code
bg: Въведете код за отключване на системата
it: Inserisci il codice di sblocco del sistema
pt_br: Digite o código de desbloqueio
uk: Введіть код розблокування системи

source: Enter the value to set
bg: Въведете стойността, която искате да зададете
it: Inserisci il valore da impostare
pt_br: Digite o valor a ser definido
uk: Введіть значення, яке потрібно встановити

source: Operator Message
bg: Съобщение на оператора
it: Messaggio Operatore
pt_br: Nota do operador
uk: Повідомлення оператора

source: _Yes
bg: _Да
it: _Sì
pt_br: _Sim
uk: _Так

source: _No
bg: _Не
pt_br: _Não
uk: _Ні

source: _Ok
bg: _Ок
uk: _Гаразд

source: Restart Entry
bg: Рестартиране на запис
it: Immissione Riavvio
pt_br: Reiniciar entrada
uk: Перезавантажити вхід

source: _Up
bg: _нагоре
it: S_u
pt_br: _Acima
uk: _Вгору

source: _Down
bg: _Надолу
it: _Giù
pt_br: _Abaixo
uk: _Вниз

source: _Jump to
bg: Прескачане към
it: _Salta a
pt_br: _Pular para
uk: _Перейти до

source: **** gmoccapy can only handle 9 axis, but you have given {0} through your INI file.
bg: **** gmoccapy може да обработва само 9 оси, но вие сте дали {0} чрез вашия INI файл.
it: **** gmoccapy può gestire solo 9 assi, ma hai dato {0} attraverso il file INI.
pt_br: **** gmoccapy só pode lidar com 9 eixos, mas você forneceu {0} por meio do arquivo INI.
uk: **** gmoccapy може обробляти лише 9 осей, але ви надали {0} через свій INI-файл.

source: gmoccapy will not start ****
bg: gmoccapy няма да започне ****
it: gmoccapy non inizierà ****
pt_br: O gmoccapy não iniciará ****
uk: gmoccapy не запускається ****

source: No subroutine folder or program prefix is given in the INI file!
bg: В INI файла не е дадена папка на подпрограма или програмен префикс!
it: Nessuna cartella subroutine o prefisso del programma è presente nel file INI!
pt_br: Nenhuma entrada para a pasta de subrotinas ou prefixo de programa especificado no arquivo INI!
uk: У INI-файлі не вказано папку підпрограм або префікс програми!

source: Error trying to delete the message with number {0}
bg: Грешка при опит за изтриване на съобщението с номер {0}
it: Errore cercando di eliminare il messaggio con il numero {0}
pt_br: Erro ao tentar excluir a mensagem número {0}
uk: Помилка під час спроби видалити повідомлення з номером {0}

source: pause the running program
bg: Пауза на изпълняващата се програма
it: pausa il programma in esecuzione
pt_br: Pausa o programa em execução
uk: призупинити запущену програму

source: default
bg: по подразбиране
it: predefinito
pt_br: Valor padrão
uk: за замовчуванням

source: No Program loaded
bg: Няма заредена програма
it: Nessun programma caricato
pt_br: Nenhum programa carregado
uk: Програма не завантажена

source: blockheight = 0.0
bg: височина на блока = 0.0
it: altezzablocco = 0.0
pt_br: Altura do bloco = 0,0
uk: висота блоку = 0.0

source: view perspective
bg: изглед в перспектива
it: vista prospettica
pt_br: Vista em perspectiva
uk: перспектива перегляду

source: view along the X axis from positive to negative
bg: изглед по оста Y от положителен към отрицателен
it: vista lungo l'asse X da positivo a negativo
pt_br: Vista ao longo do eixo X, de positivo para negativo
uk: вид вздовж осі X від позитивного до негативного

source: view along the Y axis from positive to negative
bg: изглед по оста Y от положителен към отрицателен
it: vista lungo l'asse Y da positivo a negativo
pt_br: Vista ao longo do eixo Y, de positivo para negativo
uk: вид вздовж осі Y від позитивного до негативного

source: view along the Y axis from positive to negative as viewn for a back tool lathe
bg: изглед по оста Y от положително към отрицателно като изглед за струг за заден инструмент
it: vista lungo l'asse Y da positivo a negativo come visualizzato per un utensile tornio posteriore
pt_br: Vista ao longo do eixo Y, de positivo para negativo, como visto em um torno de ferramenta traseira
uk: вид вздовж осі Y від позитивного до негативного, як вид для токарного верстата із заднім інструментом

source: view along the Z axis from positive to negative
bg: изглед по оста Y от положителен към отрицателен
it: vista lungo l'asse Z da positivo a negativo
pt_br: Vista ao longo do eixo Z, de positivo para negativo
uk: вид вздовж осі Z від позитивного до негативного

source: Zoom in
bg: Увеличи
it: Ingrandisci
pt_br: Ampliar o zoom
uk: Збільшити масштаб

source: Zoom out
bg: Намали
it: Riduci
pt_br: Diminuir o zoom
uk: Зменшити масштаб

source: Show or hide dimensions
bg: Показване или скриване на размерите
it: Mostrare o nascondere dimensioni
pt_br: Mostrar ou ocultar dimensões
uk: Показати або приховати розміри

source: Show or hide tool path
bg: Показване или скриване на пътя на инструмента
it: Mostra o nascondi il percorso utensile
pt_br: Mostrar ou ocultar o caminho da ferramenta
uk: Показати або приховати шлях інструменту

source: clear plot
bg: изчистване на екрана
it: cancella percorso
pt_br: Excluir caminho da ferramenta
uk: чіткий сюжет

source: Preview
bg: Преглед
it: Anteprima
pt_br: Prévia
uk: Попередній

source: Offset Page
bg: Страница с отмествания
it: Offset Pagina
pt_br: Página de Offset
uk: Зсувна сторінка

source: Tooledit
bg: Редакция на инструментите
it: Editore Tabella Utensili
pt_br: Editar ferramentas
uk: Інструментальне редагування

source: File Selection
bg: Избор на файл
it: Selezione file
pt_br: Seleção de arquivos
uk: Вибір файлу

source: jog axes
bg: Движение по ОС
it: movimento assi
pt_br: Mover eixos
uk: осі поштовху

source: jog joints
bg: Движение по стави
it: articolazioni jog
pt_br: Mover juntas
uk: джог-джогінги

source: Logo
bg: Лого
uk: Логотип

source: Ignore limits
bg: Пренебрегване на лимитите
it: Ignora limiti
pt_br: Ignorar o interruptor de limite
uk: Ігнорувати обмеження

source: <b>Jogging</b>
bg: <b>Движение</b>
it: <b>Movimento assi</b>
pt_br: <b>Movimento manual</b>
uk: <b>Біг підтюпцем</b>

source: Shows the code to execute
bg: Показва кода за изпълнение
it: Mostra il codice da eseguire
pt_br: Exibe o código a ser executado
uk: Показує код для виконання

source: Search fwd
bg: Търсене напред
it: Ricerca Avanti
pt_br: Procurar avançar
uk: Пошук fwd

source: Search back
bg: Търсене обратно
it: Ricerca Indietro
pt_br: Pesquisar voltar
uk: Пошук назад

source: Undo
bg: Отмяна
it: Annulla azione
pt_br: Anular
uk: Відмінити

source: Redo
bg: Повтаряне
it: Riesegui
pt_br: Refazer
uk: Повторити

source: Replace
bg: Заместване
it: Sostituisci
pt_br: Substituir
uk: Замінити

source: Information over the tool in spindle
bg: Информация за инструмента в шпиндела
it: Informazioni sull'utensile nel mandrino
pt_br: Informações sobre a ferramenta utilizada
uk: Інформація про інструмент у шпинделі

source: Tool no.
bg: Инструмент номер.
it: Utensile n.
pt_br: Ferramenta n°.
uk: № інструменту.

source: Diameter
bg: Диаметър
it: Diametro
pt_br: Diâmetro
uk: Діаметр

source: offset z
bg: Офсет на z
uk: зміщення від

source: offset x
bg: Офсет на x
uk: зміщення x

source: <b>Tool information</b>
bg: <b> Информация за инструмента</b>
it: <b>Informazione utensile</b>
pt_br: <b>Informação da ferramenta</b>
uk: <b>Інформація про інструмент</b>

source: G and M code information as well as speed and feed
bg: информация за G и M кодове, както и за скорост и подаване
it: Informazioni sui codici G e M, così come velocità e avanzamento
pt_br: Informações sobre os códigos G e M, incluindo o avanço e a velocidade do spindle
uk: Інформація про коди G та M, а також швидкість та подача

source: active_mcodes_label
bg: активен_mcodes_етикет
pt_br: Códigos-M Ativos

source: active_gcodes_label
bg: активен_gcodes_етикет
it: active_mcodes_label
pt_br: Códigos-G Ativos

source: Displays the current velocity
bg: Показва текущата скорост
it: Visualizza la velocità corrente
pt_br: Exibe a velocidade atual
uk: Відображає поточну швидкість

source: <b>Rapid Override</b>
bg: <b> Бързо придвижване</b>
it: <b>Superamento Rapido</b>
pt_br: <b>Substituir Vel. Rápida[%]</b>
uk: <b>Швидке перевизначення</b>

source: Displays the programmed feed rate
bg: Показва програмираната скорост на подаване
it: Visualizza la velocità di avanzamento programmata
pt_br: Apresenta a velocidade de avanço programada
uk: Відображає запрограмовану швидкість подачі

source: reset feed override to 100 %
bg: нулиране на замяната на подаването на 100%
it: reimpostare l'avanzamento al 100%
pt_br: Reajustar o avanço para 100%
uk: скинути перевизначення подачі на 100%

source: <b>Cooling</b>
bg: <b>Охлаждане</b>
it: <b>Refrigerante</b>
pt_br: <b>Refrigerante</b>
uk: <b>Охолодження</b>

source: <b>Spindle</b>
bg: <b>Шпиндел</b>
it: <b>Mandrino</b>
uk: <b>Шпиндель</b>

source: Main
bg: Главна
it: Principale
pt_br: Principal
uk: Головний

source: Start as fullscreen
bg: Стартирайте като пълен екран
it: Inizia con schermo intero
pt_br: Iniciar em tela cheia
uk: Розпочати в повноекранному режимі

source: Start maximized
bg: Старт максимизиран
it: Avvia massimizzato
pt_br: Iniciar maximizado
uk: Розгорнути в розгорнутому вигляді

source: Start as window
bg: Стартирайте като прозорец
it: Inizia come finestra
pt_br: Iniciar como janela
uk: Почати як вікно

source: X Pos.
bg: X Позиция.
pt_br: Posição X.
uk: Поз X.

source: Y Pos.
bg: У Поз.
pt_br: Posição Y.
uk: Поз Y.

source: Width
bg: Ширина
it: Larghezza
pt_br: Largura
uk: Ширина

source: Height
bg: Височина
it: Altezza
pt_br: Altura
uk: Висота

source: hide title bar
bg: скрий заглавната лента
it: nascondi la barra del titolo
pt_br: Ocultar a barra de título
uk: приховати рядок заголовка

source: hide cursor
bg: скрий курсора
it: Nascondi puntatore
pt_br: Ocultar cursor
uk: приховати курсор

source: hide tooltips
bg: скриване на пояснения
it: nascondere tooltips
pt_br: Ocultar dicas de ferramentas
uk: приховати підказки

source: <b>Main Window</b>
bg: <b>Основен прозорец</b>
it: <b> Finestra principale </b>
pt_br: <b>Tela principal</b>
uk: <b>Головне вікно</b>

source: Show keyboard on offset
bg: Показване на клавиатурата при отместване
it: Mostra la tastiera su offset
pt_br: Mostrar teclado para offsets
uk: Показувати клавіатуру зі зміщенням

source: Show keyboard on tooledit
bg: Показване на клавиатурата в tooledit
it: Mostra la tastiera su tooledit
pt_br: Mostrar teclado no Editor de ferramentas
uk: Показувати клавіатуру в ToolEdit

source: Show keyboard on MDI
bg: Покажи клавиатурата в режим MDI
it: Mostra la tastiera su MDI
pt_br: Mostrar teclado no MDI
uk: Показувати клавіатуру на MDI

source: Show keyboard on EDIT
bg: Показвай клавиатурата при редакция
it: Mostra la tastiera su EDIT
pt_br: Mostrar teclado no EDIT
uk: Показувати клавіатуру під час редагування

source: Show keyboard on load file
bg: Показване на клавиатурата при зареждане на файл
it: Mostra la tastiera sul file caricato
pt_br: Mostrar o teclado ao carregar o arquivo
uk: Показувати клавіатуру під час завантаження файлу

source: <b>Virtual Keyboard</b>
bg: <b>Виртуална клавиатура</b>
it: <b>Tastiera virtuale</b>
pt_br: <b>Teclado Virtual</b>
uk: <b>Віртуальна клавіатура</b>

source: show preview
bg: показване на визуализация
it: Mostra anteprima
pt_br: Prévia do programa
uk: показати попередній перегляд

source: show offsets
bg: Покажи компенсации
it: mostra gli offset
pt_br: Exibir Offsets
uk: показати зміщення

source: <b>On Touch off</b>
bg: <b> При докосване</b>
it: <b> Contatto off </b>
pt_br: <b>On Toque off</b>
uk: <b>Увімкнено/вимкнено Touch</b>

source: Relative Color
bg: Относителен цвят
it: Colore relativo
pt_br: Cor relativa
uk: Відносний колір

source: Absolute Color
bg: Абсолютен цвят
it: Colore assoluto
pt_br: Cor Absoluta
uk: Абсолютний колір

source: DTG Color
bg: Цвят DTG
it: Colore DTG
pt_br: Cor DTG
uk: Колір DTG

source: Homed color
bg: Цвят при нулиране
it: Colore selezionato
pt_br: Cor de referência
uk: Домашній колір

source: Unhomed color
bg: Unhomed цвят
it: Colore deselezionato
pt_br: Cor não referenciada
uk: Нерозташований колір

source: Size
bg: Размер
it: Grandezza
pt_br: Tamanho
uk: Розмір

source: Digits
bg: Цифри
it: Cifre
pt_br: Dígitos
uk: Цифри

source: toggle DRO mode clicking on the DRO
bg: превключване на режима на DRO щракване върху DRO
it: modalità DRO cliccare sul DRO
pt_br: Alterna o modo DRO clicando no DRO
uk: перемикання режиму DRO клацання на DRO

source: Grid size
bg: Размер на мрежата
it: Dimensione Griglia
pt_br: Tamanho da grade
uk: Розмір сітки

source: Show DRO
bg: Показване на DRO
it: Mostra DRO
pt_br: Mostrar DRO
uk: Показати DRO

source: Show offsets
bg: Покажи компенсации
it: Mostra gli offset
pt_br: Mostrar desvios
uk: Показати зміщення

source: Show DTG
bg: Покажи DTG
it: Mostra DTG
pt_br: Mostrar DTG
uk: Показати DTG

source: <b>Mouse Button mode</b>
bg: <b>Режим на бутона на мишката</b>
it: <b>Mouse modalità pulsante</b>
pt_br: <b>Modo de botão do mouse</b>
uk: <b>Режим кнопок миші</b>

source: left rotate, middle move, right zoom
bg: ляво завъртане, средно преместване, дясно увеличение
it: rotazione sinistra, movimento centrale, zoom destro
pt_br: Girar para a esquerda, Mover para o centro, Zoom para a direita
uk: поворот ліворуч, рух посередині, масштабування праворуч

source: left zoom, middle move, right rotate
bg: ляво увеличение, средно преместване, дясно завъртане
it: zoom sinistro, movimento centrale, rotazione destra
pt_br: Zoom para a esquerda, Mover para o centro, Girar para a direita
uk: масштабування ліворуч, рух посередині, поворот праворуч

source: left move, middle rotate, right zoom
bg: ляв ход, средно завъртане, дясно увеличение
it: movimento sinistro, ruota centrale, zoom destro
pt_br: Mover para a esquerda, Girar para o centro, Zoom para a direita
uk: лівий хід, середній поворот, правий зум

source: left zoom, middle rotate, right move
bg: ляво увеличение, средно завъртане, дясно движение
it: zoom sinistro, ruota centrale, mossa destra
pt_br: Zoom para a esquerda, Girar para o centro, Mover para a direita
uk: масштабування ліворуч, поворот посередині, переміщення праворуч

source: left move, middle zoom, right rotate
bg: ляв ход, средно увеличение, дясно завъртане
it: movimento sinistro, zoom centrale, rotazione destra
pt_br: Mover para a esquerda, Zoom para o centro, Girar para a direita
uk: ліворуч хід, масштабування посередині, поворот праворуч

source: left rotate, middle zoom, right move
bg: ляво завъртане, средно увеличение, дясно движение
it: rotazione sinistra, zoom centrale, movimento destro
pt_br: Girar para a esquerda, Zoom para o centro, Mover para a direita
uk: поворот ліворуч, масштабування посередині, рух праворуч

source: <b>Preview</b>
bg: <b>Изглед</b>
it: <b>Anteprima </b>
pt_br: <b>Pré-visualização</b>
uk: <b>Попередній перегляд</b>

source: X-position in pixel from top left corner of the screen
bg: Позиция X в пиксели от горния ляв ъгъл на екрана
it: X-posizione in pixel dall'angolo in alto a sinistra dello schermo
pt_br: Posição X em pixels a partir do canto superior esquerdo da tela
uk: Позиція X у пікселях від верхнього лівого кута екрана

source: Max. messages
bg: Макс. съобщения
it: Max. messaggi
pt_br: Número máximo de mensagens
uk: Макс. кількість повідомлень

source: Font
bg: Шрифт
it: Carattere
pt_br: Fonte
uk: Шрифт

source: Y-position in pixel from top left corner of the screen
bg: Y-положение в пиксели от горния ляв ъгъл на екрана
it: Y-posizione in pixel dall'angolo in alto a sinistra dello schermo
pt_br: Posição Y em pixels a partir do canto superior esquerdo da tela
uk: Позиція Y у пікселях від верхнього лівого кута екрана

source: The width of the messages
bg: Широчината на съобщенията
it: La larghezza dei messaggi
pt_br: A largura das mensagens
uk: Ширина з повідомлень

source: The maximum messages you want to be shown
bg: Макс. брой съобщения , които да се показват
it: I messaggi massimi da mostrare
pt_br: O número máximo de mensagens que você deseja exibi
uk: Максимальна кількість повідомлень, які ви хочете бачити

source: The font to use
bg: Шрифтът, който се използва
it: Il carattere da usare
pt_br: A fonte a ser utilizada
uk: Шрифт для використання
