Repository: LinuxCNC/linuxcnc
Catalog: src/po/gmoccapy/*.po
Languages: bg, it, pt_br, uk

source: Use frames
bg: Използване на рамки
it: Utilizza cornici
pt_br: Usar molduras
uk: Використовуйте рамки

source: If checked, the messages will be in a frame.
bg: Ако е маркирано, съобщенията ще бъдат в рамка.
it: Se selezionato, i messaggi saranno in una cornice.
pt_br: Se marcado, as mensagens estarão em uma moldura.
uk: Якщо позначено, повідомлення будуть у рамці.

source: Launch test message
bg: Стартиране на тестово съобщение
it: Avviare il messaggio di prova
pt_br: Lançar mensagem de teste
uk: Тестове повідомлення запуску

source: Push here to launch a test message to test your settings.
bg: Натисни тук за тестово съобщение.
it: Premere qui per lanciare un messaggio di prova per testare le impostazioni.
pt_br: Clique aqui para enviar uma mensagem de teste para verificar suas configurações.
uk: Натисніть тут, щоб запустити тестове повідомлення для перевірки налаштувань.

source: <b>gmoccapy messages</b>
bg: <b>gmoccapy съобщение</b>
pt_br: mensagens gmoccapy
uk: <b>повідомлення gmoccapy</b>

source: Theme
bg: Теми
pt_br: Tema
uk: Тема

source: Icon Theme
bg: Тема на иконата
it: Tema icone
uk: Тема значків

source: Alert Audio
bg: Звук за предупреждение
it: Allarme audio
pt_br: Áudio de alerta
uk: Звукове сповіщення

source: Warning Audio
bg: Аудио предупреждение
it: Avvertenza Audio
pt_br: Áudio de aviso
uk: Звукове попередження

source: Enable sound
bg: Включване на звуците
it: Abilita suoni
pt_br: Ativar som
uk: Увімкнути звук

source: G-code Theme
bg: Тема на иконата
pt_br: Tema G-code
uk: Тема G-коду

source: <b>Themes and sound</b>
bg: <b>Теми и звук</b>
it: <b>Temi e suoni</b>
pt_br: <b>Temas e som</b>
uk: <b>Теми та звук</b>

source: Appearance
bg: Облик
it: Aspetto
pt_br: Aparência
uk: Зовнішній вигляд

source: Scale jog velocity
bg: Скалиране на скоростта на движение
it: Velocità della corsa
pt_br: Escala velocidade de jog
uk: Масштаб швидкості штовхання

source: Scale rapid override
bg: Бързо заместване на мащаба
it: Superamento scala rapido
pt_br: Substituição rápida de escala
uk: Швидке перевизначення масштабу

source: Scale feed override
bg: Заместване на мащабното подаване
it: Superamento scala avanzamento
pt_br: Escala substituição de alimentação
uk: Перевизначення подачі масштабу

source: Scale spindle override
bg: Заместване на мащаба на шпиндела
it: Superamento scala mandrino
uk: Перевизначення масштабу шпинделя

source: <b>Hardware MPG Scale</b>
bg: <b>Хардуерна скала за MPG</b>
it: <b>Scala Hardware MPG</b>
uk: <b>Апаратна шкала миль на галон</b>

source: Starting RPM
bg: Начални обороти
it: Avvio RPM
uk: Початок RPM

source: Spindle bar min
bg: Склала на шпиндела min
it: Rotazione mandrino min
uk: Мін. шпиндельна планка

source: Spindle bar max
bg: Склала на шпиндела max
it: Rotazione mandrino max
uk: Макс. довжина шпинделя

source: Use unlock code
bg: Използване на код за отключване
it: Utilizzare il codice di sblocco
uk: Використати код розблокування

source: Do not use unlock code
bg: Не използвай код за отключване
it: Non utilizzare il codice di sblocco
uk: Не використовуйте код розблокування

source: Use hal pin to unlock
bg: Използвайте хал-пин за отключване
it: Utilizzare pin hal per sbloccare
uk: Використайте PIN-код Hal для розблокування

source: <b>Unlock settings</b>
bg: <b>Настройки за отключване</b>
it: <b>Sblocca impostazioni</b>
uk: <b>Розблокувати налаштування</b>

source: Hide turtle Jog Button
bg: Скриване на Бутон за движение костенурка
it: Nascondi il Jog Button tartaruga
uk: Приховати кнопку підйому черепахи

source: Turtle jog Factor
bg: Фактор на движение костенурка
it: Fattore di jog tartaruga
uk: Фактор пробіжок черепахи

source: <b>Turtle Jog</b>
bg: <b>Движение костенурка</b>
it: <b>Jog Lento</b>
uk: <b>Черепашача пробіжка</b>

source: Hardware
bg: Хардуер
uk: Апаратне забезпечення

source: Use auto tool measurement
bg: Използване на автоматично измерване на инструмента
it: Utilizzare la misurazione automatica degli utensili
uk: Використовуйте автоматичне вимірювання інструменту

source: Z Pos.
bg: Z Позиция.
uk: Поз Z.

source: Max. Probe
bg: Макс. Сонда
it: Max. Sonda
uk: Макс. зонд

source: Probe Height
bg: Височина на сондата
it: Altezza della sonda
uk: Висота зонда

source: <b>Probe Information</b>
bg: <b>Информация за сондата</b>
it: <b> Informazione Sonda</b>
uk: <b>Інформація про зонд</b>

source: Search Vel.
bg: Скорост на търсене.
it: Ricerca Vel.
uk: Пошук Vel.

source: Probe Vel.
bg: Скорост на сондата.
it: Sonda Vel.
uk: Зонд Vel.

source: <b>Probe velocities</b>
bg: <b>Скорост на сондата</b>
uk: <b>Швидкості зонда</b>

source: No valid configuration found in your INI file, please take a look at the WIKI to check how to configure the settings.
bg: Няма валидна конфигурация открита във вашия INI файл, моля, погледнете WIKI, за да проверите как да конфигурирате настройките.
it: Nessuna configurazione valida trovato nel tuo file INI, Si prega di dare un'occhiata il WIKI per verificare come per configurare le impostazioni.
uk: У вашому INI-файлі не знайдено коректної конфігурації. Будь ласка, перегляньте WIKI, щоб дізнатися, як налаштувати параметри.

source: <b>Tool Measurement</b>
bg: <b> Измерване на инструмента</b>
it: <b> Misura utensile</b>
uk: <b>Вимірювання інструменту</b>

source: Reload Tool on Start
bg: Презареждане на инструмента при стартиране
it: Ricarica Utensile all'Avvio
uk: Перезавантажити інструмент на початку

source: If checked, the tool in spindle will be saved on each change and the last tool will be reloaded at start of the GUI. Also it's length offset will be reloaded.
bg: Ако е проверено, инструментът в шпиндела ще се запазва при всяка промяна и последният инструмент ще бъде презареден при стартиране на графичния потребителски интерфейс. Също така е ще бъде презаредено отместване по дължина.
it: Se selezionato, l'utensile sul mandrino sarà salvato ad ogni cambiamento e l'ultimo utensile verrà ricaricato all'inizio della GUI. Anche la lunghezza dell'offset sarà ricaricata.
uk: Якщо позначено, інструмент у шпинделі буде збережено при кожній зміні і останній інструмент буде перезавантажено під час запуску графічного інтерфейсу. Також буде перезавантажено його зміщення довжини.

source: You use NO_FORCE_HOMING, so the reload of a tool at start is not possible.
bg: Използвате NO_FORCE_HOMING, така че презареждането на инструмент в началото не е възможно.
it: E' attivo NO_ FORCE_HOMING, così la ricarica di un utensile all'inizio non è possibile.
uk: Ви використовуєте NO_FORCE_HOMING, тому перезавантаження інструменту на початку неможливе.

source: <b>Reload Tool</b>
bg: <b>Презареждане на инструмент</b>
it: <b> Ricarica utensile</b>
uk: <b>Інструмент перезарядки</b>

source: current file
bg: текущ файл
it: file corrente
uk: поточний файл

source: none
bg: няма
it: niente
uk: жодного

source: <b>File to load on start</b>
bg: <b>Файл за първоначално зареждане</b>
it: <b>File da caricare all'inizio</b>
uk: <b>Файл для завантаження на початку</b>

source: Select user dir
bg: Избор на потребителска директория
it: Selezionare cartella utente
uk: Виберіть каталог користувача

source: <b>Jump to dir</b>
bg: <b> Изберете преминаване към dir</b>
uk: <b>Перейти до каталогу</b>

source: Do not use run from line
bg: Не използвай старт от ред
it: Non usare partenza dalla linea
uk: Не використовуйте запуск з рядка

source: Use run from line
bg: Използвай старт от ред
it: Utilizzare partenza dalla linea
uk: Використовуйте запуск від рядка

source: <b>Run from line</b>
bg: <b>Старт от ред</b>
it: <b>Partenza dalla linea</b>
uk: <b>Бігти від лінії</b>

source: Use keyboard shortcuts
bg: Използване на бързи клавишни комбинации
it: Utilizzare le scorciatoie della tastiera
uk: Використання комбінацій клавіш

source: <b>Keyboard shortcuts</b>
bg: <b>Бързи клавиши</b>
it: <b> Scorciatoie tastiera</b>
uk: <b>Сполучення клавіш</b>

source: Advanced Settings
bg: Разширени настройки
it: Impostazioni Avanzate
uk: Додаткові налаштування

source: Settings
bg: Настройки
it: Impostazioni
uk: Налаштування

source: User tab 1
bg: Потребителски раздел 1
it: Scheda utente 1
uk: Вкладка користувача 1

source: User tabs
bg: Потребителски бутони
it: Schede utente
uk: Вкладки користувача

source: Estop the machine [F1]
bg: Estop машината [F1]
it: Fermare la macchina [F1]
uk: Зупиніть машину [F1]

source: Turn the machine on/off [F2]
bg: Включване/изключване на машината [F2]
it: Accendere / spegnere la macchina [F2]
uk: Увімкнення/вимкнення машини [F2]

source: enter manual mode to jog axis by hand or touch off [F3]
bg: влизане в ръчен режим, за ръчно движение на оста [F3]
it: inserire la modalità manuale in asse jog a mano o toccare [F3]
uk: увійдіть у ручний режим для ручного переміщення осі або дотику [F3]

source: enter MDI mode to launch G-code commands [F5]
bg: Влезте в MDI режим за изпълнение на Г-код команди [F5]
it: immettere la modalità MDI per lanciare comandi G-code [F5]
uk: увійдіть у режим MDI для запуску команд G-коду [F5]

source: enter auto mode to run programs
bg: влизане в автоматичен режим за стартиране на програми
it: entrare in modalità auto per eseguire programmi
uk: увійдіть у автоматичний режим для запуску програм

source: show user tabs
bg: Показване на потребителски раздели
it: mostrare le schede utente
uk: показати вкладки користувачів

source: Enter the settings page, the default code is "123"
bg: Влезте в страницата с настройки, кодът по подразбиране е "123"
it: Inserisci la pagina delle impostazioni, il codice predefinito è "123"
uk: Увійдіть на сторінку налаштувань, код за замовчуванням — «123»

source: open homing button list
bg: отваряне на списък с бутони за нулиране
it: aprire l'elenco dei pulsanti
uk: відкрити список кнопок повернення додому

source: open touch off button list
bg: отваряне на списъка с бутони за нулиране с докосване
it: aperto tocco fuori elenco pulsante
uk: відкрити список кнопок відключення

source: Open the tooleditor page
bg: Отваряне на редактора на инструменти
it: Aprire la pagina dell'editore degli utensili
uk: Відкрити сторінку редактора інструментів

source: World Mode
bg: World Режим
it: Modo globale
uk: Світовий режим

source: Switch motion mode between Joint and World mode F12 or $ key does the same
bg: Превключване на режима на движение между съвместен и световен режим F12 или клавишът $ правят същото
it: Modalità di commutazione tra modalità Joint e World F12 o $key fa lo stesso
uk: Перемикання режиму руху між режимом «Суглоб» та «Світ» Клавіша F12 або $ виконує ту саму функцію

source: make the preview as large as possible
bg: направете визуализацията възможно най-широка
it: rendere l'anteprima il più grande possibile
uk: зробити попередній перегляд якомога більшим

source: Close gmoccapy / leave the program
bg: Затваряне на gmoccapy / напускане на програмата
it: Chiudere gmoccapy / lasciare il programma
uk: Закрити gmoccapy / вийти з програми

source: Load a new program
bg: Зареждане на нова програма
it: Carica un nuovo programma
uk: Завантажити нову програму

source: Run the loaded program
bg: Стартиране на заредената програма
it: Eseguire il programma caricato
uk: Запустіть завантажену програму

source: Stop the running program
bg: Спиране на изпълняваната програма
it: Fermare il programma in esecuzione
uk: Зупинити запущену програму

source: Pause the running program
bg: Пауза на изпълняващата се програма
it: Pausa il programma in esecuzione
uk: Призупинити запущену програму

source: Run the loaded program step by step
bg: Изпълнение на заредената програма стъпка по стъпка
it: Eseguire il programma caricato passo dopo passo
uk: Запустіть завантажену програму крок за кроком

source: run the program from a certain line, attention, that is dangerous, because the previous lines will not checked!
bg: стартирайте програмата от определен ред, внимание, това е опасно, защото предишните редове няма да бъдат проверени!
it: eseguire il programma da una certa linea, attenzione, questo è pericoloso, perché le linee precedenti non vengono controllate!
uk: запустити програму з певного рядка, увага, це небезпечно, бо попередні рядки не будуть перевірені!

source: Machine or not the optional blocks of the program. If the button is pressed, the optional blocks will not be machined. The button will indicate this by a yellow background.
bg: Машината или не избираемите блокове на програмата. Ако бутонът е натиснат, допълнителните блокове няма да бъдат обработвани. Бутонът ще укаже това с жълт фон.
it: Esegue o no i blocchi facoltativi del programma. Se il pulsante viene premuto, i blocchi opzionali non verranno lavorati. Il pulsante indicherà questo con uno sfondo giallo.
uk: Обробляти чи ні додаткові блоки програми. Якщо кнопку натиснути, додаткові блоки не будуть оброблені. Кнопка позначатиме це жовтим фоном.

source: Edit the loaded program
bg: Редактиране на заредената програма
it: Modifica il programma caricato
uk: Редагувати завантажену програму

source: delete MDI history
bg: изтриване на историята на MDI
it: cancellare la cronologia MDI
uk: видалити історію MDI

source: Delete MDI history
bg: Изтриване на История на MDI
it: Cancellare la cronologia MDI
uk: Видалити історію MDI

source: Open classicladder
bg: Отворете classicladder
it: Apri Classicladder
uk: Відкрита класична драбина

source: Hal-Scope
bg: ХАЛ-ОСЦИЛОСКОП

source: launch hal scope
bg: стартиране на Hal осцилоскопа
it: avvio halscope
uk: запуск прицілу HAL

source: Status
bg: Статут
it: Stato
uk: Статус

source: launch linuxcnc status
bg: стартиране на състоянието на linuxcnc
it: lanciare lo stato linuxcnc
uk: статус запуску linuxcnc

source: Hal Meter
bg: Хал Метър
uk: Речі з метрами

source: launch hal meter
bg: Стартиране на hal метър
it: avvio halmeter
uk: запуск hal meter

source: Calibration
bg: Калибриране
it: Calibrazione
uk: Калібрування

source: launch calibration
bg: стартиране на калибриране
it: avvio calibrazione
uk: калібрування запуску

source: Halshow
bg: ХАЛ-Инфо
uk: Галшоу

source: opens the show hal tool
bg: отваря инструмента show hal
it: avvia la visualizzazione haltool
uk: відкриває інструмент Show Hall

source: save the file using the original name
bg: запазване на файла с оригиналното име
it: salvare il file utilizzando il nome originale
uk: зберегти файл, використовуючи оригінальну назву

source: save the file with a new name
bg: запазване на файла с ново име
it: salvare il file con un nuovo nome
uk: зберегти файл з новою назвою

source: clear the edit field and make a new file
bg: изчистете полето за редактиране и създайте нов файл
it: cancellare il campo di modifica e creare un nuovo file
uk: очистити поле редагування та створити новий файл

source: Show or hide the virtual keyboard
bg: Показване или скриване на виртуалната клавиатура
it: Mostrare o nascondere la tastiera virtuale
uk: Показати або приховати віртуальну клавіатуру

source: Go back to main button list
bg: Връщане към списъка с основните бутони
it: Torna all'elenco dei pulsanti principali
uk: Повернутися до головного списку кнопок

source: Select a tool by number
bg: Избиране на инструмент по номер
it: Selezionare un utensile per numero
uk: Виберіть інструмент за номером

source: change tool with the command M61 Q?, no machine move will be done
bg: смяна на инструмента с командата M61 Q?, няма да бъде извършен ход на машината
it: cambia utensile con il comando M61 Q?, nessun movimento della macchina verrà eseguito
uk: змінити інструмент за допомогою команди M61 Q?, переміщення верстата не буде виконано

source: change tool to the selected one
bg: смяна на инструмента с избрания
it: cambiare utensile con quello selezionato
uk: змінити інструмент на вибраний

source: touch off the tool and set the value to the tool table
bg: Докосване на инструмента до детаила и записване на стойността в таблицата с инструменти
it: toccare l'utensile e impostare il valore nella tabella degli utensili
uk: торкніться інструменту та встановіть значення в таблицю інструментів

source: touchoff tool x
bg: touchchoff инструмент x
it: contatto utensile x
uk: інструмент для дотику x

source: touchoff tool z
bg: touchchoff инструмент z
it: contatto utensile z
uk: інструмент для торкання Z

source: Move to your home directory
bg: Преместване в домашната директория
it: Spostarsi nella home directory
uk: Перейти до вашого головного сторінка

source: Jump to user defined directory
bg: Преминаване към дефинирана от потребителя директория
it: Salta alla cartella definita dall'utente
uk: Перейти до користувацького каталогу

source: Move to parent directory
bg: Преместване в предходна директория
it: Passa alla cartella superiore
uk: Перемістити до батьківського каталогу

source: Select the previous file
bg: Изберете предишния файл
it: Seleziona il file precedente
uk: Вибрати попередній файл

source: Select the next file
bg: Избор на следващия файл
it: Selezione file successivo
uk: Вибрати наступний файл

source: select the highlighted file and return the path
bg: изберете маркирания файл и върнете пътя
it: seleziona il file evidenziato e ritorna il percorso
uk: вибрати виділений файл і повернути шлях

source: Close without returning a file path
bg: Затваряне без връщане на път към файл
it: Chiudere senza restituire un percorso di file
uk: Закрити без повернення шляху до файлу

source: Load File
bg: Зареждане на файл
it: Carica file
uk: Завантажити файл

source: home joints
bg: Нулиране на ставите
it: home articolazioni
uk: Головна сторінках суглоби

source: Cl.-ladder
uk: Cl.-драбина

source: <b>G-Code</b>
pt_br: <b>Código-G</b>
